Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: We recommend to use binary packages provided by the package manager integrated within your Operating System. GNUnet is reportedly available for at least: <ul> <li><a href="https://pkgs.alpinelinux.org/package/edge/testing/x86_64/gnunet">Alpine</a></li> <li><a href="https://aur.archlinux.org/packages/gnunet/">Arch (AUR)</a></li> <li><a href="https://packages.debian.org/search?keywords=gnunet">Debian</a></li> <li><a href="https://copr.fedorainfracloud.org/coprs/yosl/gnunet/">Fedora (Copr)</a></li> <li><a href="https://guix.gnu.org/en/packages/G/">Guix</a></li> <li><a href="https://github.com/Homebrew/homebrew-core/blob/master/Formula/gnunet.rb">Homebrew</a></li> <li><a href="https://search.nixos.org/packages?from=0&size=50&sort=relevance&query=gnunet">NixOS</a></li> <li><a href="install-on-openwrt.html">OpenWrt</a></li> </ul> If GNUnet is available for your Operating System and it is missing, send us feedback so that we can add it to this list. Furthermore, if you are interested in packaging GNUnet for your Operating System, get in touch with us at gnunet-developers@gnu.org if you require help with this job. If you were using an Operating System with the APT package manager, GNUnet could be installed as simple as:
zh_hant: 我們建議您使用與我們操作系統整合的軟體套件管理系統所提供的二進制程式包。GNUnet據稱至少可用於： <ul> <li><a href="https://pkgs.alpinelinux.org/package/edge/testing/x86_64/gnunet">Alpine</a></li> <li><a href="https://aur.archlinux.org/packages/gnunet/">Arch (AUR)</a></li> <li><a href="https://packages.debian.org/search?keywords=gnunet">Debian</a></li> <li><a href="https://copr.fedorainfracloud.org/coprs/yosl/gnunet/">Fedora (Copr)</a></li> <li><a href="https://guix.gnu.org/en/packages/G/">Guix</a></li> <li><a href="https://github.com/Homebrew/homebrew-core/blob/master/Formula/gnunet.rb">Homebrew</a></li> <li><a href="https://search.nixos.org/packages?from=0&size=50&sort=relevance&query=gnunet">NixOS</a></li> <li><a href="install-on-openwrt.html">OpenWrt</a></li> </ul> 如果 GNUnet可用於您的作業系統但是您沒有在此列表中找到它，請將此情況回饋給我們，以便我們將其添加到此列表中。此外，如果您有興趣為您的作業系統 pack GNUnet，（若您需要這項工作的幫助）請通過 gnunet-developers@gnu.org 與我們聯繫。如果您使用的是帶有 APT 軟體套件管理系統的作業系統，GNUnet 的安裝非常簡單：

source: Next we describe a generic way to install from source. If you are using one of the following Operating Systems these step-by-step guides might be useful: <a href="install-on-archpi.html">ArchPi</a>, <a href="install-on-debian9.html">Debian 9</a>, <a href="install-on-macos.html">Mac OS</a>, <a href="install-on-netbsd.html">NetBSD</a>, <a href="install-on-ubuntu1804.html">Ubuntu 1804</a>. Be aware that not all of them might be totally up-to-date! Please <a href="engage.html">ask us</a> if you get stuck.
zh_hant: 接下來，我們將描述一種從原始碼安裝的通用方法。如果您使用的是以下作業系統的其中一個，這些分步指南可能會對您有幫助：<a href="install-on-archpi.html">ArchPi</a>, <a href="install-on-debian9.html">Debian 9</a>, <a href="install-on-macos.html">Mac OS</a>, <a href="install-on-netbsd.html">NetBSD</a>, <a href="install-on-ubuntu1804.html">Ubuntu 1804</a>。請注意，有指南些可能不是最新的！如果您遇到困難，請<a href="engage.html">詢問我們</a>。

source: First, install the <a href="https://git.gnunet.org/gnunet.git/tree/README">required dependencies</a> of GNUnet. There are base requirements and optional requirements.
zh_hant: 首先，安裝<a href="https://git.gnunet.org/gnunet.git/tree/README">所需的 GNUnet 從屬物</a>。有許多與之相關的基礎要求與非強制的要求。

source: Now, you need to decide if you want to install GNUnet from the release tarball or from git. If you want to use GNUnet and there is no binary package available for your OS, you should stick with the release tarball. If you want to develop using the most recent build, you should go with the <a href="https://git.gnunet.org/">git repository</a>.
zh_hant: 現在，您需要決定是從 release tarball 還是從 git 來安裝 GNUnet。如果您想使用 GNUnet 且沒有適用於您的作業系統的二進制程式包，您應該要繼續使用 release tarball。如果您想使用最新版本進行開發，您應該使用 <a href="https://git.gnunet.org/">git 存儲庫</a>。

source: To compile gnunet from the git source you can do so by entering:
zh_hant: 要從 git 源編譯 gnunet，您可以輸入：

source: Before building GNUnet, make sure that you setup the required groups and add your user to the group <code>gnunet</code>:
zh_hant: 在構建 GNUnet 之前，請確保您設置了所需的組並將您的用戶添加到組 <code>gnunet</code>：

source: To compile GNUnet, execute:
zh_hant: 欲編譯 GNUnet，請執行：

source: You can find more configuration flags in the <a href="https://git.gnunet.org/gnunet.git/tree/README">README</a>.<br> Install GNUnet with:
zh_hant: 您可以在 <a href="https://git.gnunet.org/gnunet.git/tree/README">README</a>中找到更多配置標誌。<br> 使用以下命令安裝GNUnet：

source: You can now start GNUnet by running:
zh_hant: 現在，您可以通過運行以下命令來啟動GNUnet：

source: Check the <a href="https://docs.gnunet.org/handbook/gnunet.html#Minimal-configuration">handbook</a> for detailed documentation. For a more hands-on experience, <a href="https://gnunet.org/en/use.html">continue here</a>.
zh_hant: 查看<a href="https://docs.gnunet.org/handbook/gnunet.html#Minimal-configuration">手冊</a>以獲得詳細文檔。欲獲得更多實際操作經驗，<a href="https://gnunet.org/en/use.html">請於此處繼續</a>。

source: On this page you can find links to our technical specifications.
zh_hant: 您可在此頁面上，找到我們的技術規格的連結。

source: How to use GNUnet - in a nutshell
zh_hant: 如何使用 GNUnet - 簡而言之

source: Filesharing
zh_hant: 檔案共享

source: Minimal Groupchat
zh_hant: 最小群組聊天

source: GNS with CLI
zh_hant: 帶有 CLI 的 GNS

source: GNS with Browser
zh_hant: 帶瀏覽器的 GNS

source: Conversation
zh_hant: 對話

source: Trouble Shooting
zh_hant: 排解疑難

source: Accessing GNUnet
zh_hant: 訪問 GNUnet

source: Leaving GNUnet
zh_hant: 離開 GNUnet

source: Make sure your GNUnet installation works...
zh_hant: 確保您的 GNUnet 安裝能夠運行...

source: ... and play around with it.
zh_hant: ...並多方嘗試。

source: CADET (and Chat)
zh_hant: CADET (與聊天)

source: Chatting with a (simple) client
zh_hant: 與一個（簡單的）客戶聊天

source: Name resolution using GNS on the command line
zh_hant: 在命令行上使用 GNS 進行名稱解析

source: Name resolution using GNS with a browser
zh_hant: 在瀏覽器中使用 GNS 進行名稱解析

source: You can't reach other people's nodes
zh_hant: 您無法到達其他人的節點

source: OMG you guys broke my internet
zh_hant: 天哪，你們打破了我的網際網路

source: Videos related to GNUnet
zh_hant: 與 GNUnet 相關的影片

source: News archives:
zh_hant: 新聞檔案：

source: Frequently asked questions
zh_hant: 常見問題

source: For IdPs
zh_hant: 對於 IdPs

source: Self-sovereign, Decentralised Identity Management and Personal Data Sharing
zh_hant: 自主權、分散的身份管理和個人資料共享

source: Self-sovereign
zh_hant: 自主權

source: You manage your identities and attributes locally on your computer. No need to trust a third party service with your data.
zh_hant: 您在電腦上本地管理您的身份和屬性。無需將您的資料託付給第三方服務。

source: Decentralized
zh_hant: 去中心化

source: You can share your identity attributes securely over a decentralized name system. This allows your friends to access your shared data without the need of a trusted third party.
zh_hant: 您可以通過分散的名稱系統安全地共享您的身份屬性。這允許您的朋友無需透過信任的第三方即可訪問您的共享數據。

source: Standard-compliant
zh_hant: 符合標準

source: You can use OpenID Connect to integrate reclaim in your web sites.
zh_hant: 您可以使用 OpenID Connect 將回收整合到您的網站中。

source: Technology
zh_hant: 科技

source: For users
zh_hant: 對於使用者

source: For websites
zh_hant: 對於網站

source: Decentralised identity directory
zh_hant: 去中心化身份目錄

source: The decentralised GNU Name System (GNS) gives users full and exclusive authority over their attributes by sharing them over user-owned namespaces.
zh_hant: 分散的 GNU 名稱系統 (GNS) 通過在用戶擁有的命名空間上共享屬性，賦予用戶對其屬性的完全和獨占權限。

source: Cryptographic access control
zh_hant: 密碼訪問控制

source: Users regularly publish fresh, up-to-date attributes which can be retrieved and read only by authorized relying parties parties without direct user interaction -- even if the user is offline!
zh_hant: 用戶定期發布最近的、最新的屬性，這些屬性只能由授權的依賴方檢索和讀取，無需用戶直接交互——即使用戶處於離線狀態！

source: Principles
zh_hant: 原則

source: Identity and attribute management
zh_hant: 身份和屬性管理

source: Users regularly publish fresh, up-to-date attributes which can be retrieved by requesting parties without direct user interaction -- even if the user is offline! Access to attributes is controlled through an ecryption based access control layer.
zh_hant: 用戶時常發佈最近的、最新的屬性，請求方無需與用戶進行直接互動即可檢索這些屬性——即使用戶處於離線狀態！此為通過基於加密 (encryption based) 的訪問控制層 (access control layer) 來控制對屬性的訪問。

source: Authorization
zh_hant: 授權

source: To access attributes, requesting parties request authorization from the user thrugh the use of OpenID Connect. If access is granted, the relying party is given the necessary decryption key material. The user may at any time revoke this access or modify the authorization decision.
zh_hant: 為了訪問屬性，請求方通過使用 OpenID Connect 向用戶請求授權。如果訪問被同意，依賴方將獲得必要的解密密鑰材料。用戶可以隨時撤銷此訪問權限或修改授權決定。

source: Attribute retrieval
zh_hant: 屬性提取

source: Relying parties retrieve encrypted identity data from the decentralised directory. It is able to decrypt all those attributes that the user has authorized it to access using the respective key.
zh_hant: 依賴方從分散的目錄中檢索加密的身份數據。它能夠使用相應的密鑰解密所有用戶已授權訪問的屬性。

source: GNU maintainer. Network security &amp; privacy researcher. Software architect.
de: GNU Maintainer. Netzwerksicherheit und Privatsphäre. Software-Architekt.
es: Responsable del mantenimiento de GNU. Especialista en seguridad de redes. Investigador en privacidad informática. Arquitecto de Software.

source: Entrepreneur, Investor, Fortune 100 CIO, IT company director in different industries, ….
de: Unternehmer, Investor, CIO bei Marktführern, Leiter von IT-Firmen in verschiedenen Branchen...
es: Emprendedor, inversor, CIO seleccionado por la revista Fortune 100, Director de TI en diferentes industrias.

source: Applied cryptography. Contact to W3c &amp; Tor.
de: Angewandte Kryptografie. Ansprechpartner für W3C und TOR.
es: Criptografía aplicada. Contacto para W3C &amp; Tor.

source: Theoretical foundations.
de: Theoretische Grundlagen.
es: Fundamentos teóricos.

source: Founder of the GNU project. Ethical guidance and licensing.
de: Gründer des GNU project. Ethische Richtlinien und Lizenzvergabe.
es: Fundador del proyecto GNU. Orientación ética y licencias.

source: PhD Student, TU Munich. Currently teaching.
de: Doktorand an der TU München. Zurzeit lehrend tätig.
es: Estudiante de doctorado, TU Múnich. Actualmente es profesor.

source: PhD Student, Inria..
de: Doktorand, Inria.
es: Estudiante de doctorado, INRIA.

source: Software engineer.
de: Software-Ingenieur.
es: Ingeniero de Software.

source: Sustainable business development.
de: Nachhaltige Unternehmensentwicklung.
es: Desarrollo de negocios sostenibles.
it: Realizzando pensieri profondi

source: Software engineer. Works on libebics.
de: Software-Ingenieur. Arbeitet an libebics.
es: Ingeniero de Software. Trabaja en libebics.
fr: EBICS.

source: Translator (Spanish)
de: Übersetzer (Spanisch).
es: Traductor (español)

source: Translator (Italian)
de: Übersetzer (Italienisch).
es: Traductora (italiano)

source: Hardware security module
de: Hardware-Sicherheitsmodul
es: Módulo de seguridad de hardware

source: Risk management
de: Risikomanagement
es: Gestión de riesgos

source: PhD student, TU Munich. Currently teaching.
de: Doktorand an der TU München. Zurzeit lehrend tätig.
es: Estudiante de doctorado, TU Múnich. Actualmente es profesor.

source: Software engineer. Works on Android wallet.
de: Software-Ingenieur. Arbeitet an einer Android-Wallet.
es: Ingeniero de Software. Trabaja en la Android Wallet.

source: Taler System Architecture
de: Systemarchitektur von Taler
es: Arquitectura del Sistema Taler

source: GNU Taler Bibliography
de: Bibliografie von GNU Taler
es: Bibliografía de GNU Taler

source: by
de: von
es: por

source: and
de: und
es: y

source: available upon request
de: erhältlich auf Anfrage
es: disponible bajo petición

source: Advantages for Citizens
de: Vorteile für Taler-Nutzer
es: Ventajas para los ciudadanos

source: Taler largely functions like digital cash. You withdraw money from your bank account into your electronic wallet, and can henceforth spend digital cash. The electronic wallet can carry multiple currencies.
es: Taler funciona en gran parte como dinero efectivo electrónico. Usted retira dinero de su cuenta bancaria para acreditar su billetera electrónica, y entonces puede utilizar dinero efectivo electrónico. La billetera electrónica es compatible con diferentes tipos de monedas.

source: Secure
de: Sicher
es: Seguro
fr: Sûr
it: Sicuro

source: Taler uses modern cryptography, ensuring that there is no counterfeit. Your digital wallet is safer than your physical wallet. At most, you can lose its contents because your computer or mobile is irreparably damaged or compromised. Unlike a physical wallet, you can make backups to secure against data loss.
es: Taler utiliza criptografía moderna, que asegura que no haya falsificación. Es por ello que una billetera electrónica es más segura que una billetera física. A lo mucho, podrá perder el contenido de su billetera electrónica si su computadora o teléfono móvil estuviesen irremediablemente dañados o comprometidos. A diferencia de una billetera física, puede realizar copias de seguridad para protegerse contra la pérdida de datos.

source: Private
de: Anonym
es: Privado

source: Your transactions are private, neither the payment service provider nor merchant needs to learn your identity. There is no need to give out credit card numbers or other sensitive information. The merchant will only be able to do exactly the transaction you agreed to.
es: Sus transacciones son privadas, ni el proveedor de servicios de pago ni el comerciante necesitan conocer su identidad. No es necesario dar números de tarjetas de crédito u otra información delicada. El comerciante sólo será capaz de hacer exactamente la transacción que se acordó entre ambas partes.

source: Convenient
de: Bequem
es: Práctico

source: You will be able to withdraw money to replenish the digital coins in your wallet using your credit card or wire transfers. Afterwards you can pay with one-click using the Taler wallet, which optionally keeps your transaction history on your computer.
es: Podrá retirar dinero para reponer las monedas electrónicas en su billetera utilizando su tarjeta de crédito o transferencias electrónicas. Después puede pagar con un solo clic usando la billetera Taler, que opcionalmente guarda el historial de transacciones en su computadora.

source: Stable
de: Stabil
es: Estable

source: Coins in your digital wallet will be of the same denomination as the cash in your physical wallet. Taler is not a crypto-currency, so you do not have to worry about cryto-currency related value fluctuations. Banking with Taler is subject to the usual government protections for financial services.
es: Las monedas en su billetera electrónica serán de la misma denominación que el efectivo en su billetera física. Taler no es una moneda criptográfica, por lo que no tiene que preocuparse por las fluctuaciones del valor relacionadas con la moneda. La banca con Taler está sujeta a las protecciones habituales del gobierno para los servicios financieros.

source: Wallet Browser Extension
de: Die Taler-Geldbörse als Browser-Erweiterung
es: Extensión Wallet para el Navegador Web

source: We currently provide a <a href="wallet.html">wallet browser extension</a> for Chromium, Chrome, Firefox, Opera and Edge. Wallets for mobile phones and other platforms will be available in the future.
es: Actualmente ofrecemos una <a href="wallet.html">billetera</a> como extensión para los navegadores Chromium, Chrome, Firefox, Opera y Edge. Las billeteras para teléfonos móviles y otras plataformas estarán disponibles a futuro.

source: Taler Demo
de: Demoversion von Taler
es: Demo Taler

source: You can see how Taler works in practice by visiting our <a href="https://demo.taler.net">demo page</a>.
es: Puede ver cómo funciona Taler visitando nuestra <a href="https://demo.taler.net">página de demostración</a>.

source: The Taler Wallet for customers
de: Die Taler-Geldbörse für Käufer
es: La Billetera Taler para clientes

source: Customers interact with the Taler system using the Taler wallet:
es: Los clientes interactúan con el sistema Taler utilizando la billetera Taler:

source: To <b>withdraw</b> electronic coins, the customer transfers funds from his bank account to the Taler payment service provider (the exchange). The wire transfer subject must match a code identifying the customer's wallet. After the wire transfer is complete, the wallet will automatically withdraw the coins from the exchange.
es: Para <b>retirar</b> monedas electrónicas, el cliente transfiere fondos de su cuenta bancaria al proveedor de servicios de pago de Taler (el proveedor de intercambios). El asunto de la transferencia bancaria debe coincidir con un código que identifique la billetera del cliente. Una vez finalizada la transferencia, la billetera debitará automáticamente las monedas del proveedor de intercambios.

source: To <b>spend</b> electronic coins, a merchant must cause the wallet to display a proposal for some purchase. The wallet will ask the customer for one-click confirmation. Payment is then instant. Transaction histories and digitally signed contracts can be preserved by the wallet.
es: Para <b>gastar</b> monedas electrónicas, se requiere que un comerciante entregue a la billetera una propuesta de compra. La billetera le pedirá al cliente una confirmación de un solo clic. El pago es luego instantáneo. El historial de transacciones y los contratos firmados digitalmente pueden ser conservados por la billetera.

source: The customer can use the wallet to <b>review</b> his balance. The wallet can contain different currencies, and may be shared across devices. Customers can make backups of the wallet to secure its contents against hardware failures.
es: El cliente puede utilizar la billetera para <b>verificar</b> su saldo. La billetera puede contener diferentes monedas y puede ser compartida entre dispositivos. Los clientes pueden realizar copias de seguridad de la billetera para proteger su contenido contra fallas de hardware.

source: An archived, public mailing list for GNU Taler is hosted at <a href="https://lists.gnu.org/mailman/listinfo/taler">https://lists.gnu.org/mailman/listinfo/taler</a>. You can send messages to the list at <a href="mailto:taler@gnu.org">taler@gnu.org</a>.
es: Una lista de correo pública archivada para GNU Taler está alojada en <a href="https://lists.gnu.org/mailman/listinfo/taler">https://lists.gnu.org/mailman/listinfo/taler</a>. Puede enviar mensajes a la lista <a href="mailto:taler@gnu.org">taler@gnu.org</a>.

source: Team members are generally reachable at <tt>LASTNAME@taler.net</tt>. All of us support receiving GnuPG encrypted e-mails.
es: Generalmente los miembros del equipo pueden ser contactados utilizando el siguiente formato: <tt>APELLIDO@taler.net</tt>. Todos aceptamos correos electrónicos cifrados con GnuPG.

source: We track open feature requests and bugs in our <a href="https://gnunet.org/bugs/">Bug tracker</a>, which is shared with the GNUnet project. You can also report bugs or feature requests to the mailing list.
es: Registramos públicamente las solicitudes de funcionalidades y los bugs en nuestro <a href="https://gnunet.org/bugs/">sistema de seguimiento de bugs</a>, que se comparte con el proyecto GNUnet. También puede reportar bugs o solicitudes a través de la lista de correo.

source: Executive team
de: Leitungsteam
es: Comité Ejecutivo

source: For non-technical commercial requests, please contact <tt>ceo AT taler.net</tt>.
es: Para solicitudes comerciales que no sean técnicas, póngase en contacto con <tt>ceo AT taler.net</tt>.

source: <p>The agreements ensure that the code will continue to be made available under free software licenses, but gives developers the freedom to move code between GNUnet and GNU Taler without worrying about licenses and the company the ability to dual-license (for example, so that we can distribute via App-stores that are hostile to free software).</p>
es: <p>Los acuerdos garantizan que el código seguirá siendo disponible bajo licencias de Software Libre, pero brinda a los desarrolladores la libertad de mover código entre GNUnet y GNU Taler sin preocuparse por las licencias y le otorga a la compañía la posibilidad de licencias dobles (por ejemplo, para que podamos distribuir a través de las App-stores que son hostiles al software libre).</p>

source: Taler for developers
de: Taler für Entwickler
es: Taler para programadores
fr: Taler pour les développeurs
it: Taler per programmatori

source: Free
de: Frei
es: Libre
fr: Libre

source: GNU Taler is free software implementing an open protocol. Anybody is welcome to integrate our reference implementation into their applications. Different components of Taler are being made available under different licenses. The Affero GPLv3+ is used for the exchange, the LGPLv3+ is used for reference code demonstrating integration with merchant platforms, and licenses like GPLv3+ are used for wallets and related customer-facing software. We are open for constructive suggestions for maximizing the adoption of this payment platform.
es: GNU Taler es Software Libre que implementa un protocolo abierto. Cualquier persona es bienvenida a integrar nuestra implementación de referencia en sus aplicaciones. Diferentes componentes de Taler están disponibles bajo diferentes licencias. El GPLv3 + de Affero se utiliza en el proveedor de intercambios, el LGPLv3 + se utiliza para el código de referencia demostrando la integración con las plataformas comerciales, y las licencias como GPLv3 + se utilizan para las billeteras y el software utilizado por los clientes. Estamos abiertos a sugerencias constructivas para maximizar la adopción de esta plataforma de pago.

source: RESTful
de: RESTful-basiert
es: Basado en REST
fr: Avec REST

source: Code
es: Código
it: Codice

source: Taler is currently primarily developed by a research team at <a href="http://www.inria.fr/">Inria</a> and <a href="https://gnunet.org/">GNUnet</a>. However, contributions from anyone are welcome. Our Git repositories can be cloned using the Git and HTTP access methods against <tt>git.taler.net</tt> with the name of the respective repository. A list of repositories can be found in our <a href="https://git.taler.net/">GitWeb</a>.
es: Taler está siendo actualmente desarrollado principalmente por un equipo de investigadores en <a href="http://www.inria.fr/">Inria</a> y <a href="https://gnunet.org/">GNUnet</A>. Sin embargo, las contribuciones de cualquier persona interesada son bienvenidas. Nuestros repositorios Git pueden ser clonados usando los métodos de acceso Git y HTTP en <tt> git.taler.net </tt> con el nombre del repositorio respectivo. Puede encontrar una lista de repositorios en nuestro <a href="https://git.taler.net/">GitWeb</a>.

source: In addition to this website, the <a href="https://git.taler.net/">documented code</a> and the <a href="https://api.taler.net/">API documentation</a>. Technical papers can be found in our <a href="bibliography.html">bibliography</a>.
es: En complemento de éste sitio web, el <a href="https://git.taler.net/">código documentado</a> y la<a href="https://api.taler.net/">documentación de la API</a> quedan a su disposición. Los documentos técnicos se pueden encontrar en nuestra <a href="bibliography.html">bibliografía</a>.

source: We have a mailing list for developer discussions. You can subscribe to or read the list archive at <a href="http://lists.gnu.org/mailman/listinfo/taler">http://lists.gnu.org/mailman/listinfo/taler</a>.
es: Tenemos una lista de correo para las discusiones entre desarrolladores. Puede suscribirse o leer el archivo de la lista en <a href="http://lists.gnu.org/mailman/listinfo/taler">http://lists.gnu.org/mailman/listinfo/taler</a >.
