Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: Finally, the exchange transfers funds corresponding to the digital coins redeemed by the merchants to the merchant's <b>bank</b> account. The exchange may combine multiple small transactions into one larger bank transfer. The merchant can query the exchange about the relationship between the bank transfers and the individual claims that were deposited.
de: Als letzten Schritt überweist die Taler-Wechselstube die Forderungen der Verkäufer an deren Geschäftsbanken (in der Grafik oben rechts). Die Geldbeträge entsprechen den Werten der digitalen Münzen. Die Taler-Wechselstube kann mehrere kleinere Beträge zu einem Gesamtbetrag zusammenfassen und an die Geschäftsbank überweisen. Die Verkäufer haben die Möglichkeit, ihre angemeldeten Forderungen und deren Überweisung an die Geschäftsbank bei der Taler-Wechselstube abzufragen.

source: Most importantly, the exchange keeps cryptographic proofs that allow it to demonstrate that it is operating correctly to third parties. The system requires an external <b>auditor</b>, such as a government-appointed financial regulatory body, to frequently verify the exchange's databases and check that its bank balance matches the total value of the remaining coins in circulation.
de: Eine bedeutende Eigenschaft der Wechselstube besteht darin, dass sie kryptografisch verschlüsselte Prüfdaten bereitstellt, um ihre korrekte Funktionalität nachzuweisen. Diese verschlüsselten Prüfdaten werden unabhängigen Parteien wie z.B. von Regierungen ernannten Finanzaufsichtsbehörden oder Auditoren zur Verfügung gestellt, die regelmäßig die Wechselstube-Datenbanken auf Funktionalität überprüfen können. Dabei vergleichen sie die Übereinstimmung der im Umlauf befindlichen Summe von digitalen Münzen mit den Überweisungen an Geschäftsbanken.

source: Without the auditor, the exchange operators could embezzle funds they are holding in reserve. Customers and merchants cannot cheat each other or the exchange. If any party's computers are compromised, the financial damage is limited to the respective party and proportional to the funds they have in circulation during the period of the compromise.
de: Die Rolle des Auditors sorgt dafür, dass die Taler-Wechselstube keine Forderungen oder Überweisungen unterschlagen kann. Ebenso wenig können Käufer oder Verkäufer sich gegenseitig oder die Wechselstube betrügen. Sollte der Computer eines Beteiligten beschädigt oder korrumpiert worden sein, beschränkt sich der finanzielle Schaden immer nur auf den Wert der digitalen Münzen auf dem jeweiligen Computer zum Zeitpunkt der Schadensentstehung.

source: <p>Taler does not use any Blockchain technology or Bitcoin directly. Taler is not based on proof-of-work or any other distributed consensus mechanism. Instead Taler is based on blind signatures.</p>
de: Taler verwendet keine Blockchain-Technologie oder Bitcoin selbst. Auch auf elektronisches gegenseitiges Beglaubigen in einem Web-of-trust- oder proof-of-work-Verfahren verzichtet Taler. Stattdessen setzt Taler auf Verfahren mit blinden Signaturen.

source: <p>It would be possible, however, to withdraw coins denominated in Bitcoin into a Taler wallet (with an appropriate exchange), which would give some benefits over plain Bitcoin, such as instant confirmation times.</p>
de: Es ist jedoch möglich, Bitcoin als Münzen in eine Taler-Geldbörse mittels einer dafür geeigneten Wechselstube zu überweisen. Dies brächte gegenüber Bitcoin sogar den Vorteil von sofortigen Zahlungsbestätigungen.

source: <p>Your wallet stores digital coins and thus ultimately your computer holds your balance. The exchange keeps funds matching all unspent coins in an escrow bank account.</p>
de: Die Taler-Geldbörse speichert digitale Münzen nur auf deinem Computer. Das heißt, nur dieser kennt den Bestand deiner Münzen. Die Taler-Wechselstube speichert dagegen auf einem Konto, das sie treuhänderisch verwaltet, die Forderungen von noch nicht gebuchten Münzen.

source: <p>Since the digital coins of value in your wallet are anonymized, the exchange can not assist you in recovering a lost or stolen wallet. Just like with a physical wallet for cash, you are responsible for keeping it safe.</p>
de: Weil die digitalen Münzen in der Geldbörse anonymisiert gespeichert werden, kann sie die Wechselstube bei einem Verlust oder Diebstahl nicht wiederherstellen. Wie bei echten Geldbörsen mit Banknoten und Münzen sind ihre Eigentümer allein verantwortlich für deren Sicherung.

source: <p>The risk of losing a wallet can be mitigated by making backups or keeping the balance reasonably low.</p>
de: Das Risiko eines Verlusts der Taler-Geldbörsen kann vermieden werden, indem man Backups von ihnen anfertigt oder ihren Bestand an digitalen Münzen niedrig hält.

source: <p>In case of a compromise of one of your devices, an attacker can spend coins from your wallet. Checking your balance might reveal to you that your device has been compromised.</p>
de: Im Fall eines Einbruchs in die Geräte können tatsächlich digitale Münzen aus dem Bestand in der Taler-Geldbörse ausgegeben werden. Es bietet sich daher an, den Bestand regelmäßig zu kontrollieren, um einen solchen Einbruch festzustellen.

source: <p>If your friend provides goods or services for you in exchange for a payment, they can easily set up a Taler merchant and receive the payment in their bank account.</p>
de: Falls andere Personen Waren oder Dienstleistungen verkaufen wollen, können sie die Rolle eines Verkäufers einnehmen und diese schnell und einfach einrichten, um deine Zahlung von der Taler-Geldbörse auf dem Girokonto ihrer Geschäftsbank zu erhalten.

source: <p>Future versions of the Taler wallet may allow exchanging coins among friends directly as well.</p>
de: Zukünftige Versionen der Taler-Geldbörse sehen vor, unter Freunden auch direkt digitale Münzen auszutauschen.

source: <p>Taler wallets can store digital coins corresponding to multiple different currencies such as the Euro, US Dollars or Bitcoins.</p>
de: Taler-Geldbörsen können gleichzeitig verschiedene digitale Münzen speichern, die in unterschiedlichen Währungen wie Euro, US-Dollar oder Bitcoin notiert sind.

source: <p>Taler currently does not offer conversion between currencies.</p>
de: Taler bietet jedoch derzeitig keinen Umtausch zwischen Währungen.

source: <p>Your wallet stores digital coins that are <a href="https://en.wikipedia.org/wiki/Blind_signature">blindly signed</a> by an exchange. The use of a blind signature protects your privacy as it prevents the exchange from knowing which coin it signed for which customer.</p>
de: Deine Geldbörse speichert digitale "Münzen", die von der Wechselstube blind signiert sind (siehe <a href="https://de.wikipedia.org/wiki/Digitale_Signatur">Digitale Signatur</a>). Dieses Verfahren schützt die privaten Daten, weil die Taler-Wechselstube dadurch keine Kenntnis davon erlangt, welche der Münzen von welchen Käufern sie signiert.

source: Taler provides accountability to ensure business operate legally, while also respecting civil liberties of citizens. Taler is a payment system based on open standards and free software. Taler needs governments as they set a financial framework and act as trusted regulators. Taler contributes to digital sovereignty in the critical financial infrastructure.
de: Taler fordert von den Wirtschaftsunternehmen Rechenschaft darüber, dass sie legale Geschäfte betreiben und gleichzeitig die Persönlichkeitsrechte und Privatsphäre der Menschen respektieren. Taler ist ein Bezahlsystem, das auf einem offenen Standard und freier Software basiert. Taler braucht Staatregierungen, die finanzrechtliche Rahmenbedingungen schaffen und als zuverlässige Kontrollorgane auftreten. Damit trägt dieses Bezahlsystem auch zur digitalen Selbstbestimmung von Einzelpersonen im Finanzsektor bei.

source: Taler was built with the goal of fighting corruption and supporting taxation. With Taler, the receiver of any form of payment is easily identified by the government, and the merchant can be compelled to provide the contract that was accepted by the customer. Governments can use this data to tax businesses and individuals based on their income, making tax evasion and black markets less viable.
de: Taler wurde mit dem Ziel entwickelt, Korruption zu unterbinden und sichere Besteuerungsgrundlagen bereitzustellen. Jeder Empfänger von Zahlungen aus Taler-Geldbörsen wird gegenüber der staatlichen fiskalischen Autorität eindeutig identifizierbar und ist demnach gezwungen, sich steuerlich zu veranlagen. Den Nachweis des Umsatzes können Verkäufer erbringen mithilfe des digital signierten Kaufvertrags, den ihre Kunden mit ihnen geschlossen haben. Staatsregierungen haben dadurch die Möglichkeit, die digitalen Kaufverträge von Handelsunternehmen bzw. die Einkommen von einzelnen privaten Verkäufern als Grundlage der Besteuerung heranzuziehen. Auf diese Weise haben Steuerflucht und Schwarzmarktgeschäfte nur noch eine minimale Wahrscheinlichkeit.

source: Thus, despite offering anonymity for citizens spending digital cash to buy goods and services, Taler also ensures that the state can observe incoming funds. This can be used to ensure businesses engage only in legal activities, and do not evade income tax, sales tax or value-added tax. However, this observational capability does not extend to the immediate personal domain. In particular, monitoring does not cover shared access to funds with trusted friends and family, or synchronizing wallets across multiple devices.
de: Auf der einen Seite versichert Taler als digitales Bezahlsystem die vollständige Anonymität der Käufer, die Waren und Dienstleistungen kaufen und bezahlen, auf der anderen Seite liefert Taler den Staatsregierungen eine sichere Besteuerungsgrundlage, mit der sie ihre öffentlichen Güter finanzieren können. Dieses Verfahren stellt gleichzeitig sicher, dass Handelsunternehmen nur legale Geschäfte abschließen und keine Steuern hinterziehen oder Mehrwertsteuern unterschlagen. Diese Überwachungsfunktion bezieht sich jedoch keinesfalls auf die Privatsphäre von Personen und erfasst ebenso wenig den geduldeten gemeinsamen Zugriff auf die Taler-Geldbörse durch Berechtigte wie Freunde oder Familienmitglieder sowie miteinander synchronisierte Geldbörsen auf verschiedenen Endgeräten.

source: Taler's payments are cryptographically secured. Thus, customers, merchants and the Taler payment service provider (the exchange) can mathematically demonstrate their lawful behavior in court in case of disputes. Financial damages are strictly limited, improving economic security for individuals, merchants, the exchange and the state.
de: Zahlungen in Taler sind kryptographisch verschlüsselt. Sowohl Käufer als auch Verkäufer und das Taler-Bezahlsystem selbst (die Taler-Wechselstube) können die Rechtschaffenheit ihrer Geschäfte mit ihren digitalen Kaufverträgen sogar vor Gericht beweisen, falls es zu einem Rechtsstreit kommen sollte. Ebenso sind die finanziellen Risiken äußerst beschränkt, was die Sicherheit des gemeinsamen Handelns für Einzelpersonen, Händler, die Taler-Wechselstube und den Staat enorm verbessert.

source: As a payment service provider, the Taler exchange is subject to financial regulation. Financial regulation and regular audits are critical to establish trust. In particular, the Taler design mandates the existence of an independent auditor who checks cryptographic proofs that accumulate at the exchange to ensure that the escrow account is managed honestly. This ensures that the exchange does not threaten the economy due to fraud.
de: Als Finanzdienstleister sind Taler-Wechselstuben der Finanzaufsicht unterstellt. Die Einhaltung von Gesetzen und regelmäßige Audits sind unerlässlich zur Bildung einer Vertrauensgrundlage. Zusätzlich fordert das Konzept des Taler-Bezahlsystems aber ganz bewusst einen unabhängigen Auditor. Der Auditor hat zu bestätigen, dass die von den Wechselstuben treuhänderisch verwalteten Konten stets korrekt gebucht werden. Dies sorgt dafür, dass keine einzige Wechselstube betrügerisch handelt.

source: Libre
de: Frei

source: Taler is free software implementing an open protocol standard. Thus, Taler will enable competition and avoid the monopolization of payment systems that threatens global political and financial stability today.
de: Taler ist eine freie Software, die ein offenes Protokoll verwendet. Dadurch fördert Taler den Wettbewerb von freien Lösungen und verhindert gleichzeitig Bezahlsysteme, deren gegenwärtige Monopolstellungen die politische und finanzielle Stabilität weltweit akut bedrohen.

source: Taler has an efficient design. Unlike Blockchain-based payment systems, such as Bitcoin, Taler will not threaten the availability of national electric grids or (significantly) contribute to environmental pollution.
de: Taler arbeitet effizient und ressourcenschonend. Im Gegensatz zu Bezahlsystemen, die das Blockchain-Prinzip verwenden, verbraucht Taler keine Unmengen von Energie und überlastet kein Stromnetz. Damit bringt Taler auch einen erheblichen Vorteil in Sachen Umweltschutz.

source: Taler assumes governments can observe traditional wire transfers entering and leaving the Taler payment system. Starting with the wire transfers, governments can obtain:
de: Taler beruht auf der Annahme, dass Staatsregierungen die herkömmlichen Bankverbindungen nachverfolgen können, wenn Überweisungen zwischen dem Taler-Bezahlsystem und den Geschäftsbanken stattfinden (Aufladungen der Taler-Geldbörse und Erstattung von Ansprüchen aus Geschäften). Regierungen besitzen damit die Informationen über

source: The total amount of digital currency withdrawn by a customer. The government can impose limits on how much digital cash a customer can withdraw within a given time frame.
de: den Gesamtbetrag digitaler Münzen, die Käufer an die Geldbörse überweisen - die Regierung kann dabei Höchstbeträge pro Zeitperiode festlegen

source: The income received by any merchant via the Taler system.
de: das Einkommen, das Verkäufer im Taler-Bezahlsystem erhalten

source: The exact details of the underlying contract that was signed between customer and merchant. However, this information would typically not include the identity of the customer.
de: die genauen Inhalte der zugrunde liegenden digitalen Kaufverträge zwischen Käufern und Verkäufern - ausgenommen jedoch private Daten der Käufer

source: The amounts of digital coins legitimately withdrawn by customers from the exchange, the value of non-redeemed digital coins in customer's wallets, the value and corresponding wire details of deposit operations performed by merchants with the exchange, and the income of the exchange from transaction fees.
de: die Beträge digitaler Münzen, die Käufer von Taler-Wechselstuben abbuchten, die verfügbaren Werte der Münzen in Geldbörsen, die Werte der Forderungen von Verkäufern und deren Rückerstattung durch Banküberweisung von den Wechselstuben an Geschäftsbanken sowie die Einkünfte der Wechselstuben aus Transaktionsgebühren

source: GNU Taler is an electronic payment system under development at <a href="http://www.inria.fr/">Inria</a>. We expect to make it operational in 2017. You can learn about Taler on this website, try the <a href="https://demo.taler.net">demo</a> and look at our <a href="https://docs.taler.net">developer</a> and <a href="https://api.taler.net">API</a> documentation.
de: Taler ist ein elektronisches Bezahlsystem, das bei <a href="http://www.inria.fr/">Inria</a> entwickelt wird. Wir rechnen mit seiner Einführung im Jahr 2017. Auf der <a href="https://demo.taler.net">Demo-Seite</a> kann man die Funktionsweise von Taler kennenlernen. Neben dieser Webseite bestehen die <a href="https://git.taler.net/">Code-Dokumentation</a>, die <a href="https://docs.taler.net">Entwicklerdokumentation</a> und die <a href="https://api.taler.net/">API-Schnittstellendokumentation</a>. Wissenschaftliche Literatur findet man in der <a href="bibliography.html">Bibliographie</a>.

source: Taler is easy to integrate with existing Web applications. Payments are cryptographically secured and are confirmed within milliseconds with extremely low transaction costs.
de: Taler integriert sich einfach und leicht in bestehende Webanwendungen. Die Zahlungen sind kryptographisch verschlüsselt, innerhalb von Millisekunden bestätigt und extrem kostengünstig.

source: Taler does not introduce a new currency. Taler uses a digital wallet storing coins and payment service providers with escrow accounts in existing currencies. Thus, Taler's cryptographic coins correspond to existing currencies, such as US Dollars, Euros or even Bitcoins.
de: Als Bezahlsystem stellt Taler noch keine neue Währung dar. Taler verbindet elektronische Geldbörsen, die digitale Münzen enthalten, und Anbieter für die Zahlungsabwicklung in bestehenden Währungen auf Treuhandkonten. Man kann also sagen, dass die kryptografischen Taler-Münzen herkömmlichen Währungen wie US-Dollar, Euro oder sogar Bitcoin entsprechen.

source: By design Taler does not suffer from many classes of security problems such as phishing or counterfeit. Despite its security features, Taler never rejects a legitimate customer due to a fraud-detection false positive.
de: Schon vom Konzept her verhindert Taler Falschgeld oder Sicherheitslücken wie Phishing und wird gleichzeitig jedoch niemals Käufern betrügerische Absichten unterstellen können.

source: When using Taler, merchant's revenue is transparent for tax collection authorities. Unlike cash and most digital currencies, Taler helps prevent black markets. Taler is not suitable for illegal activities.
de: Taler macht das Einkommen von Verkäufern (Einzelpersonen und Handelsunternehmen) den Steuerbehörden einsehbar. Im Gegensatz zu Bargeld und den meisten virtuellen Währungen unterbindet Taler somit jede Art von Schwarzmarkt. Dieses Bezahlsystem eignet sich aus Prinzip nicht für illegale Geschäfte.

source: When you pay with Taler, your identity does not have to be revealed to the merchant. Just like payments in cash, nobody else can track how you spent your electronic money. However, you obtain a legally valid proof of payment.
de: Taler hält die Identität der Käufer geheim, auch gegenüber den Verkäufern. Genauso wie beim Kauf mit Bargeld kann niemand Auskunft darüber erlangen, was mit dem Taler-Bezahlsystem gekauft wurde. Die Käufer erhalten jedoch garantiert einen Nachweis über ihre Zahlung und den erfolgten Eigentumsübergang.

source: Taler provides protocols and reference implementations that in principle enables anybody to run their own payment infrastructure, be it individuals, organizations or whole countries. Since the reference implementation is a <a href="http://www.gnu.org/">GNU</a> package, it will always remain free software.
de: Taler bietet Protokolle und Referenzanwendungen, die prinzipiell für alle möglichen Bezahlsysteme von Einzelpersonen, Organisationen und sogar ganzen Staaten geeignet sind. Die Referenzanwendung als <a href="http://www.gnu.org/">GNU-Package</a> wird immer freie Software sein und bleiben.

source: <p>To pay with Taler, customers install an electronic wallet on their device. Before the first payment, the wallet's balance must be charged in the desired currency by some other means of payment.</p> <p>Once the wallet is charged, payments on websites take only one click, are never falsely rejected by fraud detection and do not pose any risk of phishing or identity theft.</p>
de: Um mit dem Taler-Bezahlsystem einkaufen zu können, muss man eine elektronische Geldbörse auf einem Endgerät installieren. Vor der ersten Bezahlung ist es nötig, einen Wert in der gewünschten Währung an die Geldbörse zu überweisen. Dies erfolgt durch herkömmliche Banküberweisung oder durch Kreditkarten. Der aufgeladene Wert der Geldbörse kann dann mit nur einem Klick zum Bezahlen auf Webseiten verwendet werden. Die Verkäufer müssen diese Bezahlung als berechtigt annehmen. Ein Datendiebstahl (Phishing) ist dabei technisch ausgeschlossen, es werden keine persönlichen Daten übermittelt.

source: <p>To receive Taler payments, a merchant needs a bank account in the desired currency. We provide supporting software in various programming languages to make the integration painless. The merchant's backend for Taler transaction processing can run on the merchant's premises or be hosted by a third party.</p>
de: Um Zahlungen erhalten zu können, brauchen Verkäufer ein Girokonto in der gewünschten Währung bei einer Geschäftsbank. Das Taler-Bezahlsystem unterstützt die Software verschiedener Verkaufsplattformen in mehreren Programmiersprachen, um die Integration so einfach wie möglich zu machen. Das Backend der Händlerplattform kann dabei auf dem eigenen Rechner des Verkäufers oder gehostet laufen, um die Taler-Buchungen durchzuführen.

source: We have created a company, Taler Systems SA in Luxembourg.<br> Please contact <tt>invest@taler.net</tt> if you want to invest in Taler.
de: Taler Systems SA in Luxemburg ist die Gesellschaft, die Investitionen in das Taler-Bezahlsystem ermöglicht. Bitte kontaktieren Sie dafür <tt>invest@taler.net</tt>.

source: Our <a href="about.html">team</a> combines world-class business leaders, cryptographers, software engineers, civil-rights activists and academics. We are unified by a vision of how payments should work and the goal of imposing this vision upon the world.
de: Unser <a href="about.html">team</a> vereint Unternehmensleiter, Kryptographen, Softwareingenieure, Aktivisten und Akademiker. Uns verbindet die Vision eines einwandfreien Bezahlsystems und die Zielsetzung, diese Vision in die Welt zu bringen.

source: We are currently supported by <a href="http://www.inria.fr/">Inria</a>, the French national institute for research in informatics and automation, and the <a href="https://renewablefreedom.org/">Renewable Freedom Foundation</a>.
de: Gegenwärtig unterstützen uns <a href="http://www.inria.fr/">Inria</a>, das Nationale Forschungsinstitut für Informatik und Automatisierung, sowie die <a href="https://renewablefreedom.org/">Renewable Freedom Foundation</a>.

source: All transactions in Taler are secured using <a href="bibliography.html">modern cryptography</a> and trust in all parties is minimized. Financial damage is bounded (for customers, merchants and the exchange) even in the case that systems are compromised and private keys are stolen. Databases can be audited for consistency, resulting in either the detection of compromised systems or the demonstration that participants were honest. Actual transaction costs are fractions of a cent.
de: Alle Buchungen im Taler-Bezahlsystem sind mit aktuellen Methoden der <a href="bibliography.html">Kryptographie</a> geschützt. Selbst im Fall eines Verlusts oder Diebstahls privater Schlüssel ist ein eventueller Schaden für Käufer, Verkäufer und Wechselstuben begrenzt. Die Datenbanken unterstehen einem unabhängigen Auditing, das die Konsistenz ihrer Daten und Verfahren überprüft. Kompromittierte Endgeräte können so schnell erkannt werden. Das Auditing stellt zudem die Beweisgrundlage für die Rechtschaffenheit aller Beteiligten dar. Die Buchungskosten betragen übrigens nur Bruchteile eines Cent pro Buchung.
