Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: GNU's framework for secure p2p networking
zh_hant: GNU 為安全 p2p 制定的網路框架

source: Contact
es: Contacto
zh_hant: 聯絡

source: About GNUnet
zh_hant: 關於 GNUnet

source: Copyright Assignment
es: Asignación de derechos de autor
zh_hant: 版權轉讓

source: Bibliography
zh_hant: 參考書目

source: Source code of this site.
zh_hant: 本網站的原始碼。

source: Report issues with this website.
zh_hant: 舉報此網站的問題。

source: About
es: Acerca de GNU Taler
zh_hant: 關於

source: News
zh_hant: 最新消息

source: Applications
zh_hant: 應用程式

source: Community
zh_hant: 社群

source: Engage
zh_hant: 參與

source: GSoC Projects
zh_hant: GSoC 項目

source: Copyright for Contributors
es: Copyright para contribuidores
zh_hant: 貢獻者的版權

source: IRC Archive
zh_hant: IRC 檔案

source: Development
zh_hant: 發展

source: System Architecture
zh_hant: 系統架構

source: Roadmap
zh_hant: 藍圖

source: Source Code
zh_hant: 原始碼

source: Source Code Documentation
zh_hant: 原始碼相關文件

source: Continuous Integration
zh_hant: 持續整合

source: Development Tutorial
zh_hant: 開發教學

source: Documentation
de: Dokumentation
es: Documentación
it: Documentazione
zh_hant: 相關文件

source: Install
zh_hant: 安裝

source: Use
zh_hant: 使用

source: Videos
zh_hant: 影片

source: Glossary
es: Glosario
zh_hant: 詞彙表

source: Handbook
zh_hant: 手冊

source: FAQ
es: Preguntas frecuentes
zh_hant: 常見問題

source: News posts about changes related to GNUnet such as releases and events
zh_hant: 有關與 GNUnet 相關的更改（例如發行和事件）的新聞

source: subscribe to our RSS feed
zh_hant: 訂閱本站 RSS

source: read more
zh_hant: 閱讀更多

source: What is GNUnet?
zh_hant: 什麼是 GNUnet？

source: GNUnet is an alternative network stack for building secure, decentralized and privacy-preserving distributed applications. Our goal is to replace the old insecure Internet protocol stack. Starting from an application for secure publication of files, it has grown to include all kinds of basic protocol components and applications towards the creation of a GNU internet.
zh_hant: GNUnet 是個替代網絡堆棧，其主要目標為構建安全、分散和保護隱私的分佈式應用程序。我們的目標為替換舊的、不安全的互聯網協議棧。起始於一個用於安全發布文件的應用程式，GNUnet 已經發展到包含所有類型的基本協議組件和應用程序，並朝向創建 GNU 互聯網發展。

source: Today, the actual use and thus the social requirements for a global network differs widely from those goals of 1970. While the Internet remains suitable for military use, where the network equipment is operated by a command hierarchy and when necessary isolated from the rest of the world, the situation is less tenable for civil society.
zh_hant: 現今，全球網路的實際用途和社會需求與 1970 年的目標大不相同。雖然網際網路仍然適合軍事用途（網絡設備由指揮層操作，並在必要時與世界其他地方隔離），但民間社會的情況卻較站不住腳。

source: Due to fundamental Internet design choices, Internet traffic can be misdirected, intercepted, censored and manipulated by hostile routers on the network. And indeed, the modern Internet has evolved exactly to the point where, as Matthew Green put it, <a href="https://blog.cryptographyengineering.com/2015/08/16/the-network-is-hostile/">"the network is hostile"</a>.
zh_hant: 由於基本網際網路的設計選擇，網際網路的流量可能會被網路上的敵對路由器誤導、攔截、審查和操縱。而確實，現代網際網路已經發展到這個地步，如同 Matthew Green 所說的，<a href="https://blog.cryptographyengineering.com/2015/08/16/the-network-is-hostile/">"網路是懷有敵意的(the network is hostile)"</a>。

source: We believe liberal societies need a network architecture that uses the anti-authoritarian decentralized peer-to-peer paradigm and privacy-preserving cryptographic protocols. The goal of the GNUnet project is to provide a Free Software realization of this ideal.
zh_hant: 我們相信自由社會需要一個使用反獨裁分散的點對點範式、隱私保護加密協議的網路架構。GNUnet 項目的目標是提供並實現這種理想的自由軟體。

source: Specifically, GNUnet tries to follow the following design principles, in order of importance:
zh_hant: 具體而言，GNUnet 試圖遵循以下設計原則，其重要性如下：

source: GNUnet must be implemented as <a href="https://www.gnu.org/philosophy/free-sw.html">Free Software</a>.
zh_hant: GNUnet 的實施必須為<a href="https://www.gnu.org/philosophy/free-sw.html">自由軟體</a>。

source: GNUnet must minimize the amount of personally identifiable information exposed.
zh_hant: GNUnet 必須盡量減少暴露個人的可識別資訊量。

source: GNUnet must be fully distributed and resilient to external attacks and rogue participants.
zh_hant: GNUnet 必須完全分散，並能夠抵禦外部攻擊和異常的參與者。

source: GNUnet must be self-organizing and not depend on administrators or centralized infrastructure.
zh_hant: GNUnet 必須為自我組織，且不依賴於管理員或集中式基礎設施。

source: GNUnet must inform the user which other participants have to be trusted when establishing private communications.
zh_hant: GNUnet 必須通知用戶在建立私人通信時必須信任哪些其他參與者。

source: GNUnet must be open and permit new peers to join.
zh_hant: GNUnet 必須是開放的，並允許新的同行加入。

source: GNUnet must support a diverse range of applications and devices.
zh_hant: GNUnet 必須支持各種應用程式與設備。

source: GNUnet must use compartmentalization to protect sensitive information.
zh_hant: GNUnet 必須使用象限化分割 (compartmentalization) 來保護敏感信息。

source: The GNUnet architecture must be resource efficient.
zh_hant: GNUnet 架構必須是資源高效率的。

source: GNUnet must provide incentives for peers to contribute more resources than they consume.
zh_hant: GNUnet 必須為同行提供比他們消耗更多的資源的激勵。

source: To get know and learn more, please check our <a href="https://docs.gnunet.org/handbook/gnunet.html">handbook</a>, especially the <a href="https://docs.gnunet.org/handbook/gnunet.html#Key-Concepts">chapter on "Key Concepts"</a>, explaining the fundamental concepts of GNUnet: <ul> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Authentication">Authentication</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Accounting-to-Encourage-Resource-Sharing">Accounting to Encourage Resource Sharing</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Confidentiality">Confidentiality</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Anonymity">Anonymity</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Deniability">Deniability</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Peer-Identities">Peer Identities</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Zones-in-the-GNU-Name-System-_0028GNS-Zones_0029">Zones in the GNU Name System (GNS Zones)</a></li> <li><a href="https://docs.gnunet.org/handbook/gnunet.html#Egos">Egos</a></li> </ul>
zh_hant: 欲瞭解更多，請參考我們的<a href="https://docs.gnunet.org/handbook/gnunet.html">手冊</a>，尤其是<a href="https://docs.gnunet.org/handbook/gnunet.html#Key-Concepts">"關鍵概念 (Key Concepts)"的章節</a>，此章節解釋了 GNUnet 的基礎概念：<ul><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Authentication">驗證 (Authentication)</a></li>。<li><a href="https://docs.gnunet.org/handbook/gnunet.html#Accounting-to-Encourage-Resource-Sharing">說明鼓勵資源共享 (Accounting to Encourage Resource Sharing)</a></li><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Confidentiality">保密性 (Confidentiality)</a></li>。<li><a href="https://docs.gnunet.org/handbook/gnunet.html#Anonymity">匿名性 (Anonymity)</a></li><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Deniability">可否認性 (Deniability)</a></li><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Peer-Identities">對等身份 (Peer Identities)</a></li><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Zones-in-the-GNU-Name-System-_0028GNS-Zones_0029">GNU 名稱系統中的區域 (Zones in the GNU Name System; GNS Zones)</a></li><li><a href="https://docs.gnunet.org/handbook/gnunet.html#Egos">自我 (Egos)</a></li></ul>

source: More Resources
zh_hant: 更多資源

source: There are many more resources to learn about GNUnet besides the <a href="https://docs.gnunet.org/handbook/gnunet.html">handbook</a>, such as the <a href="https://bib.gnunet.org/">bibliography</a> with papers covering the various layers, many <a href="https://gnunet.org/en/video.html">videos</a> or a brief <a href="https://gnunet.org/en/glossary.html">glossary</a>.
zh_hant: 除了<a href="https://docs.gnunet.org/handbook/gnunet.html">手冊</a>之外，還有更多的資源可用於學習 GNUnet，例如，<a href="https://bib.gnunet.org/">參考書目</a>中包含有關各個層次的論文，許多<a href="https://gnunet.org/en/video.html">影片</a>或簡短的<a href="https://gnunet.org/en/glossary.html">詞彙表</a>。

source: You are most welcome to <a href="engage.html">get engaged into the conversation</a>, <a href="install.html">install GNUnet</a>, <a href="use.html">use it</a> and <a href="engage.html">contribute and get engaged</a> in various ways.
zh_hant: 非常歡迎您<a href="engage.html">參與對話</a>，<a href="install.html">安裝 GNUnet</a> ，<a href="use.html">使用它</a>並以各種方式<a href="engage.html">貢獻和參與</a>。

source: Please be aware that this project is (despite of it's age) still in an early alpha stage when it comes to software &#8211; its not an easy task to rewrite the whole Internet!
zh_hant: 請注意，這個項目（儘管它已經有了一定的年紀）在軟體方面仍處於早期 alpha 階段 &#8211; 要重寫整個 Internet 並不是一件容易的事！

source: Current funding
zh_hant: 當前資金

source: This project is receiving funding from the European Union’s Horizon 2020 research and innovation programme NGI Assure.
zh_hant: 此項目正在接受歐盟 Horizon 2020 研究和創新計劃 NGI Assure 的資助。

source: We are grateful for free hosting offered by the following organizations:
zh_hant: 我們感謝以下組織提供的免費託管服務：

source: Past funding
zh_hant: 過去的資金

source: We are grateful for past funding from the following organizations:
zh_hant: 我們感謝以下組織過去提供的資金：

source: Applications provided by GNUnet
zh_hant: GNUnet 提供的應用軟體

source: The GNU Name System
zh_hant: GNU 名稱系統

source: The <a href="gns.html">GNU Name System (GNS)</a> is a fully decentralized replacement for the Domain Name System (DNS). Instead of using a hierarchy, GNS uses a directed graph. Naming conventions are similar to DNS, but queries and replies are private even with respect to peers providing the answers. The integrity of records and privacy of look-ups are cryptographically secured. <!-- Too technical: GNS integrates a robust, efficient and instant key revocation mechanism. -->
zh_hant: <a href="gns.html">GNU 名稱系統 (GNS) </a>是域名系統 (DNS) 的完全去中心化替代品。GNS 不使用層次結構，而是使用有向圖。命名常規與 DNS 相似，但即使對於提供答覆的同行，查詢和回覆也是私密的。記錄的完整性和查詢的隱私是加密保護的。<!-- Too technical: GNS integrates a robust, efficient and instant key revocation mechanism. -->

source: Self-sovereign, decentralized identity provider
zh_hant: 自主權，分散式身份提供者

source: is a decentralized Identity Provider (IdP) service built in top of the GNU Name System. It allows users to securely share personal information with websites using standardized protocols (OpenID Connect).
zh_hant: 是一種建立在 GNU 名稱系統之上的去中心化身份提供者 (IdP) 服務。它允許用戶使用標準化協議 (OpenID Connect) 安全地與網站共享個人資訊。

source: Filesharing (Alpha)
zh_hant: 檔案共享 (Alpha)

source: GNUnet <a href="use.html#fs">filesharing</a> is an application that aims to provide censorship-resistant, anonymous filesharing. The publisher is empowered to make a gradual choice between performance and anonymity.
zh_hant: GNUnet的<a href="use.html#fs">文件共享</a>是一個旨在提供抗審查、匿名文件共享的應用程式。發布者有權在性能和匿名之間做出逐步選擇。

source: Conversation (Pre-Alpha)
zh_hant: 對話 (Pre-Alpha)

source: GNUnet conversation is an application that provides secure voice communication in a fully decentralized way by employing GNUnet for routing and transport.
zh_hant: GNUnet conversation 是一種應用程式，其透過採用 GNUnet 進行路由和傳輸、並以完全分散的方式提供安全語音通信。

source: Applications utilizing GNUnet
zh_hant: 利用 GNUnet 的應用程式

source: <a href="https://taler.net/">GNU Taler</a> is a new privacy-preserving electronic payment system. Payments are cryptographically secured and are confirmed within milliseconds with extremely low transaction costs.
zh_hant: <a href="https://taler.net/">GNU Taler</a> 是一種新的保護隱私的電子支付系統。付款由密碼保護，並且可以在幾毫秒內以極低的交易成本進行確認。

source: secushare
zh_hant: 安全共享

source: <a href="https://secushare.org/">secushare</a> is creating a decentralized social networking application on top of GNUnet. Using overlay multicast and the extensible PSYC protocol, notifications are distributed end-to-end encrypted to authorized recipients only.
zh_hant: <a href="https://secushare.org/">secushare</a> 正在 GNUnet 之上建立一個去中心化的社交網路應用程序。其使用覆蓋多播 (multicast) 和可擴展的 PSYC 協議，透過端對端 (end-to-end) 加密將通知分發給授權接收者。

source: pretty Easy privacy
zh_hant: 相當簡單的隱私 (pretty Easy privacy)

source: <a href="https://pep.foundation/">pretty Easy privacy</a> (p&#8801;p) is creating a usable end-to-end encrypted e-mail solution using opportunistic key exchange. p&#8801;p will use GNUnet to protect metadata and exploit new cryptographic protocols to verify keys.
zh_hant: <a href="https://pep.foundation/">相當容易的隱私 (pretty Easy Privacy) </a> (p&#8801;p)使用機會密鑰交換 (opportunistic key exchange) 建立可用的端到端加密電子郵件解決方案。p&#8801;p將會使用 GNUnet 來保護元資料 (metadata) 並利用新的加密協議來驗證密鑰。

source: Cadet-GTK
zh_hant: 學員GTK (Cadet-GTK)

source: <a href="https://gitlab.com/gnunet-messenger/cadet-gtk">Cadet-GTK</a> is a convenient but feature-rich graphical application providing messaging using the CADET subsystem. It is developed using GTK and libhandy for a convergent design.
zh_hant: <a href="https://gitlab.com/gnunet-messenger/cadet-gtk">Cadet-GTK</a> 是一種方便而功能豐富的圖形應用程序，Cadet-GTK 尤其使用 CADET 子系統提供消息傳遞。其使用 GTK 和 libhandy 開發的以收斂設計。

source: groupchat
zh_hant: 群組聊天

source: <a href="https://git.gnunet.org/groupchat.git/">groupchat</a> is a terminal user interface providing messaging using the CADET subsystem. It is developed using nim. Cadet-GTK and groupchat are planned to be compatible.
zh_hant: <a href="https://git.gnunet.org/groupchat.git/">groupchat</a> 是一個終端用戶界面，特別是使用 CADET 子系統提供消息傳遞。它使用 nim 來開發。Cadet-GTK 與 groupchat 被計劃為互相兼容。

source: GNUnet System Architecture
zh_hant: GNUnet 系統架構

source: Foundations
zh_hant: 基礎

source: The foundations of GNUnet are a distributed hash table (R5N), an SCTP-like end-to-end encrypted messaging layer (CADET), a public key infrastructure (GNS) and a pluggable transport system (TRANSPORT).<br> Using public keys for addresses and self-organizing decentralized routing algorithms, these subsystems replace the traditional TCP/IP stack.
zh_hant: GNUnet 的基礎是分佈式雜湊表 (R5N)、類似 SCTP 的端對端加密消息傳遞層 (CADET)、公鑰基礎設施 (GNS) 和可插拔傳輸系統 (TRANSPORT)。<br> 這些子系統使用公鑰作為地址和自組織分散式選路演算法，取代了傳統的 TCP/IP 堆棧。

source: Security
fr: Sécurité
it: Sicurezza
zh_hant: 安全性

source: GNUnet is implemented using a multi-process architecture. Each subsystem runs as a separate process, providing fault isolation and enabling tight permissions to be granted to each subsystem. Naturally, the implementation is a <a href="https://www.gnu.org/">GNU</a> package, and will always remain free software.
zh_hant: GNUnet 是使用多進程架構實現的。每個子系統都作為一個單獨的進程運行，以提供故障隔離並允許為每個子系統授予嚴格的權限。自然地，這是一個<a href="https://www.gnu.org/">GNU</a> package 的實現，並會持續保持為一個自由軟體。

source: System architecture
zh_hant: 系統架構

source: Subsystems
zh_hant: 子系統

source: APIs
zh_hant: 應用程式介面 (APIs)

source: Legend
zh_hant: 圖例

source: Contact information
de: Kontakt
es: Contacto
zh_hant: 聯絡資訊

source: The mailing list
de: Die Mailing-Liste
es: Lista de correo
zh_hant: 郵件列表

source: An archived, public mailing list for GNUnet is hosted at <a href="https://lists.gnu.org/mailman/listinfo/gnunet-developers">https://lists.gnu.org/mailman/listinfo/gnunet-developers</a>. You can send messages to the list at <a href="mailto:gnunet-developers@gnu.org">gnunet-developers@gnu.org</a>.
zh_hant: GNUnet 的存檔公共郵件列表託管在 <a href="https://lists.gnu.org/mailman/listinfo/gnunet-developers">https://lists.gnu.org/mailman/listinfo/gnunet-developers</a>。您可以於 <a href="mailto:gnunet-developers@gnu.org">gnunet-developers@gnu.org</a> 傳送訊息至此列表。

source: Contacting individuals
de: Mitglieder kontaktieren
es: Contacto con los miembros del equipo
zh_hant: 聯繫個人

source: GNUnet developers are generally reachable at either <tt>PSEUDONYM@gnunet.org</tt> or <tt>LASTNAME@gnunet.org</tt>. Most of us support receiving GnuPG encrypted Emails. Urgent and sensitive security issues may be addressed to the GNU maintainers <tt>schanzen</tt> and <tt>grothoff</tt>.
zh_hant: 通常可以通過 <tt>PSEUDONYM@gnunet.org</tt> 或 <tt>LASTNAME@gnunet.org</tt> 聯繫到 GNUnet 開發人員。我們大多數人都支持接收 GnuPG 加密的電子郵件。緊急和敏感的安全問題可交由 GNU 維護者 <tt>schanzen</tt> 與 <tt>grothoff</tt> 受理。

source: Reporting bugs
de: Funktionserweiterungen, Fehler und Bugs melden
es: Reportar errores
zh_hant: 回報錯誤

source: We track open feature requests and bugs for projects within GNUnet in our <a href="https://bugs.gnunet.org/">Bug tracker</a>. You can also report bugs or feature requests to the <a href="https://lists.gnu.org/mailman/listinfo/bug-gnunet">bug-gnunet</a> mailing list. The mailinglist requires no subscription.
zh_hant: 我們在 <a href="https://bugs.gnunet.org/">Bug tracker</a> 中追蹤 GNUnet 項目中的開放功能請求和錯誤。您也可以透過 <a href="https://lists.gnu.org/mailman/listinfo/bug-gnunet">bug-gnunet</a> 郵寄列表舉報錯誤以及提交功能請求。郵寄列表不需要進行訂閱。

source: <p> Contributors to GNUnet with Git access must sign the <a href="/static/pdf/copyright.pdf">copyright assignment</a> to ensure that the <a href="https://git.gnunet.org/gnunet-ev.git/tree/gnunet_taler_agreement.tex">GNUnet e.V. --- Taler Systems SA agreement on licensing and collaborative development</a> of the GNUnet and GNU Taler projects is satisfied. </p>
zh_hant: 擁有 Git 存取權限的 GNU Taler 貢獻者必須簽署<a href="/pdf/copyright.pdf">版權轉讓</a> ，確保已符合 GNUnet 與 GNU Taler 項目的 <a href="https://git.gnunet.org/gnunet-ev.git/tree/gnunet_taler_agreement.tex">GNUnet e.V. --- Taler 系統對於授權與協同開發的 SA 協議</a>。

source: <p>The agreements ensure that the code will continue to be made available under free software licenses, but gives developers the freedom to move code between GNUnet and GNU Taler without worrying about licenses and to give the company the ability to dual-license (for example, so that we can distribute via App-stores that are hostile to free software).</p>
zh_hant: <p>這些協定確保程式碼將持續地在自由軟體許可證之下被提供，這使開發人員可以自由地在 GNUnet 和 GNU Taler 之間移動程式碼，而不必擔心許可證問題，公司也能夠獲得雙重許可（例如，這樣我們就可以在對免費軟體懷有敵意的應用商店發布）。</p>

source: <p>Minor contributions (basically, anyone without Git access) do not require copyright assignment. Pseudonymous contributions are accepted, in this case simply sign the agreement with your pseudonym. Scanned copies are sufficient, but snail mail is preferred.</p>
es: <p>Contribuciones menores (básicamente, cualquier persona sin acceso a Git) no requieren asignación de derechos de autor. Aceptamos contribuciones mediante pseudónimos, simplemente firmando el acuerdo con el pseudónimo elegido. Copias escaneadas son suficientes, pero preferimos que sean enviadas a nuestra dirección de correo postal.</p>
zh_hant: <p>較小的貢獻（基本上，任何沒有 Git 訪問許可權的人）都不需要版權轉讓。我們也接受匿名貢獻，在此情況下，您只需使用您的假名簽署同意書並掃描副本即可，不過蝸牛郵件為更好的方式。</p>

source: GNUnet for developers
zh_hant: 適用於開發人員的 GNUnet

source: Repositories
zh_hant: 儲存庫

source: A list of our Git repositories can be found on our our <a href="https://git.gnunet.org/">Git Server</a>.
zh_hant: 您可以在我們的<a href="https://git.gnunet.org/"> Git 伺服器</a>上找到我們的 Git 存儲庫列表。

source: Technical papers can be found in our <a href="https://old.gnunet.org/bibliography">bibliography</a>.
zh_hant: 您可以於我們的<a href="https://old.gnunet.org/bibliography">參考書目中</a>找到技術文件。

source: Discussion
de: Diskussion
es: Debates
it: Discussione
zh_hant: 討論

source: We have a mailing list for developer discussions. You can subscribe to or read the list archive at <a href="http://lists.gnu.org/mailman/listinfo/gnunet-developers">http://lists.gnu.org/mailman/listinfo/gnunet-developers</a>.
zh_hant: 我們有一個郵件列表供開發人員討論。您可以於 <a href="http://lists.gnu.org/mailman/listinfo/gnunet-developers">http://lists.gnu.org/mailman/listinfo/gnunet-developers</a> 訂閱或是閱讀此檔案清單。

source: Regression Testing
de: Regressiontests mit Buildbot
es: Pruebas de regresión
fr: Tests de régression
it: Test delle regressioni
zh_hant: 回歸測試

source: We have <a href="https://buildbot.net/">Buildbot</a> automation tests to detect regressions and check for portability at <a href="https://old.gnunet.org/buildbot/gnunet/">https://old.gnunet.org/buildbot/gnunet/</a>.
zh_hant: 我們在 <a href="https://old.gnunet.org/buildbot/gnunet/">https://old.gnunet.org/buildbot/gnunet/</a> 上，提供了 <a href="https://buildbot.net/">Buildbot</a> 自動化測試，以檢測回歸併檢查可移植性。

source: Code Coverage Analysis
de: Testabdeckung
es: Análisis de cobertura de código
fr: Mesure de couverture du code
it: Analisi della copertura del codice
zh_hant: 程式碼覆蓋率分析

source: We use <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a> to analyze the code coverage of our tests, the results are available at <a href="https://old.gnunet.org/coverage/">https://old.gnunet.org/coverage/</a>.
zh_hant: 我們使用 <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a> 來分析我們測試的程式碼覆蓋率，其結果可從 <a href="https://old.gnunet.org/coverage/">https://old.gnunet.org/coverage/</a> 上獲得。

source: Performance Analysis
de: Performanceanalyse
es: Performance
fr: Analyse de performances
it: Analisi delle prestazioni
zh_hant: 績效分析

source: We use <a href="https://old.gnunet.org/gauger">Gauger</a> for performance regression analysis of the exchange backend at <a href="https://old.gnunet.org/gauger/">https://old.gnunet.org/gauger/</a>.
zh_hant: 我們於 <a href="https://old.gnunet.org/gauger/">https://old.gnunet.org/gauger/</a> 上使用 <a href="https://old.gnunet.org/gauger">Gauger</a> 對交換後端進行性能回歸分析。

source: Downloads
zh_hant: 下載

source: Here you can download releases of our software and find links to the various versions.
zh_hant: 在這裡，您可以下載我們發行的軟體版本，並找到各個版本的鏈接。

source: 0.11.x series
zh_hant: 0.11.x 系列

source: tarball
zh_hant: 壓縮包 (tarball)

source: The tarball of the latest version can be obtained from GNU FTP and its mirrors.
zh_hant: 您可以從 GNU FTP 及其鏡像獲得最新版本的壓縮包 (tarball)。

source: You can fetch the git tag of version 0.11.x from our development server:
zh_hant: 您可以從我們的開發服務器獲取版本 0.11.x 的 git 標籤：

source: Engage!
zh_hant: 參與！

source: About GNUnet e.V.
zh_hant: 關於 GNUnet e.V.

source: On December 27th 2013 a group of GNUnet hackers met at 30c3 to create the "Verein zur F&ouml;rderung von GNUnet e.V.", an association under German law to support GNUnet development. The Amtsgericht M&uuml;nchen registered the association on the 7th of March under VR 205287.
zh_hant: 2013 年 12 月 27 日，一群 GNUnet 黑客在 30c3 會面，創建了 "Verein zur F&ouml;rderung von GNUnet e.V."，一個根據德國法律支持 GNUnet 開發的協會。Amtsgericht M&uuml;nchen 於 3 月 7 日在 VR 205287 之下註冊了該協會。

source: The association is officially dedicated to supporting research, development and education in the area of secure decentralized networking in general, and GNUnet specifically. This is the official website for the association.
zh_hant: 該協會正式致力於支持安全分散網絡領域的研究、開發和教育，特別是 GNUnet。這是該協會的官方網站。

source: Becoming a Member of GNUnet e.V.
zh_hant: 成為 GNUnet e.V. 的成員

source: GNUnet developers with git (write) access can become members to participate in the decision process and formally support GNUnet e.V. For this, all you have to do is update the <tt>members.txt</tt> file in the <a href="https://git.gnunet.org/gnunet-ev.git/">gnunet-ev</a> repository. There are no membership dues; however, members are required to support GNUnet e.V. and in particularly contribute to the technical development within their means. For further details, we refer to the <a href="https://git.gnunet.org/gnunet-ev.git/">Satzung (Charter)</a> (currently only available in German, translations welcome).
zh_hant: 具有 git （寫）權限的 GNUnet 開發人員可以成為成員以參與決策過程並正式支持 GNUnet e.V。為此，您所需要做的就是更新 <tt>members.txt</tt> 檔案，其位於 <a href="https://git.gnunet.org/gnunet-ev.git/">gnunet-ev</a> 儲存庫。會員無須繳納會員費；然而，成員必須支持 GNUnet e.V，尤其是在力所能及的範圍內為技術發展做出貢獻。若欲瞭解更多的細節，請參閱 <a href="https://git.gnunet.org/gnunet-ev.git/">Satzung （章程）</a> （目前僅提供德語內容，歡迎提供翻譯協助）。

source: Governance
zh_hant: 治理
