Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: Taler is free software, and you can use the liberally-licensed reference code as a starting point to integrate Taler into your services. To use Taler, you do not need to pay license fees, and the free software development model will ensure that you can select from many competing integrators for support.
es: Taler es Software Libre, usted puede utilizar el código de referencia bajo licencia libre como punto de partida para integrar Taler a sus servicios. Para utilizar Taler, no necesita pagar tarifas de licencia, y el modelo de desarrollo de Software Libre asegurará de que pueda seleccionar entre muchos integradores competentes.

source: Cheap
de: Günstig
es: Barato

source: Taler is uses efficient cryptographic constructions with low bandwidth and storage requirements. Combined with Taler's strong security which makes fraud impossible, Taler payment service providers can operate with very low overhead and thus offer low transaction fees.
es: Taler utiliza estructuras criptográficas eficientes con bajos requisitos de ancho de banda y de almacenamiento. En combinación con la sólida seguridad de Taler que hace imposible el fraude, los proveedores de servicios de pago de Taler pueden operar con gastos muy bajos y, por lo tanto, ofrecen tarifas de transacción asequibles.

source: Taler can be used for different currencies (such as Euros, US Dollars or Bitcoins) and any amount, limited only by applicable regulatation and what denominations the payment service provider supports.
es: Taler se puede utilizar en diferentes monedas (como Euros, Dólares Estadounidenses o Bitcoins) y para cualquier importe, está limitado únicamente por las regulaciones aplicables y por los valores que el proveedor de servicios de pago admita.

source: Ethical
de: Ethisch
es: Ético
fr: Ethique
it: Etico

source: Taler prevents tax evasion and money laundering. Taler's protocols are efficient and do not use wasteful proof-of-work calculations. Taler encourages transparency by providing an open standard and free software reference implementations.
es: Taler evita la evasión fiscal y el lavado de dinero. Los protocolos de Taler son eficientes y no usan cálculos de evidencia innecesarios. Taler fomenta la transparencia proporcionando un estándar abierto e implementaciones de referencia de Software Libre.

source: Manuals for merchants
de: Gebrauchsanleitung für Händler
es: Manual para comerciantes

source: The GNU Taler merchant backend operator manual
de: Die Gebrauchsanleitung des Taler-Backend
es: Manual de operaciones del comerciante de GNU Taler [en]

source: The GNU Taler Web shop integration tutorial (PHP)
de: Tutorial für die Integration von Taler in Webshops (PHP)
es: Tutorial de integración de la tienda web GNU Taler (PHP) [en]

source: The GNU Taler Web shop integration tutorial (Python)
de: Tutorial für die Integration von Taler in Webshops (Python)
es: Tutorial de integración de la tienda web GNU Taler (Python) [en]

source: The GNU Taler Merchant Backend
de: Das Taler-Backend für Händler
es: Backend del comerciante de GNU Taler

source: Merchants process payments using the Taler backend:
de: Händler verwenden das Taler-Backend zur Zahlungsabwicklung:
es: Proceso de pagos del comerciante usando el backend de Taler:

source: The backend <b>signs</b> and <b>stores</b> the complete terms of offers made by the merchant to customers. For this, the merchant's frontend needs to give the customer's order in a JSON format to the backend.
es: El backend <b>firma</b> y <b>almacena</b> los términos completos de las ofertas hechas por el comerciante a los clientes. Para esto, el frontend del comerciante necesita dar la orden del cliente al backend en un formato de JSON.

source: The backend <b>validates</b> payments received from the wallet and <b>executes</b> them with the Taler payment service provider (the exchange). For this, the merchant's frontend must pass the payment request through to the Taler backend and check the HTTP status code that is returned.
es: El backend <b>valida</b> los pagos recibidos de la billetera y los <b>ejecuta</b> con el proveedor de servicios de pago de Taler (el proveedor de intercambios). Para ello, la interfaz del comerciante debe entregar la solicitud de pago a través del backend de Taler y comprobar el estado del protocolo HTTP que retorna.

source: The backend can <b>list</b> completed transactions and <b>map</b> wire transfers to sets of business transactions, including the exact terms of each contract.
es: El backend puede <b>listar</b> los pagos (transacciones) realizados y <b>relacionar</b> las transferencias bancarias con los pagos electrónicos correspondientes, incluyendo los términos exactos de cada contrato.

source: GNU Taler in the Press
de: Taler in den Medien
es: GNU Taler en la Prensa

source: Taxable Anonymous Libre Electronic Reserves
de: Taxierbare Anonyme Liberale Elektronische Reserven
es: Reservas Electrónicas Gravales, Anónimas y Libres

source: For Investors
es: Inversionistas

source: Citizens
es: Ciudadanos
it: Cittadini

source: Governments
es: Gobiernos
it: Governi

source: Developer Resources
es: Recursos de desarrollo

source: This page was created using <a href='https://www.gnu.org/'>Free Software</a> only.
es: Está página fue creada usando únicamente <a href='https://www.gnu.org/home.es.html'>Software Libre</a>

source: Developer Introduction
es: Introducción para desarrolladores

source: Taler largely functions like digital cash. You withdraw money from your bank account into your electronic wallet, and can henceforth spend digital cash. The electronic wallet can carry multiple currencies.
de: Taler funktioniert generell ähnlich wie jede virtuelle Währung. Man überweist Geld vom konventionellen Bankkonto in die Taler-Geldbörse, um aus ihrem Guthaben Einkäufe zu bezahlen. Die elektronische Geldbörse kann dabei mehrere digitale Währungen enthalten.

source: Taler uses modern cryptography, ensuring that there is no counterfeit. Your digital wallet is safer than your physical wallet. At most, you can lose its contents because your computer or mobile is irreparably damaged or compromised. Unlike a physical wallet, you can make backups to secure against data loss.
de: Taler verwendet aktuellste kryptografische Mittel, die jeden Betrug systematisch unterbinden. Die elektronische Geldbörse ist sogar sicherer als echtes Geld. Ein Schaden entsteht erst, wenn das Speichermedium, das die Daten der Geldbörse enthält, zerstört oder entwendet wurde. Dies kann man jedoch verhindern durch regelmäßige Datensicherungen und Backups des Speichermediums.

source: Your transactions are private, neither the payment service provider nor merchant needs to learn your identity. There is no need to give out credit card numbers or other sensitive information. The merchant will only be able to do exactly the transaction you agreed to.
de: Die Überweisungen der Käufer sind anonym. Weder das Taler-Bezahlsystem noch die Verkäufer können die Identität der Käufer feststellen. Es besteht auch keine Notwendigkeit, sensible Daten wie Kreditkartennummern anzugeben. Die Verkäufer können zudem nur Überweisungen ausführen lassen, die die Käufer genehmigt haben.

source: You will be able to withdraw money to replenish the digital coins in your wallet using your credit card or wire transfers. Afterwards you can pay with one-click using the Taler wallet, which optionally keeps your transaction history on your computer.
de: Die Aufladung der Taler-Geldbörse erfolgt durch eine gewöhnliche Banküberweisung oder mit einer Kreditkarte. Die Zahlung mit der Geldbörse funktioniert so einfach wie ein Mausklick. Im Gegensatz zu Bargeld entfällt das lästige Zählen von Banknoten und Münzen. Alle Transaktionen können optional auf dem Computer gespeichert werden.

source: Coins in your digital wallet will be of the same denomination as the cash in your physical wallet. Taler is not a crypto-currency, so you do not have to worry about cryto-currency related value fluctuations. Banking with Taler is subject to the usual government protections for financial services.
de: Münzen in der Taler-Geldbörse haben die gleiche Wertigkeit wie physisches Geld in der normalen Brieftasche. Taler ist keine Kryptowährung, nominale Wertänderungen der Zahlungsmittel sind ausgeschlossen. Das Bezahlsystem Taler unterliegt der gewöhnlichen Bankenaufsicht und staatlichen Währungskontrolle.

source: We currently provide a <a href="wallet.html">wallet browser extension</a> for Chromium, Chrome, Firefox, Opera and Edge. Wallets for mobile phones and other platforms will be available in the future.
de: Zurzeit gibt es Erweiterungen für die Browser Chromium, Chrome, Firefox, Opera und Edge. Für Mobilfunktelefone und andere Plattformen entwickeln wir ebenfalss Taler-Geldbörsen.

source: You can see how Taler works in practice by visiting our <a href="https://demo.taler.net">demo page</a>.
de: Auf der <a href="https://demo.taler.net">Demo-Seite</a> kann man die Funktionsweise von Taler kennenlernen.

source: Customers interact with the Taler system using the Taler wallet:
de: So verwendet man die Taler-Geldbörse:

source: To <b>withdraw</b> electronic coins, the customer transfers funds from his bank account to the Taler payment service provider (the exchange). The wire transfer subject must match a code identifying the customer's wallet. After the wire transfer is complete, the wallet will automatically withdraw the coins from the exchange.
de: Um digitale Münzen in die Taler-Geldbörse zu laden, müssen Taler-Nutzer zuerst Geld von ihrem Girokonto bei ihrer Geschäftsbank an die Taler-Wechselstube überweisen. Als Verwendungszweck geben sie die Nummer der empfangenden Taler-Geldbörse an. Die Weiterbuchung von der Taler-Wechselstube an die Taler-Geldbörse erfolgt automatisch.

source: To <b>spend</b> electronic coins, a merchant must cause the wallet to display a proposal for some purchase. The wallet will ask the customer for one-click confirmation. Payment is then instant. Transaction histories and digitally signed contracts can be preserved by the wallet.
de: Die Abbuchung von der privaten Taler-Geldbörse erfolgt nur, wenn sich die Verkäufer den jeweiligen Rechnungsbetrag von der Taler-Geldbörse anzeigen lassen und die Käufer mit einem Klick die Zahlung dieses Rechnungsbetrags bestätigen. Die Zahlung geschieht dann im selben Augenblick. Alle Zahlungen und digital signierte Kaufverträge können in der Geldbörse gespeichert werden.

source: The customer can use the wallet to <b>review</b> his balance. The wallet can contain different currencies, and may be shared across devices. Customers can make backups of the wallet to secure its contents against hardware failures.
de: Taler-Nutzer können in der Geldbörse alle Buchungen überprüfen. Die Geldbörse kann verschiedene Währungen enthalten und auf unterschiedlichen Endgeräten angezeigt werden. Es ist möglich, mehrere Kopien der Taler-Geldbörse zu speichern, um sie auch bei einem Geräteausfall oder Verlust der Hardware stets gesichert zu haben.

source: An archived, public mailing list for GNU Taler is hosted at <a href="https://lists.gnu.org/mailman/listinfo/taler">https://lists.gnu.org/mailman/listinfo/taler</a>. You can send messages to the list at <a href="mailto:taler@gnu.org">taler@gnu.org</a>.
de: Eine öffentliche Mailing-Liste wird archiviert bereitgestellt auf <a href="https://lists.gnu.org/mailman/listinfo/taler">https://lists.gnu.org/mailman/listinfo/taler</a>. Nachrichten an die Liste sendet man an <a href="mailto:taler@gnu.org">taler@gnu.org</a>.

source: Team members are generally reachable at <tt>LASTNAME@taler.net</tt>. All of us support receiving GnuPG encrypted e-mails.
de: Die Mitglieder des Taler-Teams sind erreichbar mit einer E-Mail an <tt>LASTNAME@taler.net</tt>, die GnuPG-verschlüsselt empfangen wird.

source: We track open feature requests and bugs in our <a href="https://gnunet.org/bugs/">Bug tracker</a>, which is shared with the GNUnet project. You can also report bugs or feature requests to the mailing list.
de: Wir verfolgen Bugs und Anfragen zu erweiterten Funktionalitäten zusammen mit dem GNU-Project auf <a href="https://gnunet.org/bugs/">Bug tracker</a>. Bugs oder Funktionsanfragen können auch an die Mailing-Liste gesendet werden.

source: For non-technical commercial requests, please contact <tt>ceo AT taler.net</tt>.
de: Für alle nicht-technischen Anfragen bitten wir <tt>ceo AT taler.net</tt> anzumailen.

source: GNU Taler is free software implementing an open protocol. Anybody is welcome to integrate our reference implementation into their applications. Different components of Taler are being made available under different licenses. The Affero GPLv3+ is used for the exchange, the LGPLv3+ is used for reference code demonstrating integration with merchant platforms, and licenses like GPLv3+ are used for wallets and related customer-facing software. We are open for constructive suggestions for maximizing the adoption of this payment platform.
de: Taler ist freie Software mit einem offenen Protokoll. Alle Programmierer sind dazu eingeladen, unseren Referenzcode in ihre Anwendungen aufzunehmen. Verschiedene Taler-Komponenten sind unter verschiedenen Lizenzformen verfügbar. Für die Taler-Wechselstube (den "Exchange") dient Affero GPLv3+, LGPLv3+ für den Referenzcode der Integration in Handelsplattformen, GPLv3+-Lizenzen gelten für Geldbörsen ("Wallets") und Kundeninteraktions-Software. Wir heißen alle konstruktiven Vorschläge willkommen, die Taler-Komponenten in eigene Anwendungen zu integrieren.

source: Taler is designed to work on the Internet. To ensure that Taler payments can work with restrictive network setups, Taler uses a RESTful protocol over HTTP or HTTPS. Taler's security does not depend upon the use of HTTPS, but obviously merchants may choose to offer HTTPS for consistency and because it generally is better for privacy compared to HTTP. Taler uses JSON to encode structure data, making it easy to integrate Taler with existing Web applications. Taler's protocol is documented in detail at <a href="https://api.taler.net/">api.taler.net</a>.
de: Taler als Bezahlsystem benutzt ein RESTful-Protokoll über HTTP oder HTTPS-Verbindungen, um auch in eingeschränkten Netzwerkumgebungen sichere Buchungen über das Internet auszuführen. Das Sicherheitskonzept von Taler hängt nicht vom Gebrauch der HTTPS-Verbindungen ab, doch werden Handelsunternehmen aus Gründen der Konsistenz mit ihren Webshops HTTPS vorziehen, das auch gerade wegen seiner Verschlüsselung eine noch höhere Sicherheit als eine HTTP-Verbindung bietet. Taler nutzt das JSON-Format, um strukturierte Daten zu verschlüsseln. Dies erleichtert die Integration von Taler in bestehende Webseiten und Anwendungen. Eine ausführliche Dokumentation des Taler-Protokolls befindet sich auf <a href="https://api.taler.net/">api.taler.net</a>.

source: Taler is currently primarily developed by a research team at <a href="http://www.inria.fr/">Inria</a> and <a href="https://gnunet.org/">GNUnet</a>. However, contributions from anyone are welcome. Our Git repositories can be cloned using the Git and HTTP access methods against <tt>git.taler.net</tt> with the name of the respective repository. A list of repositories can be found in our <a href="https://git.taler.net/">GitWeb</a>.
de: Taler wird hauptsächlich entwickelt von einem Forscherteam bei <a href="http://www.inria.fr/">Inria</a> und <a href="https://gnunet.org/">GNUnet</a>. Unterstützung von externen Beitragenden ist immer willkommen. Unsere Git-Repositories können mit Git und HTTP-basiertem Zugriff auf <tt>git.taler.net</tt> geklont werden. Eine Liste der Repositories befindet sich auf unserem <a href="https://git.taler.net/">GitWeb</a>.

source: In addition to this website, the <a href="https://git.taler.net/">documented code</a> and the <a href="https://api.taler.net/">API documentation</a>. Technical papers can be found in our <a href="bibliography.html">bibliography</a>.
de: Neben dieser Webseite bestehen die <a href="https://git.taler.net/">Code-Dokumentation</a>, die <a href="https://docs.taler.net">Entwicklerdokumentation</a> und die <a href="https://api.taler.net/">API-Schnittstellendokumentation</a>. Wissenschaftliche Literatur findet man in der <a href="bibliography.html">Bibliographie</a>.

source: We have a mailing list for developer discussions. You can subscribe to or read the list archive at <a href="http://lists.gnu.org/mailman/listinfo/taler">http://lists.gnu.org/mailman/listinfo/taler</a>.
de: Zum Austausch unter Entwicklern haben wir eine Mailingliste. Um sich einzutragen oder das Listenarchiv zu lesen besuche man <a href="http://lists.gnu.org/mailman/listinfo/taler">http://lists.gnu.org/mailman/listinfo/taler</a>.

source: We have <a href="https://buildbot.net/">Buildbot</a> automation tests to detect regressions and check for portability at <a href="https://buildbot.taler.net/">buildbot.taler.net</a>.
de: Unter <a href="https://buildbot.taler.net/">buildbot.taler.net</a> befinden sich Ergebnisse der Testumgebung <a href="https://buildbot.net/">Buildbot</a>, um Fehler nach Modifikationen aufzeigen zu können und die Portabilität des Codes zu gewährleisten.

source: We use <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a> to analyze the code coverage of our tests, the results are available at <a href="https://lcov.taler.net/">lcov.taler.net</a>.
de: Wir verwenden <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a>, um die Testabdeckung unserer Funktionstests zu analysieren, die Ergebnisse sind auf <a href="https://lcov.taler.net/">lcov.taler.net</a>.

source: We use <a href="https://gnunet.org/gauger">Gauger</a> for performance regression analysis of the exchange backend at <a href="https://gauger.taler.net/">gauger.taler.net</a>.
de: Wir verwenden <a href="https://gnunet.org/gauger">Gauger</a>, um die Performance zu messen. Ergebnisse sind auf <a href="https://gauger.taler.net/">gauger.taler.net</a>.

source: The Taler system consists of protocols executed among a number of actors as illustrated in the illustration on the right. Typical transactions involve the following steps:
de: Das Taler-Bezahlsystem verwendet Protokolle für den Geldfluss zwischen den Beteiligten. Die grundlegenden Transaktionen sind in der Grafik dargestellt:

source: A customer instructs his <b>bank</b> to transfer funds from his account to the Taler exchange (top left). In the subject of the transaction, he includes an authentication token from his electronic <b>wallet</b>. In Taler terminology, the customer creates a reserve at the exchange.
de: Zuerst überweisen Taler-Nutzer Geld von ihren herkömmlichen Girokonten in den Währungen der Geschäftsbanken (in der Grafik oben links) an die Taler-Wechselstube (der sog. "Exchange" in der Mitte der Grafik). Im Betreff der Überweisung nennen sie eine Transaktionsnummer ihrer Taler-Geldbörse. Damit bilden sie eine Münzen-Reserve bei der Taler-Wechselstube.

source: Once the exchange has received the wire transfer, it allows the customer's electronic wallet to <b>withdraw</b> electronic coins. The electronic coins are digital representations of the original currency from the transfer. It is important to note that the exchange does not learn the &quot;serial numbers&quot; of the coins created in this process, so it cannot tell later which customer purchased what at which merchant. The use of Taler does not change the currency or the total value of the funds (except for fees which the exchange may charge for the service).
de: Sobald die Taler-Wechselstube die Überweisung von der Bank erhalten hat, erlaubt sie die Verwendung der digitalen Münzen in der Taler-Geldbörse. Die Ursprungswährungen werden dabei zu gleichnamigen Währungen in der Taler-Geldbörse und behalten ihren ursprünglichen nominellen Wert abzüglich einer gegebenenfalls von der Wechselstube geforderten Tauschgebühr. Wichtig zu wissen ist, dass die Taler-Wechselstube keine Kenntnis der "Seriennummern" der erzeugten digitalen Münzen erlangt. Dies hat zur Folge, dass später nicht mehr nachvollzogen werden kann, welcher Käufer von welchem Verkäufer welche Güter erwarb. Auch die Güter selbst bleiben unbekannt.

source: Once the customer has the digital coins in his wallet, the wallet can be used to <b>spend</b> the coins with merchant portals that support the Taler payment system and accept the respective exchange as a business partner (bottom arrow). This creates a digital contract signed by the customer's coins and the merchant. If necessary, the customer can later use this digitally signed contract in a court of law to prove the exact terms of the contract and that he paid the respective amount. The customer does not learn the banking details of the merchant, and Taler does not require the merchant to learn the identity of the customer. Naturally, the customer can spend any fraction of his digital coins (the system takes care of customers getting change).
de: Die digitalen Münzen der Geldbörse kann man ausgeben bei allen Verkäufern, die das Taler-Bezahlsystem unterstützen und eine Taler-Wechselstube als Geschäftspartner akzeptieren (in der Grafik unten rechts). Dieser Vorgang erzeugt einen digitalen Vertrag, der sowohl von den Verkäufern als auch von den Käufern mit einer Signatur versehen wird (in der Grafik unten als Pfeil dargestellt). Dieser elektronisch "unterschriebene" Vertrag enthält die genauen Vertragsbedingungen und ist für eventuelle Streitfälle auch vor Gericht verwendbar als Eigentumsnachweis eines gekauften Gutes zum gegebenen Kaufpreis. Dazu müssen weder Käufer noch Verkäufer über die Identität oder Bankdaten ihrer Geschäftspartner Bescheid wissen. Natürlich kann jeder beliebige Teilbetrag von Münzen aus der Taler-Geldbörse verwendet werden, das System sorgt für das korrekte Wechselgeld.

source: Merchants receiving digital coins <b>deposit</b> the respective claims that resulted from the contract signing with the customer at the exchange to redeem the coins. The deposit step does not reveal the details of the contract between the customer and the merchant or the identity of the customer to the exchange in any way. However, the exchange does learn the identity of the merchant via the provided bank routing information. The merchant can, for example when compelled by the state for taxation, provide information linking the individual deposit to the respective contract signed by the customer. Thus, the exchange's database allows the state to enforce that merchants pay applicable taxes (and do not engage in illegal contracts).
de: Nach dem Vertragsabschluss übertragen die Käufer ihre digitalen Münzen an die Verkäufer, die sich die entsprechenden Forderungen von der Taler-Wechselstube auf ihre Girokonten erstatten lassen. Die Wechselstube veröffentlicht dabei weder Vertragsdetails noch Käuferdaten und kennt nur die Identität der Verkäufer durch ihre Bankverbindungen. Die Verkäufer können daher gegenüber staatlichen Steuerbehörden einen Nachweis ihrer rechtmäßigen Geschäfte erbringen. Die Datenbank der Wechselstube unterstützt auf diese Weise den Staat, ausnahmslos alle Verkäufer zu ihren Steuerzahlungen zu verpflichten und von illegalen Geschäften abzuhalten.
