Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: You can find our charter, and the list of members under <a href="https://git.gnunet.org/gnunet-ev.git/tree/satzung.tex">https://git.gnunet.org/gnunet-ev.git/tree/satzung.tex</a>. The current board consists of: <dl><dt>Vorsitz</dt> <dd><a href="https://schanzen.eu">Martin Schanzenbach</a></dd> <dt>stellvertretender Vorsitz</dt> <dd>t3sserakt</dd> <dt>Kassenwart</dt> <dd>Florian Dold</dd> <dt>Beisitzer</dt> <dd> <a href="https://grothoff.org/christian/">Christian Grothoff</a>, ch3 </dd> </dl>
zh_hant: 您可以在此找到我們的章程和成員名單 <a href="https://git.gnunet.org/gnunet-ev.git/tree/satzung.tex">https://git.gnunet.org/gnunet-ev.git/tree/satzung.tex</a>。目前董事會的組成為：<dl><dt>Vorsitz</dt>.<dd><a href="https://schanzen.eu">Martin Schanzenbach</a></dd>.<dt>stellvertretender Vorsitz</dt>.<dd>t3sserakt</dd>.<dt>Kassenwart</dt>.<dd>Florian Dold</dd>.<dt>Beisitzer</dt>.<dd>. <a href="https://grothoff.org/christian/">Christian Grothoff</a>, ch3 </dd>.</dl>

source: Official Meeting Notes
zh_hant: 正式會議記錄

source: Support Us!
zh_hant: 支持我們！

source: Everybody is welcome to support us via donations. For financial contributions, Europeans are able to donate via SEPA. We hope to setup accounts in other major currency areas in the future. You can also donate via Bitcoin, routing details are given below. Please note that we are unable to provide receipts for your donations. If you are planning to donate a significant amount of money, please contact us first as it might be better to come to a custom arrangement. <dl><dt>BitCoin</dt> <dd>1GNUnetpWeR9Zs3vipdvVywo1GseeksjUh</dd> <dt>SEPA/IBAN</dt> <dd>DE67830654080004822650 (BIC/SWIFT: GENODEF1SLR)</dd> </dl>
zh_hant: 歡迎大家通過捐款支持我們。歐盟成員可以通過 SEPA 進行財政捐助。我們希望未來在其他主要貨幣區開設賬戶。您也可以通過比特幣捐款，請參考下方的路由詳情。請您注意，我們無法為您的捐款提供收據。若您打算捐贈大量資金，請先與我們聯繫，以制定最好的安排。<dl><dt>比特幣 (BitCoin)</dt>。<dd>1GNUnetpWeR9Zs3vipdvVywo1GseeksjUh</dd>。<dt>SEPA/IBAN</dt>。<dd>DE67830654080004822650 (BIC/SWIFT: GENODEF1SLR)</dd>。</dl>

source: General
zh_hant: 一般

source: Features
zh_hant: 功能

source: Error messages
zh_hant: 錯誤訊息

source: File-sharing
zh_hant: 檔案分享

source: Contributing
zh_hant: 貢獻

source: What do I do if my question is not answered here?
zh_hant: 如果我的問題沒有在這裡被回答我該怎麼做？

source: A: There are many other sources of information. You can read additional documentation or ask the question on the help-gnunet@gnu.org mailing list.
zh_hant: 答：還有許多其他信息來源可供您參考。您可以閱讀額外的文件、透過 help-gnunet@gnu.org 郵件清單來詢問問題。

source: When are you going to release the next version?
zh_hant: 你們打算什麼時候發布下一個版本？

source: A: The general answer is, when it is ready. A better answer may be: earlier if you contribute (test, debug, code, document). Every release will be anounced on the info-gnunet@gnu.org mailing list and on <a href="https://planet.gnu.org">planet GNU</a>. You can subscribe to the mailing list or the RSS feed of this site to automatically receive a notification.
zh_hant: A：一般的答案為，當它準備好時。一個更佳的答案可能為：更早，若您做出貢獻（測試、除錯、編碼、紀錄）。所有的發表都會在 info-gnunet@gnu.org 的郵件清單以及 <a href="https://planet.gnu.org">planet GNU</a> 上公布。您可以訂閱此網站的寄件清單或是 RSS feed 以自動獲取通知。

source: Is the code free?
zh_hant: 程式碼是免費的嗎？

source: A: GNUnet is free software, available under the <a href="https://www.gnu.org/licenses/agpl-3.0.en.html">GNU Affero Public License (AGPL)</a>.
zh_hant: 答：GNUnet是自由軟體，您可以根據<a href="https://www.gnu.org/licenses/agpl-3.0.en.html">GNU Affero 公共許可證 (AGPL) </a>來取得。

source: Are there any known bugs?
zh_hant: 是否有任何已知的錯誤？

source: A: We track the list of currently known bugs in the <a href="https://bugs.gnunet.org/">Mantis system</a>. Some bugs are occasionally reported directly to developers or the developer mailing list. This is discouraged since developers often do not have the time to feed these bugs back into the Mantis database. Please report bugs directly to the bug tracking system. If you believe a bug is sensitive, you can set its view status to private (this should be the exception).
zh_hant: A：我們從<a href="https://bugs.gnunet.org/"> Mantis 系統</a>追蹤已知的錯誤。有些錯誤偶爾會直接報告給開發人員或開發人員郵件列表。然而，由於開發人員通常沒有時間將這些錯誤放入 Mantis 資料庫，我們不鼓勵這種做法。請直接向錯誤跟踪系統報告錯誤。如果您認為某個錯誤是敏感的，您可以將其視圖狀態設置為私有（這應是例外）。

source: Is there a graphical user interface?
zh_hant: 有圖形用戶界面嗎？

source: A: gnunet-gtk is a separate download. The package contains various GTK+ based graphical interfaces, including a graphical tool for configuration.
zh_hant: A：gnunet-gtk 是單獨下載的。這個組件包含各式以 GTK+ 為基礎的圖像介面，其中包含一個用於配置的圖像工具。

source: Why does gnunet-service-nse create a high CPU load?
zh_hant: 為什麼 gnunet-service-nse 會造成較高的 CPU 負載？

source: A: The gnunet-service-nse process will initially compute a so-called &quot;proof-of-work&quot; which is used to convince the network that your peer is real (or, rather, make it expensive for an adversary to mount a Sybil attack on the network size estimator). The calculation is expected to take a few days, depending on how fast your CPU is. If the CPU load is creating a problem for you, you can set the value &quot;WORKDELAY&quot; in the &quot;nse&quot; section of your configuration file to a higher value. The default is &quot;5 ms&quot;.
zh_hant: 答：gnunet-service-nse 流程最初會計算出一個所謂的 &quot;proof-of-work （工作量證明）&quot; 用於說服網路您的對等實體是真實的（亦或者，使對手對網路規模估計器發起 Sybil 攻擊的成本很高）。取決於你的 CPU 有多快，此計算預計需要幾天的時間。如果 CPU 負載給您帶來問題，您可以在配置文件的 &quot;nse&quot; 部分中將設置值 &quot;WORKDELAY&quot; 設置為更高的值。

source: How does GNUnet compare to Tor?
zh_hant: GNUnet 與 Tor 相比如何？

source: A: Tor focuses on anonymous communication and censorship-resistance for TCP connections and, with the Tor Browser Bundle, for the Web in particular. GNUnet does not really have one focus; our theme is secure decentralized networking, but that is too broad to be called a focus.
zh_hant: A: Tor 著重於（尤其是 Web 的）TCP 連接的匿名通信和抗審查，以及 Tor 瀏覽器捆綁包。GNUnet 則沒有一個特定的焦點；我們的主題是安全的去中心化網路，但這太廣泛了，不能稱之為一個焦點。

source: How does GNUnet compare to I2P?
zh_hant: GNUnet 與 I2P 相比如何？

source: A: Both GNUnet and I2P want to build a better, more secure, more decentralized Internet. However, on the technical side, there are almost no overlaps. <br><br> I2P is written in Java, and has (asymmetric) tunnels using onion (or garlic) routing as the basis for various (anonymized) applications. I2P is largely used via a Web frontend.
zh_hant: A：GNUnet 和 I2P 都希望建立一個更好、更安全、更分散的網際網路。然而，在技術層面上，兩者幾乎沒有重疊。<br><br>I2P 以 Java 撰寫，並具有使用洋蔥（或大蒜）路由的（非對稱）隧道作為各種（匿名）應用程式的基礎。I2P 則主要通過 Web 前端使用。

source: Is GNUnet ready for use on production systems?
zh_hant: GNUnet 準備好在生產系統上使用了嗎？

source: A: GNUnet is still undergoing major development. It is largely not yet ready for usage beyond developers. Your mileage will vary depending on the functionality you use, but you will always likely run into issues with our current low-level transport system. We are currently in the process of rewriting it (Project &quot;Transport Next Generation [TNG]&quot;)
zh_hant: A：GNUnet 仍然在經歷重大的發展。它在很大程度上還沒有準備好供開發人員使用。您的使用過程將根據您使用的功能而有所不同，但您可能會遇到我們當前的低階運輸系統的問題。我們目前正在重寫這些部分。（項目 &quot;Transport Next Generation [TNG]&quot;）

source: Is GNUnet build using distributed ledger technologies?
zh_hant: GNUnet 是否使用分佈式分類帳技術建構？

source: A: No. GNUnet is a new network protocol stack for building secure, distributed, and privacy-preserving applications. While a ledger could be built using GNUnet, we currently have no plans in doing so.
zh_hant: A：答案是否定的。GNUnet 是一個新的網絡協議棧，用於構建安全、分佈式和隱私保護的應用程式。雖然可以使用 GNUnet 構建分類帳，但我們目前沒有這樣的計劃。

source: What can I do with GNUnet?
zh_hant: 我可以用 GNUnet 做什麼？

source: A: GNUnet is a peer-to-peer framework, by which we mostly mean that it can do more than just one thing. Naturally, the implementation and documentation of some of the features that exist are more advanced than others.
zh_hant: A：GNUnet 是一個點對點框架，我們主要是指它可以做的不僅僅是一件事。理所當然地，一些現有功能的實現與文檔比其他功能更先進。

source: For users, GNUnet offers anonymous and non-anonymous file-sharing, a fully decentralized and censorship-resistant replacement for DNS and a mechanism for IPv4-IPv6 protocol translation and tunneling (NAT-PT with DNS-ALG).
zh_hant: GNUnet 提供用戶匿名和非匿名文件共享、完全去中心化和抗審查的 DNS 替代品以及 IPv4-IPv6 協議轉換和隧道機制（帶有 DNS-ALG 的 NAT-PT）。

source: Is it possible to surf the WWW anonymously with GNUnet?
zh_hant: 是否可以使用 GNUnet 匿名瀏覽 WWW？

source: A: It is not possible use GNUnet for anonymous browsing at this point. We recommend that you use Tor for anonymous surfing.
zh_hant: 答：目前無法使用 GNUnet 進行匿名瀏覽。我們建議您使用 Tor 來匿名上網。

source: Is it possible to access GNUnet via a browser as an anonymous WWW?
zh_hant: 是否可以通過瀏覽器作為匿名 WWW 訪問 GNUnet？

source: A: There is currently no proxy (like fproxy in Freenet) for GNUnet that would make it accessible via a browser. It is possible to build such a proxy and all one needs to know is the protocol used between the browser and the proxy and the GNUnet code for file-sharing.
zh_hant: A：目前沒有可以通過瀏覽器訪問 GNUnet 的代理（如 Freenet 中的 fproxy）。但僅需知道瀏覽器和代理之間使用的協議以及用於文件共享的 GNUnet 代碼，是可能構建這樣的代理的。

source: A: There are actually a few graphical user interfaces for different functions. gnunet-setup is to configure GNUnet, and gnunet-fs-gtk is for file-sharing. There are a few other gnunet-XXX-gtk GUIs of lesser importance. Note that in order to obtain the GUI, you need to install the gnunet-gtk package, which is a separate download. gnunet-gtk is a meta GUI that integrates most of the other GUIs in one window. One exception is gnunet-setup, which must still be run separately at this time (as setup requires the peer to be stopped).
zh_hant: A：實際上有幾個圖形用戶介面可用於不同的功能。gnunet-setup 可用來配置 GNUnet，而 gnunet-fs-gtk 則可用來分享檔案。還有其他次為重要的 gnunet-XXX-gtk GUIs。請注意，為了獲得 GUI，您需要安裝一個單獨的下載的 gnunet-gtk 包。 gnunet-gtk 是一個元 GUI (meta GUI)，它在一個窗口中合併了大多數其他 GUI。其中一個例外是 gnunet-setup，此時它仍必須分開運行（因為設定原因，需要對等方停止）。

source: Which operating systems does GNUnet run on?
zh_hant: GNUnet 在哪些操作系統上運行？

source: A: GNUnet is being developed and tested primarily under Debian GNU/Linux. Furthermore, we regularly build and test GNUnet on Fedora, Ubuntu, Arch, FreeBSD and macOS. We have reports of working versions on many other GNU/Linux distributions; in the past we had reports of working versions on NetBSD, OpenBSD and Solaris. However, not all of those reports are recent, so if you cannot get GNUnet to work on those systems please let us know.
zh_hant: A：GNUnet 主要在 Debian GNU/Linux 下開發和測試。此外，我們經常在 Fedora、Ubuntu、Arch、FreeBSD 和 macOS 上構建和測試 GNUnet。我們有許多其他 GNU/Linux 發行版的工作版本報告；在過去，我們曾有關於 NetBSD、OpenBSD 和 Solaris 上的工作版本的報告。然而，並不是所有這些報告都是近期的，所以如果您無法讓 GNUnet 在這些系統上工作，請您通知我們。

source: Who runs the GNS root zone?
zh_hant: 誰負責運行 GNS 根區域 (root zone)？

source: A: Short answer: you. The long answer is the GNUnet will ship with a default configuration of top-level domains. The governance of this default configuration is not yet established. In any case, the user will be able to modify this configuration at will. We expect normal users to have no need to edit their own GNS zone(s) unless they host services themselves.
zh_hant: A：一個簡短的答案為：你。一個較長的回答則是：GNUnet 將運送頂級域的默認配置。此默認配置的管理體系尚未建立。在任何情況下，用戶都可以隨意修改此配置。我們希望，除非用戶自行託管此服務，普通用戶無需編輯自己的 GNS 區域。

source: Where is the per-user GNS database kept?
zh_hant: 每個用戶的 GNS 資料庫保存在哪裡？

source: A: The short answer is that the database is kept at the user's GNUnet peer. Now, a user may run multiple GNUnet peers, in which case the database could be kept at each peer (however, we don't have code for convenient replication). Similarly, multiple GNUnet peers can share one instance of the database --- the &quot;gnunet-service-namestore&quot; can be accessed from remote (via TCP). The actual data can be stored in a Postgres database, for which various replication options are again applicable. Ultimately, there are many options for how users can store (and secure) their GNS database.
zh_hant: A：簡短的回答是-- 資料庫被保存於用戶的 GNUnet peer。目前，一個用戶可以運行多個 GNUnet peer，在這種情況下，資料庫可以被保存在每個 peer 上（但是我們沒有方便複製的程式碼）。同樣地，多個 GNUnet peer 可以共享一個資料庫實例--- &quot;gnunet-service-namestore&quot; 可以（透過 TCP）進行遠程訪問。實際資料可以存儲在 Postgres 資料庫中，且各種複制選項同樣適用於該資料庫。結論上，用戶有很多選擇來存儲（和保護）他們的 GNS 資料庫。

source: What is the expected average size of a GNS namestore database?
zh_hant: GNS 域名存儲資料庫(namestore database)的預期平均大小為多少？

source: A: Pretty small. Based on our user study where we looked at browser histories and the number of domains visited, we expect that GNS databases will only grow to a few tens of thousands of entries, small enough to fit even on mobile devices.
zh_hant: A：很小。根據我們查看瀏覽器歷史記錄和訪問域數的用戶研究，我們預計 GNS 資料庫只會增長到幾萬個條目，小到甚至可以安裝在行動裝置上。

source: Is GNS resistant to the attacks on DNS used by the US?
zh_hant: GNS 是否可以抵抗美國使用的 DNS 攻擊?

source: A: We believe so, as there is no entity that any government could force to change the mapping for a name except for each individual user (and then the changes would only apply to the names that this user is the authority for). So if everyone used GNS, the only practical attack of a government would be to force the operator of a server to change the GNS records for his server to point elsewhere. However, if the owner of the private key for a zone is unavailable for enforcement, the respective zone cannot be changed and any other zone delegating to this zone will achieve proper resolution.
zh_hant: A：我們相信是如此，因為除了每個個人用戶之外，沒有任何實體可以強制任何政府更改名稱的映射（然後此更改將僅適用於該用戶有權使用的名稱）。因此，如果每個人都使用 GNS，那麼政府唯一的實際攻擊即為強迫服務器的操作員更改其服務器的 GNS 記錄以指向其他地方。但是，如果某個區域的私鑰所有者不可用於強制執行，則無法更改相應的區域，且委派給該區域的任何其他區域都將獲得正確的解決方案。

source: How does GNS compare to other name systems?
zh_hant: GNS 與其他名稱系統 (name systems) 相比如何？

source: A: A scientific paper on this topic <a href="https://grothoff.org/christian/ns2018.pdf">has been published </a> and below is a table from the publication. For detailed descriptions please refer to the paper.
zh_hant: 答：有關該主題的科學論文<a href="https://grothoff.org/christian/ns2018.pdf">已被發表</a>，以下是該出版物的表格。請參閱該論文以閱讀更多細節及描述。

source: What is the difference between GNS and CoDoNS?
zh_hant: GNS 和 CoDoNS 有什麼區別？

source: A: CoDoNS decentralizes the DNS database (using a DHT) but preserves the authority structure of DNS. With CoDoNS, IANA/ICANN are still in charge, and there are still registrars that determine who owns a name. <br><br> With GNS, we decentralize the database and also decentralize the responsibility for naming: each user runs their own personal root zone and is thus in complete control of the names they use. GNS also has many additional features (to keep names short and enable migration) which don't even make sense in the context of CoDoNS.
zh_hant: A：CoDoNS 分散了 DNS 資料庫（使用 DHT）但保留了 DNS 的權限結構。有了CoDoNS，IANA/ICANN 仍然擁有主導權，並依然有註冊商決定誰擁有名稱。<br><br>有了GNS，我們分散了資料庫，也分散了命名的責任：每個用戶都運行自己的個人根區域，因此用戶可以完全控制他們使用的名稱。GNS 還具有許多附加功能（以保持簡短的名稱並啟用遷移），這些功能在 CoDoNS 的環境中甚至沒有意義。

source: What is the difference between GNS and SocialDNS?
zh_hant: GNS 和 SocialDNS 有什麼區別？

source: A: Like GNS, SocialDNS allows each user to create DNS mappings. However, with SocialDNS the mappings are shared through the social network and subjected to ranking. As the social relationships evolve, names can thus change in surprising ways. <br><br> With GNS, names are primarily shared via delegation, and thus mappings will only change if the user responsible for the name (the authority) manually changes the record.
zh_hant: A：如同 GNS，SocialDNS 允許每個用戶創建 DNS 映射。然而，使用 SocialDNS 的映射通過社交網路共享並進行排名。隨著社會關係的發展，名稱可能會以令人驚訝的方式發生變化。<br><br>使用 GNS 時，名稱主要通過委託來共享，因此只有當負責名稱的用戶（權限）手動更改記錄時，映射才會有所改變。

source: What is the difference between GNS and ODDNS?
zh_hant: GNS 和 ODDNS 有什麼區別？

source: A: ODDNS is primarily designed to bypass the DNS root zone and the TLD registries (such as those for ".com" and ".org"). Instead of using those, each user is expected to maintain a database of (second-level) domains (like "gnu.org") and the IP addresses of the respective name servers. Resolution will fail if the target name servers change IPs.
zh_hant: A：ODDNS 主要旨為繞過 DNS 根區和 TLD 註冊機構（例如".com"和".org"的註冊機構）。用戶們不應使用這些，每個用戶都應該維護一個（二級）域如"gnu.org"）的資料庫和各自名稱伺服器的 IP 地址。如果目標名稱伺服器更改 IP，那麼分解將會失敗。

source: What is the difference between GNS and Handshake?
zh_hant: GNS 和 Handshake 有什麼區別？

source: A: Handshake is a blockchain-based method for root zone governance. Hence, it does not address the name resolution process itself but delegates resolution into DNS after the initial TLD resolution. Not taking sustainablility considerations into account, Handshake could be used as an additional supporting GNS root zone governance model, but we currently do not have such plans in mind.
zh_hant: A：握手 (Handshake) 是一種基於區塊鏈的根區治理方法。因此，它不解決名稱分解 (name resolution) 過程本身，而是在初始 TLD 分解 (TLD resolution) 後將解析委託給 DNS。若不將可持續性列入考量，Handshake 可以用作額外的支持 GNS 根區治理的模型，但我們目前沒有這樣的計劃。

source: What is the difference between GNS and TrickleDNS?
zh_hant: GNS 和 SocialDNS 有什麼區別？

source: A: TrickleDNS pushes (&quot;critical&quot;) DNS records between DNS resolvers of participating domains to provide &quot;better availability, lower query resolution times, and faster update propagation&quot;. Thus TrickleDNS is focused on defeating attacks on the availability (and performance) of record propagation in DNS, for example via DDoS attacks on DNS root servers. TrickleDNS is thus concerned with how to ensure distribution of authoritative records, and authority remains derived from the DNS hierarchy.
zh_hant: A：TrickleDNS 在參與域的 DNS 解析器之間推送（&quot;關鍵的&quot;）DNS 記錄，以提供 &quot;更好的可用性、更短的查詢解析時間和更快的更新傳播&quot;。因此，TrickleDNS 專注於擊敗對 DNS 中記錄傳播的可用性（和性能）的攻擊，例如透過對 DNS 根服務器的 DDoS 攻擊。因此，TrickleDNS 關注如何確保權威記錄的分發，而權威仍然來自 DNS 層次結構。

source: Does GNS require real-world introduction (secure PKEY exchange) in the style of the PGP web of trust?
zh_hant: GNS 是否需要以 PGP 信任網路 (PGP web of trust) 的方式進行真實世界的介紹（安全的 PKEY 交換）？

source: A: For security, it is well known that an initial trust path between the two parties must exist. However, for applications where this is not required, weaker mechanisms can be used. For example, we have implemented a first-come-first-served (FCFS) authority which allows arbitrary users to register arbitrary names. The key of this authority is included with every GNUnet installation. Thus, any name registered with FCFS is in fact global and requires no further introduction. However, the security of these names depends entirely on the trustworthiness of the FCFS authority. The authority can be queried under the &quot;.pin&quot; TLD.
zh_hant: A：為了安全起見，眾所周知，兩方之間必須存在初始信任路徑。然而，對於不需要這樣做的應用程式，可以使用較弱的機制。例如，我們實施了先到先得 (first-come-first-served; FCFS) 權限，允許任意用戶註冊任意名稱。此權限的密鑰包含在每個 GNUnet 的安裝中。因此，任何在 FCFS 註冊的名稱實際上都是全球性的，不須被進一步介紹。但是，這些名稱的安全性完全取決於 FCFS 機構的可信度。而這些機構可以在 &quot;.pin&quot; TLD 被查詢到。

source: How can a legitimate domain owner tell other people to not use his name in GNS?
zh_hant: 合法的域名所有者如何告知他人不要在 GNS 中使用其名字？

source: A: Names have no owners in GNS, so there cannot be a &quot;legitimate&quot; domain owner. Any user can claim any name (as his preferred name or &quot;pseudonym&quot;) in his NICK record. Similarly, all other users can choose to ignore this preference and use a name of their choice (or even assign no name) for this user.
zh_hant: A：名稱在 GNS 中沒有所有者，因此不能存在&quot;合法的&quot;域所有者。任何用戶都可以在他的 NICK 記錄中要求擁有任何名稱（作為他的首選名稱或&quot;假名&quot;）。同樣地，所有其他用戶都可以選擇忽略此偏好並使用他們自選的名稱（甚至不指定名稱）。

source: Did you consider the privacy implications of making your personal GNS zone visible?
zh_hant: 您是否考慮過使您的個人 GNS 區域可見對隱私的影響？

source: A: Each record in GNS has a flag &quot;private&quot;. Records are shared with other users (via DHT or zone transfers) only if this flag is not set. Thus, users have full control over what information about their zones is made public.
zh_hant: A：GNS中的每條記錄都有一個&quot;私有&quot;標誌。僅當未設置此標誌時，記錄才會（通過 DHT 或區域傳輸）與其他用戶共享。因此，用戶可以完全控制公開其區域的哪些信息。

source: Are "Legacy Host" (LEHO) records not going to be obsolete with IPv6?
zh_hant: "傳統主機" (LEHO) 記錄不會因 IPv6 而過時嗎？

source: A: The question presumes that (a) virtual hosting is only necessary because of IPv4 address scarcity, and (b) that LEHOs are only useful in the context of virtual hosting. However, LEHOs are also useful to help with X.509 certificate validation (as they specify for which legacy hostname the certificate should be valid). Also, even with IPv6 fully deployed and &quot;infinite&quot; IP addresses being available, we're not sure that virtual hosting would disappear. Finally, we don't want to have to wait for IPv6 to become commonplace, GNS should work with today's networks.
zh_hant: A：這個問題假設 (a) 虛擬主機只是因為 IPv4 位址稀缺而為必要，以及 (b) LEHO 僅在虛擬主機的環境中有用。然而，LEHO 也有助於 X.509 證書驗證（因為它們指定證書應該對哪個舊主機名有效）。此外，即使完全部署了 IPv6 且有 &quot;無限的&quot;IP 位址可以使用，我們不確定虛擬主機是否會消失。最後，我們不想等 IPv6 變得普遍，GNS 應該與今日的網路配合使用。

source: Why does GNS not use a trust metric or consensus to determine globally unique names?
zh_hant: 為什麼 GNS 不使用信任度量 (trust metric) 或共識來確定全球唯一名稱？

source: A: Trust metrics have the fundamental problem that they have thresholds. As trust relationships evolve, mappings would change their meaning as they cross each others thresholds. We decided that the resulting unpredictability of the resolution process was not acceptable. Furthermore, trust and consensus might be easy to manipulate by adversaries.
zh_hant: A：「閾值」為信任度量的一個根本問題。隨著信任關係的發展，映射的含義會在跨越彼此閾值時改變。我們認為由此導致解決過程的不可預測性是無法接受的。此外，信任和共識可能很容易被對手操縱。

source: How do you handle compromised zone keys in GNS?
zh_hant: 您如何處理 GNS 中受損的區域密鑰 (zone keys)？

source: A: The owner of a private key can create a revocation message. This one can then be flooded throughout the overlay network, creating a copy at all peers. Before using a public key, peers check if that key has been revoked. All names that involve delegation via a revoked zone will then fail to resolve. Peers always automatically check for the existence of a revocation message when resolving names.
zh_hant: A：私鑰的所有者可以創建一個撤銷消息 (revocation message)。其可以充滿整個覆蓋網絡，在所有對等點創建一個副本。在使用公鑰之前，對等方檢查該密鑰是否已被撤銷。所有通過撤銷區域委託的名稱都將無法解析。在解析名稱時，對等方皆會自動檢查撤銷消息的存在。

source: Could the signing algorithm of GNS be upgraded in the future?
zh_hant: 將來可以升級 GNS 的簽名演算法 (signing algorithm) 嗎？

source: A: Yes. In our efforts to standardize GNS, we have already modified the protocol to support alternative delegation records. <br> <br> Naturally, deployed GNS implementations would have to be updated to support the new signature scheme. The new scheme can then be run in parallel with the existing system by using a new record type to indicate the use of a different cipher system.
zh_hant: A：是的。我們已經修改了協議以支持替代委託記錄並努力地標準化 GNS。 <br> <br>理所當然地，為了支持新的簽名方案，部署的 GNS 實現必須更新。通過使用新的記錄類型來指示不同密碼系統的使用，新方案可以與現有系統并行運行。

source: How can a GNS zone maintain several name servers, e.g. for load balancing?
zh_hant: GNS 區域如何維護多個名稱伺服器 (name servers)，如: 負載平衡 (load balancing)？

source: A: We don't expect this to be necessary, as GNS records are stored (and replicated) in the R5N DHT. Thus the authority will typically not be contacted whenever clients perform a lookup. Even if the authority goes (temporarily) off-line, the DHT will cache the records for some time. However, should having multiple servers for a zone be considered truly necessary, the owner of the zone can simply run multiple peers (and share the zone's key and database among them).
zh_hant: A：我們不認為這是必要的，因為 GNS 記錄被存儲（和複製）在 R5N DHT 中。因此，每當客戶端執行查找時，通常不會聯繫權限 (authority)。即使權限（暫時）離線，DHT 也會緩存記錄一段時間。然而，如果一個區域有多個伺服器被認為是必要的，區域的所有者可以簡單地運行多個對等點（並在它們之間共享區域的密鑰和資料庫）。

source: Why do you believe it is worth giving up unique names for censorship resistance?
zh_hant: 你們為什麼認為值得為了抵抗審查 (censorship resistance) 放棄獨特名稱 (unique names)？
