Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: A: The GNU Name system offers an alternative to DNS that is censorship resistant. As with any security mechanism, this comes at a cost (names are not globally unique). To draw a parallel, HTTPS connections use more bandwidth and have higher latency than HTTP connections. Depending on your application, HTTPS may not be worth the cost. However, for users that are experiencing censorship (or are concerned about it), giving up globally unique names may very well be worth the cost. After all, what is a &quot;globally&quot; unique name worth, if it does not resolve?
zh_hant: A：GNU 名稱系統提供了一種抗審查的 DNS 替代方案。與任何安全機制一樣，這是需要付出代價的（名稱不是全球唯一的）。與 HTTP 連接相比，HTTPS 連接使用更多頻寬且有更高的網路延遲。根據您的應用程式，HTTPS 可能不值得其所需要付出的代價。然而，對於正在經歷審查（或擔心審查）的用戶來說，放棄全球唯一名稱可能十分值得。畢竟， 如果這個問題不被解決的話，&quot;全球&quot;唯一的名字又值得多少？

source: Why do you say that DNS is 'centralized' and 'distributed'?
zh_hant: 為什麼說 DNS 為"集中式"與"分佈式"的？

source: A: We say that DNS is 'centralized' because it has a central component / central point of failure --- the root zone and its management by IANA/ICANN. This centralization creates vulnerabilities. For example, the US government was able to reassign the management of the country-TLDs of Afganistan and Iraq during the wars at the beginning of the 21st century.
zh_hant: A：我們說 DNS 是"集中式"的，因為它有一個中心元件/中心故障點 --- 根區及其管理（由IANA/ICANN 所管理）。這種集中化會造成漏洞。例如，在 21 世紀初的戰爭期間，美國政府能夠重新分配對阿富汗和伊拉克國家頂級域名 (country-TLDs) 的管理。

source: How does GNS protect against layer-3 censorship?
zh_hant: GNS 如何防止第 3 層審查 (layer-3 censorship)？

source: A: GNS does not directly help with layer-3 censorship, but it does help indirectly in two ways: <ol> <li> Many websites today use virtual hosting, so blocking a particular IP address causes much more collateral damage than blocking a DNS name. It thus raises the cost of censorship.</li> <li> Existing layer-3 circumvention solutions (such as Tor) would benefit from a censorship resistant naming system. Accessing Tor's &quot;.onion&quot; namespace currently requires users to use unmemorable cryptographic identifiers. With nicer names, Tor and tor2web-like services would be even easier to use. </ol>
zh_hant: A：GNS不能直接幫助進行第3層審查，但它可以通過兩種方式間接幫助： <ol> <li> 如今，許多網站都使用虛擬主機，因此，阻擋特定的 IP 位址比阻擋 DNS 名稱造成的附帶損害要大得多。這因此它增加了審查的成本。</li> <li> 現有的第 3 層規避解決方案（例如 Tor）將受益於抗審查命名系統。訪問 Tor 的&quot;.onion&quot; 命名空間目前要求用戶使用不易記住的加密標識符。有了更好的名稱，Tor 和類似 tor2web 的服務將更容易使用。</ol>

source: Does GNS work with search engines?
zh_hant: GNS 是否可以與搜索引擎一起使用？

source: A: GNS creates no significant problems for search engines, as they can use GNS to perform name resolution as well as any normal user. Naturally, while we typically expect normal users to install custom software for name resolution, this is unlikely to work for search engines today. However, the DNS2GNS gateway allows search engines to use DNS to resolve GNS names, so they can still index GNS resources. However, as using DNS2GNS gateways breaks the cryptographic chain of trust, legacy search engines will obviously not obtain censorship-resistant names.
zh_hant: A：GNS 不會對搜尋引擎造成重大問題，因為它們可以像任何普通用戶一樣使用 GNS 執行名稱解析。自然地，雖然我們通常希望普通用戶安裝自定義軟體進行名稱解析，但這不太可能適用於今日的搜尋引擎。然而，DNS2GNS 閘道器允許搜尋引擎使用 DNS 來解析 GNS 名稱，因此它們仍然可以將 GNS 資源編入索引。然而，由於使用 DNS2GNS 閘道器打破了加密信任鏈，傳統搜尋引擎顯然無法獲得抗審查的名稱。

source: How does GNS compare to the Unmanaged Internet Architecture (UIA)?
zh_hant: GNS 如何與非託管網路體系架構 (Unmanaged Internet Architecture; UIA) 相比？

source: A: UIA and GNS both share the same basic naming model, which actually originated with Rivest's SDSI. However, UIA is not concerned about integration with legacy applications and instead focuses on universal connectivity between a user's many machines. In contrast, GNS was designed to interoperate with DNS as much as possible, and to also work as much as possible with the existing Web infrastructure. UIA is not at all concerned about legacy systems (clean slate).
zh_hant: A：UIA 和 GNS 共享相同（實際上起源於 Rivest 的SDSI）的基本命名模型。然而，UIA 並不關心與舊有應用程式的整合，而是專注於該用戶多台機器之間的通用連接。相較之下，GNS 旨在盡可能多地與 DNS 相互操作，並儘可能多地與現有的 Web 基礎設施協同工作。UIA 則旨不在舊有系統 (clean slate)。

source: Doesn't GNS increase the trusted-computing base compared to DNS(SEC)?
zh_hant: 與 DNS (SEC) 相比，GNS 不會增加其可信計算基 (trusted-computing base) 嗎？

source: A: First of all, in GNS you can explicitly see the trust chain, so you know if a name you are resolving belongs to a friend, or a friend-of-a-friend, and can thus decide how much you trust the result. Naturally, the trusted-computing base (TCB) can become arbitrarily large this way --- however, given the name length restriction, for an individual name it is always less than about 128 entities.
zh_hant: A：首先，在 GNS 中您可以明確地看到信任鏈，所以您知道您正在解析的名字屬於您的朋友、或是朋友的朋友，您可以從而決定此結果的可信任程度。自然地，可信賴計算基地 (trusted-computing base; TCB) 可以通過這種方式變得無限大——但是，考慮到名稱長度限制，單個名稱總是少於大約 128 個實體 (entities)。

source: How does GNS handle SRV/TLSA records where service and protocol are part of the domain name?
zh_hant: GNS 如何處理服務和協議是域名的一部份的 SRV/TLSA 記錄？

source: A: When GNS splits a domain name into labels for resolution, it detects the &quot;_Service._Proto&quot; syntax, converts &quot;Service&quot; to the corresponding port number and &quot;Proto&quot; to the corresponding protocol number. The rest of the name is resolved as usual. Then, when the result is presented, GNS looks for the GNS-specific &quot;BOX&quot; record type. A BOX record is a record that contains another record (such as SRV or TLSA records) and adds a service and protocol number (and the original boxed record type) to it.
zh_hant: A：GNS在將域名拆分為標籤進行解析時，會檢測到 &quot;_Service._Proto&quot;語法，將 &quot;Service&quot; 轉換為對應的埠號，並將 &quot;Proto&quot; 轉換為對應的埠號。其餘的名稱可以照常解析。然後，當結果出現時，GNS 會尋找 GNS 特定的 &quot;BOX （盒子）&quot; 記錄類型。BOX 記錄是包含另一條記錄（例如 SRV 或 TLSA 記錄）並向其添加服務和協議編號（以及原始盒裝記錄類型）的記錄。

source: I receive many &quot;WARNING Calculated flow delay for X at Y for Z&quot;. Should I worry?
zh_hant: 我收到許多 &quot;警告：對於Z的Y處X計算流量延遲&quot;。請問我需要擔心嗎？

source: A: Right now, this is expected and a known cause for high latency in GNUnet. We have started a major rewrite to address this and other problems, but until the Transport Next Generation (TNG) is ready, these warnings are expected.
zh_hant: A：在此時，這是意料之中的，也是 GNUnet 高度延遲的一個已知原因。我們已開始進行重大改寫以解決此問題和其他問題，但在下一代傳輸 (Transport Next Generation; TNG) 準備就緒之前，這些警告仍在預期之中。

source: Error opening `/dev/net/tun': No such file or directory?
zh_hant: 開啟 '/dev/net/tun' 時出現錯誤：沒有此文件或目錄？

source: A: If you get this error message, the solution is simple. Issue the following commands (as root) to create the required device file
zh_hant: A：若您收到此錯誤訊息，解決方法很簡單。發出以下命令（以root用戶身份）創建所需的設備文件

source: 'iptables: No chain/target/match by that name.' (when running gnunet-service-dns)?
zh_hant: 'iptables: 沒有該名稱的鍊 (chain)/目標/匹配項目。'（運行gnunet-service-dns時）？

source: A: For GNUnet DNS, your iptables needs to have &quot;owner&quot; match support. This is accomplished by having the correct kernel options. Check if your kernel has CONFIG_NETFILTER_XT_MATCH_OWNER set to either 'y' or 'm' (and the module is loaded).
zh_hant: A：對於GNUnet DNS，您的 iptables 需具有 &quot;所有者&quot; 匹配支持。這可以通過使用正確的內核 (kernel) 選項來達成。請檢察您的內核的CONFIG_NETFILTER_XT_MATCH_OWNER 是否已設定為 'y' 或是 'm'（並且已載入模板）。

source: 'Timeout was reached' when running PT on Fedora (and possibly others)?
zh_hant: 在 Fedora（或其他）上運行 PT 時"已超時"？

source: A: If you get an error stating that the VPN timeout was reached, check if your firewall is enabled and blocking the connections.
zh_hant: A：如果收到指出已達到 VPN 超時的錯誤訊息，請檢查您的防火牆是否為啟用狀態且阻擋連線。

source: I'm getting an 'error while loading shared libraries: libgnunetXXX.so.X'
zh_hant: 我在載入共享庫 (shared libraries) 時遇到 '錯誤：libgnunetXXX.so.X'

source: A: This error usually occurs when your linker fails to locate one of GNUnet's libraries. This can have two causes. First, it is theoretically possible that the library is not installed on your system; however, if you compiled GNUnet the normal way and/or used a binary package, that is highly unlikely. The more common cause is that you installed GNUnet to a directory that your linker does not search. There are several ways to fix this that are described below. If you are 'root' and you installed to a system folder (such as /usr/local), you want to add the libraries to the system-wide search path. This is done by adding a line "/usr/local/lib/" to /etc/ld.so.conf and running "ldconfig". If you installed GNUnet to /opt or any other similar path, you obviously have to change "/usr/local" accordingly. If you do not have 'root' rights or if you installed GNUnet to say "/home/$USER/", then you can explicitly tell your linker to search a particular directory for libraries using the "LD_LIBRARY_PATH" environment variable. For example, if you configured GNUnet using a prefix of "$HOME/gnunet/" you want to run:
zh_hant: A：這種錯誤通常發生在鏈接器無法找到 GNUnet 程式庫時。有兩種原因可能會造成此現象。其中一種原因為，理論上，您的系統上可能沒有安裝該程式庫；但是，如果您以正常方式編譯 GNUnet 和/或使用二進制包 (binary package)，此現象則不太可能是這種原因造成的。更常見的原因為，您將 GNUnet 安裝到鏈接器未搜索的目錄中。以下提供幾種方法解決此問題。如果您是 "root" 並且將 GNUnet 安裝至系統文件夾（例如 /usr/local），您需要將程式庫添加到系統範圍的搜索路徑中。您可以通過在 /etc/ld.so.conf 中添加一行 "/usr/local/lib/" 並運行 "ldconfig" 來完成此步驟。如果您將 GNUnet 安裝到 /opt 或任何其他類似路徑，顯然地，您必須更改相對應的 "/usr/local"。如果您沒有 "root" 權限，或者您安裝 GNUnet 時表示 "/home/$USER/"，那麼您可以明確地告訴您的鏈接器使用 "LD_LIBRARY_PATH" 環境變量以在特定目錄中搜索程式庫。舉例來說，如果您使用前綴 "$HOME/gnunet/" 來配置 GNUnet，您則要運行：

source: to ensure GNUnet's binaries and libraries are found. In order to avoid having to do so each time, you can add the above lines (without the "$") to your .bashrc or .profile file. You will have to logout and login again to have this new profile be applied to all shells (including your desktop environment).
zh_hant: 以確保找到 GNUnet 的二進制和程式庫。為了避免您每次都需要這樣做，您可以將以上幾行（不帶"$"的）添加到您的 .bashrc 或 .profile 文件中。您必須登出並再次登入才能將此新設定檔應用於所有的 shells（包括您的桌面環境）。

source: What error messages can be ignored?
zh_hant: 我可以忽略哪些錯誤訊息？

source: A: Error messages flagged as "DEBUG" should be disabled in binaries built for end-users and can always be ignored. Error messages flagged as "INFO" always refer to harmless events that require no action. For example, GNUnet may use an INFO message to indicate that it is currently performing an expensive operation that will take some time. GNUnet will also use INFO messages to display information about important configuration values.
zh_hant: A：在為最終用戶構建的二進製文件中應禁用標記為"DEBUG"的錯誤訊息，並且始終可以被忽略。標記為"INFO"的錯誤訊息則為不需要進行操作的無害事件。舉例來說，GNUnet 可能使用 INFO 訊息來表示它目前正在執行需要一些時間的昂貴操作。GNUnet 也使用 INFO 訊息來顯示有關重要配置值的資訊。

source: How does GNUnet compare to other file-sharing applications?
zh_hant: GNUnet 與其他文件共享應用程式相比如何？

source: A: As opposed to Napster, Gnutella, Kazaa, FastTrack, eDonkey and most other P2P networks, GNUnet was designed with security in mind as the highest priority. We intend on producing a network with comprehensive security features. Many other P2P networks are open to a wide variety of attacks, and users have little privacy. GNUnet is also Free Software and thus the source code is available, so you do not have to worry about being spied upon by the software. The following table summarises the main differences between GNUnet and other systems. The information is accurate to the best of our knowledge. The comparison is difficult since there are sometimes differences between various implementations of (almost) the same protocol. In general, we pick a free implementation as the reference implementation since it is possible to inspect the free code. Also, all of these systems are changing over time and thus the data below may not be up-to-date. If you find any flaws, please let us know. Finally, the table is not saying terribly much (it is hard to compare these systems this briefly), so if you want the real differences, read the research papers (and probably the code).
zh_hant: A：與 Napster、Gnutella、Kazaa、FastTrack、eDonkey 和大多數其他對等式網路（P2P 網路）不同，GNUnet 的設計將安全性作為最主要優先項目。我們打算製造一個具有全面安全功能的網路。許多其他 P2P 網路容易受到各式各樣的攻擊、用戶幾乎沒有隱私。GNUnet 也同時是個自由軟體，因此程式碼可以被使用，您不必擔心被軟體監視。下表總結了 GNUnet 和其他系統之間的主要區別。該表格內的訊息為據我們所知最準確的資訊。其中，要比較不同系統之間的差異不是很容易，因為有時候（幾乎）相同協議的各種實現之間存在差異。因為自由程式碼 (free code)可以被檢查，我們通常選擇自由實現 (free implementation)作為我們的參考實現 (reference implementation)。此外，由於這些系統都會隨著時間變化，以下的資料可能不是最新的。若您發現任何錯誤，請您告訴我們。最後，由於表格並沒有解釋太多（很難簡單地比較這些系統），如果您想要了解這些系統之間真正的差異，請您參考研究論文（或許加上程式碼）。

source: Another important point of reference are the various anonymous peer-to-peer networks. Here, there are differences in terms of application domain and how specifically anonymity is achieved. Anonymous routing is a hard research topic, so for a superficial comparison like this one we focus on the latency. Another important factor is the programming language. Type-safe languages may offer certain security benefits; however, this may come at the cost of significant increases in resource consumption which in turn may reduce anonymity.
zh_hant: 另一個重要的參考點是各種匿名的對等網路 (peer-to-peer networks)。於此，在應用領域和具體匿名實現方式方面存在差異。匿名路由 (Anonymous routing) 是一項艱鉅的研究課題，因此對於像這樣的表面對比，我們會著重於網路延遲 (latency) 的比較。另一個重要因素為程式語言。類別型安全語言 (Type-safe languages) 可能可以提供某些安全性優勢；然而，資源消耗的顯著增加可能為其所需付出的代價，而這反過來可能會降低匿名性。

source: Are there any known attacks (on GNUnet's file-sharing application)?
zh_hant: 是否存在任何（在GNUnet的文件共享應用程序上）已知的攻擊？

source: A: Generally, there is the possibility of a known plaintext attack on keywords, but since the user has control over the keywords that are associated with the content he inserts, the user can take advantage of the same techniques used to generate reasonable passwords to defend against such an attack. In any event, we are not trying to hide content; thus, unless the user is trying to insert information into the network that can only be shared with a small group of people, there is no real reason to try to obfuscate the content by choosing a difficult keyword anyway.
zh_hant: A：一般來說，出現針對關鍵字的已知明文攻擊 (known plaintext attack) 是有可能的，但是由於用戶可以控制與其所插入內容相關的關鍵字，用戶可以利用用於生成合理密碼的相同技術來進行保護，以抵制這種攻擊。無論如何，我們不會試圖隱藏內容；因此，除非用戶試圖將只能與一小群人共享的訊息插入網路，用戶並沒有真正的理由去選擇一個困難的關鍵字來混淆內容。

source: What do you mean by anonymity?
zh_hant: 匿名是什麼意思？

source: A: Anonymity is the lack of distinction of an individual from a (large) group. A central goal for anonymous file-sharing in GNUnet is to make all users (peers) form a group and to make communications in that group anonymous, that is, nobody (but the initiator) should be able to tell which of the peers in the group originated the message. In other words, it should be difficult to impossible for an adversary to distinguish between the originating peer and all other peers.
zh_hant: A：匿名是指個人與（大）群體之間缺乏區別性。GNUnet 中匿名文件共享的一個中心目標是讓所有用戶（對等點）組成一個群組，並使該群組中的通信匿名，也就是說，沒有人（除了發起者）該有能力知道該群組中的哪些對等點發起了消息。換句話說，對手應該很難、甚至不可能區分原始對等點和所有其他對等點。

source: What does my system do when participating in GNUnet file sharing?
zh_hant: 我的系統在參與 GNUnet 文件共享時會做什麼？

source: A: In GNUnet you set up a node (a peer). It is identified by an ID (hash of its public key) and has a number of addresses it is reachable by (may have no addresses, for instance when it's behind a NAT). You specify bandwidth limits (how much traffic GNUnet is allowed to consume) and datastore quote (how large your on-disk block storage is) . Your node will then proceed to connect to other nodes, becoming part of the network.
zh_hant: A：您在GNUnet中設置一個節點（一個對等點）。其由一個 ID（其公鑰的雜湊）標識，並且有許多可訪問的位址（可能沒有位址，例如當它位於 NAT 後面時）。您指定頻寬限制（允許 GNUnet 消耗多少流量）和資料存儲報價（您的磁碟區存儲量有多大）。然後您的節點將繼續連接到其他節點，然後成為網路的一部分。

source: How can I help translate this webpage into other languages?
zh_hant: 我如何幫助將此網頁翻譯成其他語言？

source: A: First, you need to register an account with our weblate system. Please send an e-mail with the desired target language to translators@gnunet.org or ask for help on the #gnunet chat on irc.freenode.net. Typically someone with sufficient permissions will then grant you access. Naturally, any abuse will result in the loss of permissions.
zh_hant: A：首先，您需要在我們的 weblate 系統註冊一個賬號。請將含有您目標語言的電子郵件發送至 translations@gnunet.org 或在 irc.freenode.net 上的#gnunet chat 中尋求幫助。通常，具有足夠權限的人會授予您訪問權限。但當然地，任何的濫用行為都會導致您喪失權限。

source: I have some great idea for a new feature, what should I do?
zh_hant: 我有一些關於新功能的好主意，我該怎麼做？

source: A: Sadly, we have many more feature requests than we can possibly implement. The best way to actually get a new feature implemented is to do it yourself --- and to then send us a patch.
zh_hant: A：很可惜地，我們收到的功能請求比我們可能實現的功能來得多。能夠實際地實現新功能的最佳方法為自己做——並向我們發送程式補丁(patch)。

source: Ego
zh_hant: 自我

source: We use the term "Ego" to refer to the fact that users in GNUnet can have multiple unlinkable identities, in the sense of alter egos. The ability to have more than one identity is crucial, as we may want to keep our egos for business separate from those we use for political activities or romance.<br> Egos in GNUnet are technically equivalent to identities (and the code does not distinguish between them). We simply sometimes use the term "ego" to stress that you can have more than one.
zh_hant: 我們使用"Ego"一詞來指稱 GNUnet 中的用戶可以擁有多個不可鏈接的身份（從另一個自我(alter egos)的意義上來說）。由於我們可能希望將我們的商業自我與我們用於政治活動或浪漫的自我分開，擁有多個身份的能力至關重要。<br> GNUnet 中的自我 (Egos) 在技術層面等同於身份 (identities)（並且程式碼並不會區分它們）。我們有時只是簡單地使用"自我(ego)"一詞來強調您可以擁有多個"自我"。

source: Identity
zh_hant: 身份

source: In GNUnet users are identified via a public key, and that public key is then often referred to as the "Identity" of the user. However, the concept is not as draconian as it often is in real life where many are forced to have one name, one passport and one unique identification number. <br> As long as identities in GNUnet are simply public keys, users are free to create any number of identities, and we call those egos to emphasize the difference. Even though users can create such egos freely, it is possible to have an ego certified by some certification authority, resulting in something that more closely resembles the traditional concept of an identity.<br> For example, a university may certify the identities of its students such that they can prove that they are studying. Students may keep their (certified) student identity separate from other egos that they use for other activities in life.
zh_hant: 在 GNUnet 中，用戶通過公鑰識別，而該公鑰通常被稱為用戶的"身份(Identity)"。然而，這個概念並不像現實生活中，許多人被迫擁有一個名字、一本護照和一個唯一的身份證號碼那樣嚴苛。 <br> 只要 GNUnet 中的身份為公鑰，用戶就可以自由創建任意數量的身份 (Identity)，我們稱之為自我 (egos) 以強調差異。即使用戶可以自由地創建這樣的自我，讓某個認證機構對自我進行認證、從而產生更類似於傳統身份概念的東西也是可能的。<br> 例如，一所大學可以證明其學生的身份，以便學校證明該學生正在讀書。學生可以將他們（經過認證）的學生身份與他們用於生活中其他活動的自我分開。

source: Pseudonym
zh_hant: 化名 (Pseudonym)

source: A pseudonym is an ego that is specifically intended to not be linked to one's real name. GNUnet users can create many egos, and thus also many pseudonyms. <br> Repeated uses of the same pseudonym are linkable by definition, as they involve the same public key. Anonymity requires the use of either the special "anonymous" pseudonym (for GNUnet, this is the neutral element on the elliptic curve) or a throw-away pseudonym that is only used once.
zh_hant: 化名 (pseudonym) 是一種專門建立的、與真實姓名無關的自我 (ego)。GNUnet 用戶可以創建許多自我，因此也可以創建許多假名。 <br> 根據定義，由於重複使用相同的假名涉及相同的公鑰，它們是可以被鏈接的。若要保持匿名性，則需使用特殊的"匿名 (anonymous)"假名（對於 GNUnet，這是橢圓曲線上的中性元素）或是使用一次性的拋棄式假名。

source: Namespaces
zh_hant: 命名空間 (Namespaces)

source: The GNU Name System allows every ego (or identity) to securely and privately associate any number of label-value pairs with an ego. The values are called record sets following the terminology of the Domain Name System (DNS). The mapping of labels to record sets for a given ego is called a namespace. <br> If records are made public and thus published, it is possible for other users to lookup the record given the ego's public key and the label. Here, not only the label can thus act as a passphrase but also the public key -- which despite its name may not be public knowledge and is never disclosed by the GNS protocol itself.
zh_hant: GNU 名稱系統允許每個自我（或身份）安全且私密地將任意數量的標籤-值對 (label-value pairs) 與一個自我互相聯繫。根據網域名稱系統 (Domain Name System; DNS) 的術語，這些值稱為記錄集 (record sets)。該自我的標籤到記錄集的映射(mapping )稱為命名空間 (namespace)。<br> 如果記錄被公開並發布，其他用戶就有可能可以根據該自我的公鑰和標籤查找記錄。於此，標籤不僅可以充當密碼短語 (passphrase)，還可以充當公鑰——儘管它的名字可能不被公眾所知，也不會被 GNS 協議本身公開。

source: Peer
zh_hant: 同儕 (Peer)

source: A "peer" is an instance of GNUnet with its own per-instance public key and network addresses. Technically, it is possible to run multiple peers on the same host, but this only makes sense for testing. <br> By design GNUnet supports multiple users to share the same peer, just as UNIX is a multi-user system. A "peer" typically consists of a set of foundational GNUnet services running as the "gnunet" user and allowing all users in the "gnunet" group to utilize the API. On multi-user systems, additional "personalized" services may be required per user. <br> While peers are also identified by public keys, these public keys are completely unrelated to egos or identities. Namespaces cannot be associated with a peer, only with egos.
zh_hant: 一個 "對等點 (peer)" 是個具有其自己實例公鑰和網路位址的 GNUnet 實例。技術上來說，在同一主機上運行多個對等點是有可能的，但這僅在測試方面有意義。<br> 按照設計，GNUnet 支持多個用戶共享同一個對等點，就如同 UNIX 是一個多用戶系統一樣。一個 "對等點" 的組成通常包含由一組以 "gnunet" 用戶身份運行、並允許 "gnunet" 組中的所有用戶使用該 API 的基礎 GNUnet 服務。在多用戶系統上，每個用戶可能需要額外的 "個人化 (personalized)" 服務。 <br> 雖然對等點也由公鑰標識，但這些公鑰與自我或身份完全無關。命名空間不能與對等點相關聯、只能與自我相關聯。

source: Motivation
zh_hant: 動機

source: The Domain Name System today enables traffic amplification attacks, censorship (i.e. China), mass surveillance (MORECOWBELL) and offensive cyber war (QUANTUMDNS).<br/> Unfortunately, band aid solutions such as DoT, DoH, DNSSEC, DPRIVE and the like will not fix this. This is why we built the GNU Name System (GNS), a secure, decentralized name system built on top of GNUnet.
zh_hant: 如今，網域名稱系統可以實現流量放大攻擊 (traffic amplification attacks)、審查 (censorship)（如: 中國）、大規模監控 (mass surveillance; MORECOWBELL)以及攻擊性的網路戰爭(offensive cyber war; QUANTUMDNS)。<br/> 很不幸地，DoT、DoH、DNSSEC、DPRIVE 等應急措施無法解決這些問題。這就是我們構建 GNU 名稱系統 (GNS) -- 一個建立在 GNUnet 之上、安全的、分散的名稱系統的原因。

source: Overview
zh_hant: 總覽

source: The GNU Name System (GNS) is secure and decentralized naming system. It allows its users to register names as top-level domains (TLDs) and resolve other namespaces within their TLDs. <br/> GNS is designed to provide: <ul> <li>Censorship resistance</li> <li>Query privacy</li> <li>Secure name resolution</li> <li>Compatibility with DNS</li>
zh_hant: GNU 名稱系統 (GNS) 是個安全且分散的命名系統。它允許其用戶將名稱註冊為頂級域 (top-level domains ; TLD) 並解析其 TLD 中的其他名稱空間。<br/> GNS 旨在提供：<ul> <li>抗審查性</li> <li>查詢隱私</li> <li>安全的名稱解析</li> <li>與DNS的兼容性S</li>

source: Resources
es: Recursos
zh_hant: 資源

source: libgnurl is a micro fork of libcurl. The goal of libgnurl is to support only HTTP and HTTPS (and only HTTP 1.x) with a single crypto backend (GnuTLS) to ensure a small footprint and uniform experience for developers regardless of how libcurl was compiled.
zh_hant: libgnurl 是 libcurl 的微分支。libgnurl 的目標是通過單個加密後端 (GnuTLS) 以唯一支持 HTTP 和 HTTPS（並且僅支持 HTTP 1.x），用以確保無論 libcurl 是如何被編譯的，開發人員都有相同的體驗與低耗能。

source: Our main usecase is for GNUnet and Taler, but it might be usable for others, hence we&#39;re releasing the code to the general public.
zh_hant: 我們的程式碼主要用於 GNUnet 和 Taler，但考慮到對其他人可能也有幫助，我們決定將程式碼公之於眾。

source: libgnurl is released under the same license as libcurl. Please read the README for instructions, as you must supply the correct options to configure to get a proper build of libgnurl.
zh_hant: libgnurl 與 libcurl 由相同的許可證所發行。由於您必須提供正確的選項來進行配置以獲取正確的 libgnurl 建構，請閱讀 README 以了解更多的相關指令。

source: About gnurl
zh_hant: 關於 gnurl

source: Large parts of the following 6 paragraphs are old and need to be rewritten.
zh_hant: 以下六個段落的大部分內容陳舊，需重新撰寫。
