Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: Taler was built with the goal of fighting corruption and supporting taxation. With Taler, the receiver of any form of payment is easily identified by the government, and the merchant can be compelled to provide the contract that was accepted by the customer. Governments can use this data to tax businesses and individuals based on their income, making tax evasion and black markets less viable.
es: Taler fue desarrollado con el objetivo de combatir la corrupción y apoyar la fiscalidad. Con Taler, el receptor de cualquier forma de pago es fácilmente identificado por el gobierno, y el comerciante puede ser obligado a proporcionar el contrato que fue aceptado por el cliente. Los gobiernos pueden usar estos datos para imponer impuestos a las empresas y a los individuos sobre la base de sus ingresos, haciendo menos viable la evasión de impuestos y los mercados negros.

source: Thus, despite offering anonymity for citizens spending digital cash to buy goods and services, Taler also ensures that the state can observe incoming funds. This can be used to ensure businesses engage only in legal activities, and do not evade income tax, sales tax or value-added tax. However, this observational capability does not extend to the immediate personal domain. In particular, monitoring does not cover shared access to funds with trusted friends and family, or synchronizing wallets across multiple devices.
es: Así, a pesar de ofrecer el anonimato a los ciudadanos durante sus compras de bienes y servicios con dinero electrónico, Taler también asegura que el Estado pueda observar los fondos entrantes. Esto puede usarse para asegurar que las empresas se involucren sólo en actividades legales y no evadan el impuesto sobre la renta, el impuesto sobre las ventas o el impuesto al valor agregado. Sin embargo, esta capacidad de observación no se extiende al dominio personal inmediato. En particular, la supervisión no cubre el acceso compartido a fondos con amigos y familiares de confianza, ni la sincronización de billeteras a través de múltiples dispositivos.

source: Taler's payments are cryptographically secured. Thus, customers, merchants and the Taler payment service provider (the exchange) can mathematically demonstrate their lawful behavior in court in case of disputes. Financial damages are strictly limited, improving economic security for individuals, merchants, the exchange and the state.
es: Los pagos de Taler están asegurados criptográficamente. Así, los clientes, comerciantes y el proveedor de servicios de pago de Taler (el proveedor de intercambios) pueden demostrar matemáticamente su comportamiento legal en los tribunales en caso de disputas. Los daños financieros son estrictamente limitados, mejorando la seguridad económica para las personas, los comerciantes, el proveedor de intercambios y el Estado.

source: As a payment service provider, the Taler exchange is subject to financial regulation. Financial regulation and regular audits are critical to establish trust. In particular, the Taler design mandates the existence of an independent auditor who checks cryptographic proofs that accumulate at the exchange to ensure that the escrow account is managed honestly. This ensures that the exchange does not threaten the economy due to fraud.
es: Como proveedor de servicios de pago, el intercambio de Taler está sujeto a regulación financiera. La regulación financiera y las auditorías regulares son fundamentales para establecer la confianza. En particular, el diseño de Taler obliga a la existencia de un auditor independiente que comprueba las pruebas criptográficas que se acumulan en el intercambio. Así, se garantiza que la cuenta de depósito en garantía se gestiona honestamente. Esto asegura que el intercambio no amenace la economía mediante el fraude.

source: Taler is free software implementing an open protocol standard. Thus, Taler will enable competition and avoid the monopolization of payment systems that threatens global political and financial stability today.
es: Taler es un software libre que implementa un estándar de protocolo abierto. Por lo tanto, Taler permitirá la competencia y evitará la monopolización de los sistemas de pago que amenaza la estabilidad política y financiera mundial hoy en día.

source: Efficient
de: Effizient
es: Eficiente
fr: Efficace
it: Efficiente

source: Taler has an efficient design. Unlike Blockchain-based payment systems, such as Bitcoin, Taler will not threaten the availability of national electric grids or (significantly) contribute to environmental pollution.
es: Taler tiene un diseño eficiente. A diferencia de los sistemas de pago basados en Blockchain, como Bitcoin, Taler no amenazará la disponibilidad de redes eléctricas nacionales ni contribuirá (significativamente) a la contaminación ambiental.

source: Taler and regulation
de: Taler und Regulierungen
es: Taler y la regulación vigente

source: Anti money laundering (AML)
de: Gesetz gegen Geldwäsche
es: Anti Lavado de dinero o 'Anti money laundering' (AML)

source: With Taler, income is visible and can be tied to the contract signed by both parties.
de: Im Taler-Bezahlsystem sind nur Verkäufe und Einkommen öffentlich sichtbar, die in einem signierten Kaufvertrag vereinbart wurden.
es: Con Taler, los ingresos son visibles y pueden estar vinculados al contrato firmado por ambas partes.

source: Know your customer (KYC)
de: Kenne deine Kunden
es: Conoce a tu cliente (KYC)

source: In Taler, payer and payee are known by their bank accounts when withdrawing or depositing coins respectively
de: Käufer und Verkäufer werden anhand ihrer Bankverbindungen erkannt, wenn sie Münzen abheben oder erstatten lassen.
es: En Taler, quien paga y quien recibe el pago se conocen por sus cuentas bancarias al momento de retirar o depositar monedas respectivamente

source: General Data Protection Regulation (GDPR)
es: Regulación General de Protección de Datos (GDPR)

source: Taler cryptographically protects citizen's privacy, and by design implements data minimization and privacy by default.
de: Taler schützt die Privatsphäre der Bürger durch kryptographische Verschlüsselung. Das Konzept des Bezahlsystems ist zudem so angelegt, dass es nur die absolut notwendigen Daten verwendet.
es: Taler protege criptográficamente la privacidad de los ciudadanos y, por diseño, implementa la minimización de datos y privacidad de forma predeterminada.

source: Payment Services Directive (PSD2)
es: Directriz de Servicios de Pago (PSD2)

source: Taler provides an open standard with public APIs contributing to a competitive banking sector.
de: Taler verwendet einen quelloffenen Code mit nicht-proprietären Programmierschnittstellen und trägt auf diese Weise zu einer Vielfalt von Angeboten in der Bankenbranche bei.
es: Taler provee un estándar abierto con API (Interfaz de Programación de Aplicaciones) públicas, que contribuye a un sector bancario competitivo.

source: Taler provides privacy and accountability
de: Taler bietet Privatsphäre und Verantwortung in der Geldwirtschaft
es: Taler provee privacidad y responsabilidad

source: Taler assumes governments can observe traditional wire transfers entering and leaving the Taler payment system. Starting with the wire transfers, governments can obtain:
es: Taler asume que los gobiernos pueden observar transferencias electrónicas tradicionales que entran y salen del sistema de pago de Taler. A partir de las transferencias electrónicas, los gobiernos pueden obtener:

source: The total amount of digital currency withdrawn by a customer. The government can impose limits on how much digital cash a customer can withdraw within a given time frame.
es: La suma total de la moneda electrónica retirada por un cliente. El gobierno puede imponer límites a la cantidad de efectivo electrónico que un cliente puede retirar dentro de un plazo determinado.

source: The income received by any merchant via the Taler system.
es: El ingreso recibido por cualquier comerciante a través del sistema de Taler.

source: The exact details of the underlying contract that was signed between customer and merchant. However, this information would typically not include the identity of the customer.
es: Los detalles exactos del contrato pertinente que se firmó entre el cliente y el comerciante. Sin embargo, esta información normalmente no incluye la identidad del cliente.

source: The amounts of digital coins legitimately withdrawn by customers from the exchange, the value of non-redeemed digital coins in customer's wallets, the value and corresponding wire details of deposit operations performed by merchants with the exchange, and the income of the exchange from transaction fees.
es: Las cantidades de monedas electrónicas retiradas legítimamente por los clientes del proveedor de intercambios, el valor de las monedas electrónicas no reembolsadas en las carteras de los clientes, el valor y los detalles de las operaciones de depósito realizadas por los comerciantes con el proveedor de intercambios.

source: One-Click Cash Payments!
de: Bezahlen mit einem Klick!
es: ¡Pagos en efectivo a un solo click!

source: GNU Taler is an electronic payment system under development at <a href="http://www.inria.fr/">Inria</a>. We expect to make it operational in 2017. You can learn about Taler on this website, try the <a href="https://demo.taler.net">demo</a> and look at our <a href="https://docs.taler.net">developer</a> and <a href="https://api.taler.net">API</a> documentation.
es: GNU Taler es un sistema de pago electrónico que está siendo desarrollado en <a href="http://www.inria.fr/">Inria</a>. Esperamos hacerla operativa en 2017. Puede aprender sobre Taler en este sitio web, pruebe la <a href="https://demo.taler.net">demo</a> y eche un vistazo a nuestro <a href="https://docs.taler.net">desarrollo</a> y a la documentación de la <a href="https://api.taler.net">API</a>.

source: Practical
de: Praktisch
es: Práctico

source: Taler is easy to integrate with existing Web applications. Payments are cryptographically secured and are confirmed within milliseconds with extremely low transaction costs.
es: Taler es fácil de integrar con aplicaciones web existentes. Los pagos están asegurados criptográficamente y se confirman en milisegundos con costos de transacción extremadamente bajos.

source: Taler does not introduce a new currency. Taler uses a digital wallet storing coins and payment service providers with escrow accounts in existing currencies. Thus, Taler's cryptographic coins correspond to existing currencies, such as US Dollars, Euros or even Bitcoins.
es: Taler no introduce una nueva moneda. Taler utiliza una billetera electrónica que almacena monedas y proveedores de servicios de pago con cuentas de depósito en monedas existentes. Así, las monedas criptográficas de Taler corresponden a monedas existentes, tales como Dólares Estadounidenses, Euros o incluso Bitcoins.

source: By design Taler does not suffer from many classes of security problems such as phishing or counterfeit. Thanks to its security features, Taler never rejects a legitimate customer due to a fraud-detection false positive.
es: Por diseño Taler no es blanco de problemas de seguridad como phishing o falsificación. Gracias a sus características de seguridad, Taler nunca rechaza a un cliente legítimo debido a un falso positivo en la detección de fraude.

source: When using Taler, merchant's revenue is transparent for tax collection authorities. Unlike cash and most digital currencies, Taler helps prevent black markets. Taler is not suitable for illegal activities.
es: Al usar Taler, los ingresos del comerciante son transparentes para las autoridades de recaudación de impuestos. A diferencia del efectivo y la mayoría de las monedas electrónicas, Taler ayuda a prevenir los mercados negros. Taler no es adecuado para actividades ilegales.

source: When you pay with Taler, your identity does not have to be revealed. Just like payments in cash, nobody else can track how you spent your electronic money. However, you obtain a legally valid proof of payment.
es: Al pagar con Taler, su identidad no tiene que ser revelada. Al igual que los pagos en efectivo, nadie puede rastrear cómo gasta su dinero electrónico. Sin embargo, obtiene una prueba de pago legalmente válida.

source: Taler provides protocols and reference implementations that in principle enables anybody to run their own payment infrastructure, be it individuals, organizations or whole countries. Since the reference implementation is a <a href="http://www.gnu.org/">GNU</a> package, it will always remain free software.
es: Taler ofrece protocolos e implementaciones de referencia que en principio permiten a cualquiera ejecutar su propia infraestructura de pagos, ya sean individuos, organizaciones o países. Dado que la implementación de referencia es un paquete <a href="http://www.gnu.org/">GNU</a>, siempre permanecerá como Software Libre.

source: Paying with Taler
de: Bezahlen mit Taler
es: Pagando con Taler

source: <p>To pay with Taler, customers install an electronic wallet on their device. Before the first payment, the wallet's balance must be charged in the desired currency by some other means of payment.</p> <p>Once the wallet is charged, payments on websites take only one click, are never falsely rejected by fraud detection and do not pose any risk of phishing or identity theft.</p>
es: <p>Para pagar con Taler, los clientes instalan una billetera electrónica en su dispositivo. Antes del primer pago, el saldo de la billetera debe ser abonado en la moneda deseada por algún otro medio de pago.</p> <p>Una vez que se haya cargado la billetera, los pagos en sitios web solo toman un clic, nunca son rechazados equivocadamente por detección de fraude, y no representan ningún riesgo de phishing o robo de identidad.</p>

source: Receiving payments with Taler
de: Verkaufen mit Taler
es: Recibiendo pagos con Taler

source: <p>To receive Taler payments, a merchant needs a bank account in the desired currency. We provide supporting software in various programming languages to make the integration painless. The merchant's backend for Taler transaction processing can run on the merchant's premises or be hosted by a third party.</p>
es: <p>Para recibir pagos con Taler, un comerciante necesita una cuenta bancaria en la moneda deseada. Nosotros proporcionamos el software de apoyo en varios lenguajes de programación para hacer esta integración más fácil. El backend para el procesamiento de transacciones del comerciante por parte de Taler puede ejecutarse en el hardware del comerciante, o puede estar alojado por un tercero. </ P>

source: Taler News
es: Noticias de Taler

source: Financial News
de: Nachrichten aus der Finanzwelt
es: Noticias Financieras

source: Invest in Taler!
de: In Taler investieren!
es: ¡Invierta en Taler!

source: We have created a company, Taler Systems SA in Luxembourg.<br> Please contact <tt>invest@taler.net</tt> if you want to invest in Taler.
es: Hemos creado una empresa, Taler Systems SA en Luxemburgo. <br> Si desea invertir en Taler puede contactarse al correo electrónico <tt>invest@taler.net</tt>

source: The Team
de: Das Taler-Team
es: El Equipo

source: Our <a href="about.html">team</a> combines world-class business leaders, cryptographers, software engineers, civil-rights activists and academics. We are unified by a vision of how payments should work and the goal of imposing this vision upon the world.
es: Nuestro <a href="about.html">equipo</a> combina líderes empresariales de clase mundial, criptógrafos, ingenieros de software, activistas de derechos civiles, y académicos. Estamos unidos por una visión de cómo deberían funcionar los pagos y nuestra meta es imponer esta visión sobre el mundo.

source: We are currently supported by <a href="http://www.inria.fr/">Inria</a>, the French national institute for research in informatics and automation, and the <a href="https://renewablefreedom.org/">Renewable Freedom Foundation</a>.
es: Actualmente nos apoya <a href="http://www.inria.fr/">Inria</a>, el Instituto Nacional de Investigación en Informática y Automatización, y la <a href = "https: // Renewfreedom.org/">Fundación Libertad Renovable</a>.

source: The Technology
de: Die Technologie
es: La Tecnología

source: All transactions in Taler are secured using <a href="bibliography.html">modern cryptography</a> and trust in all parties is minimized. Financial damage is bounded (for customers, merchants and the exchange) even in the case that systems are compromised and private keys are stolen. Databases can be audited for consistency, resulting in either the detection of compromised systems or the demonstration that participants were honest. Actual transaction costs are fractions of a cent.
es: Todas las transacciones en Taler son seguras ya que usan <a href="bibliography.html">criptografía moderna</a> y la confianza depositada en todas las partes está minimizada. El daño financiero está limitado (para los clientes, los comerciantes y el proveedor de intercambios), incluso en el caso de que los sistemas estuviesen comprometidos y las claves privadas fuesen robadas. Las bases de datos pueden ser auditadas para comprobar su consistencia, lo que resulta en la detección de sistemas comprometidos o la puesta en evidencia de la honestidad de los participantes. Los costos reales de las transacciones son fracciones de un centavo.

source: The Business
de: Das Geschäftsmodell des Taler-Bezahlsystems
es: El Negocio

source: The scalable business model for Taler is the operation of the payment service provider, which converts money from traditional payment systems (MasterCard, SEPA, UPI, Visa, Bitcoin, ACH, SWIFT, etc.) to anonymous electronic coins in the same currency. The customer can then redeem the electronic coins at a merchant, who can exchange them for money represented using traditional payment systems at the exchange. The exchange charges fees to facilitate the transactions.
es: El modelo de negocio escalable para Taler es la operación del proveedor de servicios de pago (proveedor de intercambios), que convierte el dinero de los sistemas de pago tradicionales (MasterCard, SEPA, UPI, Visa, Bitcoin, ACH, SWIFT, etc.) a divisas electrónicas anónimas en el mismo tipo de moneda. Entonces el cliente puede entregar las monedas elecrónicas a un comerciante, que las puede intercambiar por dinero usando los sistemas de pago tradicionales en el proveedor de intercambios. El proveedor de intercambios cobra una comisión para facilitar las transacciones.

source: The Business Case
de: Der Businessplan
es: El Caso de los Negocios

source: Running a Taler payment service operator
de: Ein Taler-Bezahlsystem als Serviceanbieter betreiben
es: Operar una plataforma de servicio de pago de Taler

source: The payment service operator runs the <em>Taler exchange</em>. The exchange charges <b>transaction fees</b> to customers or merchants. Its operational expenses are from wire transfers with the banking system and the operation of the computing infrastructure.
es: El operador del servicio de pago maneja el <em>proveedor de intercambios de Taler</em>. El proveedor de intercambios cobra <b>comisiones de transacción</b> a clientes o comerciantes. Sus gastos operativos provienen de transferencias electrónicas y del funcionamiento de la infraestructura informática.

source: Cryptographic operations, bandwidth and storage costs are less than 0.01 cent per transaction.
de: Die Kosten für die kryptographischen Berechnungen, die Bandbreite und Datenspeicherung betragen weniger als 0,01 Eurocent pro Transaktion.
es: Las operaciones criptográficas, el ancho de banda y los costes de almacenamiento son inferiores a 0.01 centavos por transacción.

source: Multiple Taler transactions can be aggregated into larger wire transfers to merchants to minimize wire transfer costs.
de: Um die Transaktionskosten des Taler-Bezahlsystems noch weiter zu reduzieren, können mehrere kleine Überweisungen auf das Girokonto der Verkäufer in einer Transaktion zusammengefasst und übertragen werden.
es: Múltiples transacciones de Taler se pueden sumar a transferencias electrónicas más grandes de los comerciantes para reducir al mínimo los costes de la transferencia bancaria.

source: Protocol allows the exchange to charge fees for any expensive operation (withdraw, deposit, refresh, refund or aggregated wire transfers).
de: Die Wechselstube kann protokollbasiert verschieden hohe Gebühren verlangen z.B. bei teureren Transaktionen wie Überweisungen von Geschäftsbanken an die Geldbörse, Deponieren von Münzen, Refresh-Funktion, Erstattungen und aggregierte Überweisungen an Geschäftsbanken.
es: El protocolo permite al proveedor de intercambios cobrar honorarios por cualquier operación que tenga un coste (retirar, depositar, actualizar, reembolsar o realizar transferencias electrónicas agrupadas).

source: Partnership with banks establishes consumer trust.
de: Partnerschaften mit Banken erhöhen das Kundenvertrauen.
es: La asociación con bancos consolida la confianza del consumidor.

source: Partnership with free software community enables rapid deployment.
de: Partnerschaften mit der Free-Software-Bewegung ermöglichen eine rasche Einführung.
es: La asociación con la comunidad de Software Libre permite un despliegue rápido.

source: Advantages for Merchants
de: Vorteile für Händler
es: Ventajas para los comerciantes

source: Taler is a cost-effective electronic payment system which provides you with cryptographic proof that the payment worked correctly within milliseconds. Your Web customers pay with previously unknown levels of convenience without risk of fraud.
es: Taler es un sistema de pago electrónico rentable que le proporciona verificación criptográfica del correcto funcionamiento de un pago en milisegundos. Sus clientes web pagan con niveles de comodidad antes desconocidos sin riesgo de fraude.

source: Fast
de: Schnell
es: Rápido
fr: Rapide
it: Veloce

source: Processing transactions with Taler is fast, allowing you to confirm the transaction with your customer virtually immediately. Your customers will appreciate that they do not have to type in credit card information and play the &quot;verified by&quot; game. By making payments significantly more convenient for your customers, you may be able to use Taler for small transactions that would not work with credit card payments due to the mental overhead for customers.
es: El procesamiento de transacciones con Taler es rápido, lo que le permite confirmar la transacción con su cliente de forma casi inmediata. Sus clientes apreciarán no tener que escribir la información de la tarjeta de crédito y jugar el juego del &quot;verificado por&quot;. Al hacer que los pagos sean mucho más fáciles para sus clientes, puede usar Taler para transacciones pequeñas para las que no vale la pena usar la tarjeta de crédito debido a la sobrecarga mental que esto representa para sus clientes.

source: You will have cryptographic proof of payment from the Taler payment service provider. With Taler you never handle sensitive customer account information and thus do not have to undergo any particular security audits (such as PCI DSS). Your systems will have customer contracts with qualified signatures for all transactions which you can use in court in case of disputes.
es: Usted tendrá una prueba criptográfica del pago emitida por el proveedor de servicios de pago de Taler. Con Taler nunca manejará información sensible de la cuenta del cliente y por lo tanto no tiene que someterse a ninguna auditoría de seguridad en particular (como PCI DSS). Sus sistemas tendrán los contratos de sus clientes con las firmas certificadas para todas las transacciones, usted puede usar estos contratos ante los tribunales en caso de disputas.
