Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: The goal is to either build upon the (outdated) <a href="https://github.com/canndrew/gnunet-rs">GNUnet Rust bindings</a> or to follow the path of <a href="GNUnet Go">https://github.com/bfix/gnunet-go</a> which tries to reimplement most of the GNUnet stack. The end result should be an extension template for GNUnet in the form of the existing <a href="https://git.gnunet.org/gnunet-ext.git/">C template</a> which allows to quickly start implementing services and libraries for GNUnet.
zh_hant: 目標是建立在（過時的）<a href="https://github.com/canndrew/gnunet-rs">GNUnet Rust 綁定 (GNUnet Rust bindings)</a>上，或是遵循試圖重新實現大部分 GNUnet stack<a href="GNUnet Go">https://github.com/bfix/gnunet-go</a>的路徑。最終結果應該是現有 <a href="https://git.gnunet.org/gnunet-ext.git/">C 模板</a>形式的 GNUnet擴展模板，此模板允許為GNUnet 快速地啟動實現服務與程式庫。

source: <strong>Mentors:</strong> Martin Schanzenbach
zh_hant: <strong>導師：</strong> Martin Schanzenbach

source: Required Skills: Solid knowledge of Rust and ideally asynchronuous IO.
zh_hant: 必備技能：具備Rust與（理想上）asynchronuous IO 的紮實知識。

source: Difficulty level: medium
zh_hant: 難度等級：中

source: It is time for GNUnet to run properly on Android. Note that GNUnet is written in C, and this is not about rewriting GNUnet in Java, but about getting the C code to run on Android.
zh_hant: 是時候讓 GNUnet 在 Android 上正常運行了。請注意，GNUnet 是使用 C 所撰寫，而這裡並不是要重新以 Java 來撰寫 GNUnet，而是使 C 語言在 Android 上運行。

source: Includes: Implementation of rudimentary Android compatibility for GNUnet, in part by porting the GNUnet utils scheduler to act as a thin wrapper over libuv.
zh_hant: 包括：對 GNUnet 的基本 Android 兼容性的實現，部分是通過移植 GNUnet utils 調度程序來充當 libuv 的精簡包裝。

source: <strong>Mentors:</strong> <a href="https://www.goebel-consult.de/">Hartmut Goebel</a>, Jeff Burdges, Christian Grothoff
zh_hant: <strong>導師：</strong><a href="https://www.goebel-consult.de/">Hartmut Goebel</a>, Jeff Burdges, Christian Grothoff

source: There is a push for migrating our CI to Gitlab. The CI should eventually not just run "make check" on various platforms, but also perform tests with multiple peers running in different VMs with specific network topologies (i.e. NAT) between them being simulated. The CI should also be integrated with Gauger for performance regression analysis. Running jobs only when dependencies have changed and scripting more granular triggers or ideally automatic dependency discovery (as done by the autotools) is also important.
zh_hant: 有一股動力將我們的 CI 遷移到 Gitlab。CI 最終不應該只是在各種平台上運行"make check"，還應該對在不同虛擬機中運行的多個對等點進行測試，這些對等點之間具有特定的網絡拓撲 (i.e. NAT) 被模擬。CI 還應與Gauger整合以進行性能回歸分析。僅在依賴項發生變化時運行作業、編寫更多的粒度觸發器(granular triggers)、或（理想上）自動相依發現(automatic dependency)（由 autotools 完成）也十分重要。

source: <strong>Mentors:</strong> TBD
zh_hant: <strong>導師：</strong> TBD

source: One great problem of the current Internet is the lack of disintermediation. When people want to talk they need a chat service. When they want to share files they need a file transfer service. Although GNUnet already possesses quite advanced integration into Linux networking, a little extra work is needed for existing applications like irc, www, ftp, rsh, nntpd to run over it in a peer-to-peer way, simply by using a GNS hostname like friend.gnu. Once people have added a person to their GNS they can immediately message, exchange files and suchlike directly, with nothing but the GNUnet in the middle, using applications that have been distributed with unix systems ever since the 1980's. We can produce an OS distribution where these things work out of the box with the nicknames of people instead of cloud services. For more information and context, read
zh_hant: 當前網際網路的一大問題是--缺乏去中介化 (disintermediation)。當人們想要交談時，他們需要聊天服務。當人們想要共享文件時，他們需要文件傳輸服務。雖然 GNUnet 已經非常先進地整合到 Linux 網路連結中，但是現有的應用程式（如 irc、www、ftp、rsh、nntpd）僅需要一些額外的工作就能以點對點的方式運行：使用 GNS 主機名，例如 friend.gnu。一旦人們將某人添加到他們的 GNS 中，他們就可以立即直接發送消息、交換文件等，而中間只有 GNUnet、使用自 1980 年代以來就隨 unix 系統分發的應用程式。我們可以製作一個操作系統發行版 (OS distribution)，這些東西用人的暱稱（而非雲端服務）就可以立即使用。有關更多訊息和上下文，請閱讀

source: <strong>Mentors:</strong> lynX &amp; dvn
zh_hant: <strong>導師：</strong> lynX &amp; dvn

source: Implement the AnycastExit spec to enable GNUnet clients to connect over Tor.
zh_hant: 實施 AnycastExit 規範，以使 GNUnet 客戶端能夠通過 Tor 進行連接。

source: <strong>Mentors:</strong> Jeff Burdges
zh_hant: <strong>導師：</strong> Jeff Burdges

source: Note: There was a Special TLDs spec to allow Tor to resolve domain names using GNS over Tor too, but currently that's on hold until folks think more about how names should be moved around the local system. We're calling this more collaborative approach NSS2 for now.
zh_hant: 注意：有一個特殊的 TLDs 規範，允許 Tor 也可以使用 GNS 而不是 Tor 來解析域名，但是直到同仁們對如何在本地系統中移動名稱進行更多思考之前，這將持續處於擱置狀態。我們目前暫時將這種更協作的方法稱為 NSS2。

source: Required Skills: C
zh_hant: 要求技能：C

source: Improve the Rust implementation of GNUnet utils, possibly including adding support for asynchronous IO using mio, or perhaps a higher level asynchronous IO library built upon it, such as rotor, mioco, eventual_io, or gj.
zh_hant: 改進 GNUnet utils 的 Rust 實現，可能包括使用 mio 或基於它構建的更高級的異步 IO 庫 (asynchronous IO library)（例如: rotor、mioco、eventual_io或gj）添加對異步 IO (asynchronous IO) 的支持。

source: Implementation of a replacement for PANDA (see Pond) with better security, and maybe integration with the GNU Name System for key exchange.
zh_hant: 實現具有更好安全性的 PANDA 替代品（請參閱Pond），並且可能與 GNU 名稱系統整合以進行密鑰交換。

source: Required Skills: Rust or C, crypto
zh_hant: 所需技能：Rust 或 C，加密

source: Difficulty level: high
zh_hant: 難度等級：高

source: Implement different place types and file sharing by creating a new place for the shared content.
zh_hant: 通過為共享內容創建新的場所來實現不同的場所類型和文件共享。

source: Place types to be implemented:
zh_hant: 要實施的地點類型：

source: <ul> <li>File: generic file with comments</li> <li>Image: display an image with comments referencing a region of the image</li> <li>Sound: play a sound file with comments referencing a timestamp</li> <li>Directory/Album: pointers to File / Image / Sound places</li> <li>Event: with RSVP</li> <li>Survey: ask your social neighborhood questions in a structured form</li> </ul>
zh_hant: <ul>。<li>文件：帶註釋的通用文件</li>。<li>圖像：顯示帶有引用圖像區域的註釋的圖像</li>。<li>聲音：播放帶有引用時間戳註釋的聲音文件</li><li>目錄/相冊：指向文件/圖像/聲音位置的指示物</li>。<li>活動：含有"請回應"字樣</li>。<li>調查：以結構化的形式詢問您的社交鄰里 (social neighborhood) 問題</li>。</ul>

source: Also provide the following UI functionality:
zh_hant: 也提供以下UI功能：

source: <ul> <li>Fork existing channels, reorganize people into new chatrooms or channels.</li> <li>Share a post (edit and repost something elsewhere, on a fan page for example).</li> <li>Edit a previously published post + offer edit history to readers.</li> <li>Control expiry of channel history.</li> </ul>
zh_hant: <ul>。<li>分叉現有頻道，將人們重新組織到新的聊天室或頻道。</li>。<li>分享文章（例如在粉絲專頁上編輯和在其他地方重新發布內容）。</li>。<li>編輯以前發布的文章 + 向讀者提供編輯歷史記錄。</li>。<li>控制頻道歷史的到期時間。</li>。</ul>

source: See also <a href="http://secushare.org/features">http://secushare.org/features</a>
zh_hant: 另請參閱 <a href="http://secushare.org/features">http://secushare.org/features</a>

source: <strong>Mentors:</strong> lynX
zh_hant: <strong>導師：</strong> lynX

source: Required Skills: C/C++
zh_hant: 要求技能：C / C ++

source: Implement aggregation of distributed state from various channels in order to provide for a powerful social graph API capable of producing social network profiles, dashboards, a calendar out of upcoming event invitations (if available), social search functionality and most of all to make it easy for users to adopt cryptographic identities of their contacts/friends simply by finding them in the social graph of their existing contacts ("This is Linda. You have 11 contacts in common with her. [ADD]").
zh_hant: 實現來自各種頻道的分佈式狀態的聚合 (aggregation)，以提供強大的社交圖譜應用程式介面(social graph API)，該 API 能夠生成社交網路簡介 (social network profiles)、儀表板 (dashboards)、即將到來的活動邀請（若可用）的日曆、社交搜尋功能，最重要的是，讓用戶只需要在他們現有聯絡人的社交圖譜中找到他們的聯絡人/朋友的加密身份一事變得容易（"這是琳達。您和她有 11 個共同聯絡人。[ADD]"）。

source: Related to <a href="http://secushare.org/rendezvous">secushare.org/rendezvous</a>
zh_hant: 與之相關 <a href="http://secushare.org/rendezvous">secushare.org/rendezvous</a>

source: <strong>Mentors:</strong> t3sserakt, lynX
zh_hant: <strong>導師：</strong> t3sserakt, lynX

source: <ul> <li> Emulate IMAP/SMTP protocols as necessary to transform traditional mail clients into secushare user interfaces. </li> <li> Think of ways to map e-mail addresses to secushare identities. </li> <li> Encode or translate various e-mail features into secushare equivalents. </li> <li> Parts of secushare are currently written in Rust, therefore Rust is preferred for this task but it is not an requirement. </li> </ul>
zh_hant: <ul><li>根據需要模擬的 IMAP/SMTP 協議，將傳統郵件客戶端轉換為 secushare 使用者介面。 </li><li> 想辦法將電子郵件地址映射到 secushare 身份上。 </li><li> 將各種電子郵件功能編碼或翻譯成 secushare 等價物。 </li><li> 由於目前 secushare 的一部分用 Rust 編寫的， Rust 為此課題的首選，但這不是必需的。</li></ul>

source: Implementation of the GNUnet auction system described in Chapter 3 of <a href="https://grothoff.org/christian/teich2017ms.pdf">this thesis</a>. Specific tasks are adding smart contract creation and round time enforcement to libbrandt as well as creating the GNUnet auction service, library and the three user interface programs create, info and join.
zh_hant: <a href="https://grothoff.org/christian/teich2017ms.pdf">本論文</a>第 3 章描述了GNUnet 拍賣系統 (GNUnet auction system) 的實現。 具體任務是在 libbrandt 中增加智能合約建立 (smart contract creation) 與輪次執行 (round time enforcement)，以及創建 GNUnet 拍賣服務 (GNUnet auction service)、圖書館 (library) 和三個使用者介面程式創建 (create)、資訊 (info) 和加入 (join)。

source: <strong>Mentors:</strong> mate, cg
zh_hant: <strong>導師：</strong> mate, cg

source: Implementation of additional transports to make GNUnet communication more robust in the presence of problematic networks: GNUnet-over-SMTP, GNUnet-over-DNS
zh_hant: 在存在問題網絡的情況下，實現附加傳輸以使 GNUnet 通訊更加健壯：GNUnet-over-SMTP、GNUnet-over-DNS

source: <strong>Mentors:</strong> Matthias Wachs
zh_hant: <strong>導師：</strong> Matthias Wachs

source: Implementation of ALG-based NAT traversal methods (FTP/SIP-based hole punching, better STUN support)
zh_hant: 基於 ALG 的 NAT 遍歷方法 (traversal methods) 的實現（基於 FTP/SIP 的 hole punching，更好的 STUN support）

source: <strong>Mentors:</strong> Matthias Wachs, Christian Grothoff, Jeff Burdges
zh_hant: <strong>導師：</strong> Matthias Wachs, Christian Grothoff, Jeff Burdges

source: Improving libaboss to make computation on shared secrets (including repeated multiplication) based on <a href="https://dl.acm.org/citation.cfm?doid=62212.62213">Ben-Or et al.</a> if possible. This in particular means moving libaboss to bignums (gcry_mpi).
zh_hant: 基於<a href="https://dl.acm.org/citation.cfm?doid=62212.62213"> Ben-Or等人</a> 改進 libaboss 以對共享機密（包括重複乘法）進行計算。這尤其意味著將 libaboss 移至 bignums (gcry_mpi)。

source: Please refer to the description for this project listed under GNU Guix project ideas.
zh_hant: 請參考在 GNU Guix 項目下列出的有關該項目的描述。

source: Python 2.7 is reaching its end-of-life, and we want to get rid of the dependency on Python. The existing gnunet-qr tool is a rather simple wrapper around python-zbar, which itself wraps libzbar. The goal of this project is to directly use libzbar to scan QR codes for GNUnet / the GNU Name System (see also <a href="https://bugs.gnunet.org/view.php?id=5562">#5562</a>).
zh_hant: Python 2.7 即將到達其壽命終點，我們希望可以脫離對 Python 的依賴。現有的 gnunet-qr 工具是圍繞 python-zbar 的一個相當簡單的封套資料 (wrapper)，它本身包覆了 libzbar。該計畫的目標是直接使用 libzbar 來掃描 GNUnet/GNU 名稱系統的 QR codes（另請參考 <a href="https://bugs.gnunet.org/view.php?id=5562">#5562 </a>）。

source: <strong>Mentors:</strong> Christian Grothoff
zh_hant: <strong>導師：</strong> Christian Grothoff

source: Required Skills:
zh_hant: 要求技能：

source: Difficulty level:
zh_hant: 難度等級：

source: Report:
zh_hant: 報告：

source: Unfinished/Abandoned as gnunet-qr was moved to C outside of GSoC.
zh_hant: 未完成/被放棄，因為 gnunet-qr 已移至 GSoC 之外的 C 中。

source: Implementation of a Web-based UI for GNUnet similar to GNUnet-Gtk with a yet to be determined framework such as Angular2. This includes the design and implementation of not yet existing <a href="http://jsonapi.org/">REST APIs</a> that expose the <a href="https://docs.gnunet.org/doxygen/modules.html">GNUnet API</a>.
zh_hant: 為了予 GNUnet 實現類似於 GNUnet-Gtk的Web-based UI，具有尚未確定的框架，例如 Angular2。這包括尚不存在的<a href="http://jsonapi.org/">REST APIs</a>的設計和實現，而 REST APIs 將公開<a href="https://docs.gnunet.org/doxygen/modules.html">GNUnet API</a>。

source: Required Skills: C, JavaScript, CSS
zh_hant: 要求技能：C、JavaScript、CSS

source: Report: <a href="gsoc-2018-gnunet-webui.html">GSoC 2018: GNUnet WebUI</a>
zh_hant: 報告：<a href="gsoc-2018-gnunet-webui.html">GSoC 2018：GNUnet WebUI</a>

source: The Internet of tomorrow needs GNUnet today
zh_hant: 明天的互聯網需要今天的 GNUnet (The Internet of tomorrow needs GNUnet today)

source: Latest news
zh_hant: 最新資訊

source: Older news entries
zh_hant: 較早的新聞項目

source: The Internet is broken
zh_hant: 網路壞掉了 (The Internet is broken)

source: The conventional Internet is currently like a system of roads with deep potholes and highwaymen all over the place. Even if you still can use the roads (e.g. send emails, or browse websites) your vehicle might get hijacked, damaged, or long arms might reach into its back and steal your items (data) to use it against you and sell it to others - while you can&#39;t even notice the thievery nor accuse and hold the scroungers accountable. <!-- Proposal from Fabian Gerlach: The conventional Internet is currently like a system of roads with deep potholes and surveillance cameras all over the place. Even if you still can use the roads (e.g. send emails, or browse websites) your vehicle might gets damaged. And the surveillance cameras will create a movement profile about your life: They recognize your car license plate, track you everywhere you drive, and save this information in a central data base. --> The Internet was not designed with security in mind: protecting against address forgery, routers learning metadata, or choosing trustworthy third parties is nontrivial and sometimes impossible. <!-- Proposal from Fabian Gerlach: The Internet is not designed with security in mind: The network generally learns too much about users; it has insecure defaults and high complexity; and it is centralized. That makes it very vulnerable for multiple attacks massively threatening our freedom. -->
zh_hant: 傳統的網際網路目前就像一個坑坑窪窪的道路系統，且到處都是攔路搶劫的強盜。就算您仍然可以使用道路（例如發送電子郵件或瀏覽網站），您的車輛可能會被劫持、損壞，或者可能會有長長的手臂伸入你的後車廂並竊取您的財物（資料）並以此對付您、將您的物品出售給他人- 而您甚至無法注意到這些竊盜行為，也無法指責和追究掠奪者。 <!-- Proposal from Fabian Gerlach: The conventional Internet is currently like a system of roads with deep potholes and surveillance cameras all over the place. Even if you still can use the roads (e.g. send emails, or browse websites) your vehicle might gets damaged. And the surveillance cameras will create a movement profile about your life: They recognize your car license plate, track you everywhere you drive, and save this information in a central data base. --> 網際網路的設計並沒有考慮到安全性：防止位址偽造、路由器學習元資料 (metadata)、或選擇值得信賴的第三方並非易事，有時甚至是不可能的。 <!-- Proposal from Fabian Gerlach: The Internet is not designed with security in mind: The network generally learns too much about users; it has insecure defaults and high complexity; and it is centralized. That makes it very vulnerable for multiple attacks massively threatening our freedom. -->

source: GNUnet helps building a new Internet
zh_hant: GNUnet 幫助建立新的網路

source: GNUnet is a network protocol stack for building secure, distributed, and privacy-preserving applications.<br/> With strong roots in <a class="link" href="https://bib.gnunet.org">academic research</a>, our goal is to replace the <a class="link" href="https://secushare.org/broken-internet">old insecure Internet</a> protocol stack.
zh_hant: GNUnet 是用於構建安全，分佈式和隱私保護應用程序的網絡協議棧。<br/>紮根於<a class="link" href="https://bib.gnunet.org">學術研究</a>，我們的目標是取代<a class="link" href="https://secushare.org/broken-internet">舊的不安全的 Internet</a>協議棧。

source: Metadata is exposed
zh_hant: 元數據 (Metadata) 已被暴露

source: Your metadata is just as revealing as the actual content; and it gets exposed on the Internet.<br> Even though transport encryption is increasingly being deployed on the Internet, it still reveals data that can threaten democracy: the identities of senders and receivers, the times, frequency and the volume of communication are all still revealed.<br>
zh_hant: 您的元資料 (metadata) 與實際內容都被曝光；並且被公開在網際網路上。<br>儘管傳輸加密在網際網路上被越來越廣泛地部署，資料仍可能會被洩漏並威脅到民主：發送者和接收者的身份、時間、頻率和通信量仍被暴露。<br>

source: GNUnet provides privacy-by design
zh_hant: GNUnet 通過設計提供隱私

source: It provides <a class="link" href="https://www.w3.org/2014/strint/papers/65.pdf"> improving addressing, routing, naming and content distribution</a> in a technically robust manner - as opposed to ad-hoc designs in place today. <!-- Proposal from fabian gerlach: GNUnet is built <a href="https://www.w3.org/2014/strint/papers/65.pdf">"privacy by design"</a> and "distributed by design". This improves addressing, routing, naming and content distribution in a technically robust manner. -->
zh_hant: 與當今的臨時設計(ad-hoc designs)相反，它提供了<a class="link" href="https://www.w3.org/2014/strint/papers/65.pdf">改良的尋址(addressing)、路由(routing)、命名(naming )和內容分發(content distribution)</a>並且使用了技術穩健的方式(technically robust manner)。 <!-- Proposal from fabian gerlach: GNUnet is built <a href="https://www.w3.org/2014/strint/papers/65.pdf">"隱私設計(privacy by design)"</a> and "分發設計(distributed by design)". 這以技術穩健的方式改進了尋址、路由、命名和內容分發。-->

source: Freedoms are not respected
zh_hant: 自由不被尊重

source: Today, monitoring increasingly centralized infrastructure, proprietary implementations, traffic shapers and firewalls restrict all of the <a class="link" href="https://www.gnu.org/philosophy/free-sw.html">essential freedoms</a> to various degrees.
zh_hant: 如今，監視越來越集中化的基礎建設、專有實現 (proprietary implementations)、流量整形器 (traffic shapers)和防火牆在各種程度上限制了所有的<a class="link" href="https://www.gnu.org/philosophy/free-sw.html">基礎自由</a>。

source: GNUnet supports a free and open society
zh_hant: GNUnet 支持自由開放的社會

source: GNUnet is a self-organizing network and it is <a class="link" href="https://www.gnu.org/philosophy/free-sw.html">free software</a> as in freedom. GNUnet puts you in control of your data. You determine which data to share with whom, and you&#39;re not pressured to accept compromises. It gives users freedoms to securely access information ("run" the network), to study all aspects of the network&#39;s operation ("access the code"), to distribute information ("copy"), as well as the freedom to deploy new applications ("modify").
zh_hant: GNUnet 是一個自組織網路 (self-organizing network)，它是一個<a class="link" href="https://www.gnu.org/philosophy/free-sw.html">自由軟體</a>。GNUnet 讓您可以掌控您的資料。您可以決定與誰共享哪些資料，且您不必被迫妥協。GNUnet賦予用戶安全地訪問訊息的自由（"運行"網路）、研究網路運行各層面的自由（"存取程式碼"）、分發訊息的自由（"複製"）以及部署新的應用程式的自由（"修改"）。

source: Decentralization is the key, but hard
zh_hant: 去中心化是關鍵，但很難實踐

source: <!-- replaced with Proposal from Fabian Gerlach: It seems as if every other distributed or P2P project develops its own library stack, covering transports, stream muxing, discovery and others. This divides effort and multiplies bug count. --> Instead of sharing common components and tools for building P2P systems, every P2P project seems to re-invent the wheel. <!-- TODO: rework this sentence. --> This heightens the effort and increases the potential number of vulnerabilities.
zh_hant: <!-- replaced with Proposal from Fabian Gerlach: It seems as if every other distributed or P2P project develops its own library stack, covering transports, stream muxing, discovery and others. This divides effort and multiplies bug count. --> 每個 P2P 項目似乎都在重新發明"輪子"，而不是共享用於構建P2P系統的通用元件和工具。 <!-- TODO: rework this sentence. -->這會增加工作量並且增加潛在的漏洞數量。

source: GNUnet is a framework
zh_hant: GNUnet 是一個框架

source: It offers a metadata-preserving foundation for your application. It offers components for addressing, reliable encrypted channels with advanced routing and resource discovery and naming. Our work is based on continuous research spanning almost two decades.
zh_hant: 它為您的應用程式提供了保留元資料的基礎。它提供用於尋址、具有高級路由和資源發現和命名的可靠加密通道的組件。我們的工作基於跨越近二十年的持續研究。

source: Learn more
zh_hant: 了解更多

source: Get started
zh_hant: 開始

source: Tutorial: GNUnet on Arch Linux/Pi
zh_hant: 教學：Arch Linux/Pi上的 GNUnet

source: Requirements for Raspberry Pi 3
zh_hant: Raspberry Pi 3 的要求

source: Get the Source Code
zh_hant: 取得原始碼

source: In Addition: gnunet-gtk
zh_hant: 此外：gnunet-gtk

source: Run
zh_hant: 執行

source: Make sure, it works!
zh_hant: 確保，可以運行！

source: Tutorial: GNUnet on Debian 9
zh_hant: 教學：Debian 9 上的 GNUnet

source: Introduction
zh_hant: 簡介

source: Requirements
zh_hant: 需求

source: Make an installation directory
zh_hant: 製作安裝目錄

source: Get the source code
zh_hant: 取得原始碼

source: Compile and Install
zh_hant: 編譯與安裝

source: Option 1: GNUnet for testing / usage
zh_hant: 選項1：用於測試/使用的 GNUnet

source: Option 2: GNUnet for development
zh_hant: 選項2：用於開發的 GNUnet

source: Install GNUnet plugin for name resolution
zh_hant: 安裝 GNUnet 插件以進行名稱解析

source: Create configuration file
zh_hant: 創建配置文件

source: Use GNUnet!
zh_hant: 使用 GNUnet！

source: Uninstall GNUnet and its dependencies
zh_hant: 卸載 GNUnet 及其附屬物

source: Tutorial: GNUnet on macOS 10.14 (Mojave)
zh_hant: 教學：macOS 10.14 (Mojave)上的 GNUnet

source: Installation
zh_hant: 安裝

source: First steps
zh_hant: 第一步

source: Alternative: Installation from source
zh_hant: 其他選項：從源安裝

source: Option 1: GNUnet for production / usage
zh_hant: 選項1：用於生產/使用的 GNUnet

source: Option 2: GNUnet experimental
zh_hant: 選項2：試驗性 GNUnet

source: Tutorial: GNUnet on NetBSD 8.0 CURRENT
zh_hant: 教學：NetBSD 8.0 當前上的 GNUnet

source: Tutorial: GNUnet on OpenWrt
zh_hant: 教學：OpenWrt 上的 GNUnet

source: Configuration
zh_hant: 配置

source: Tutorial: GNUnet on Ubuntu 18.04
zh_hant: 教學：Ubuntu 18.04 上的 GNUnet

source: Notice: GNUnet is still undergoing major development. It is largely <i>not yet ready</i> for usage beyond developers.
zh_hant: 注意：GNUnet 仍在進行重大開發。它很大部分地<i>尚未準備好</i>供開發人員使用。

source: <p>Please be aware that this project is still in an early alpha stage when it comes to running software &#8211; its not an easy task to rewrite the whole Internet! We are happy to get your <a href="engage.html">helping hand</a> anytime! Further information is available in our <a href="https://docs.gnunet.org/#toc-Using-GNUnet-1">handbook</a>. If you have any queries about the installation or the usage, please <a href="engage.html">get in touch!</a></p>
zh_hant: <p>請注意，該項目在運行軟體方面仍處於早期的alpha 階段&#8211;重寫整個網際網路並非易事！我們很樂意隨時得到您的<a href="engage.html">幫助</a>！您可以在我們的<a href="https://docs.gnunet.org/#toc-Using-GNUnet-1">手冊</a>中找到更多訊息。如果您對安裝或使用有任何疑問， 請<a href="engage.html">與我們保持聯繫！</a></p>
