Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: cURL supports many crypto backends. GNUnet requires the use of GnuTLS, but other variants are used by some distributions. Supporting other crypto backends would again expose us to a wider array of security issues, may create licensing issues and most importantly introduce new bugs as some crypto backends are known to introduce subtle runtime issues. While it is possible to have two versions of libcurl installed on the same system, this is error-prone, especially as if we are linked against the wrong version, the bugs that arise might be rather subtle.
zh_hant: cURL 支持許多加密後端。GNUnet 需要使用 GnuTLS，但某些發行版本使用其他變形。支持其他加密後端將再次使我們面臨更廣泛的安全問題，這可能會產生許可問題，最嚴重的是，已知某些加密後端會引入不易察覺的執行時期問題 (runtime issues) 而帶來新的錯誤。雖然可以在同一個系統上安裝兩個版本的 libcurl，但這很容易出錯，尤其是當我們鏈接到錯誤的版本時，出現的錯誤可能十分不易察覺。

source: For GNUnet, we also need a particularly modern version of GnuTLS. Thus, it would anyway be necessary to recompile cURL for GNUnet. But what happens if one links cURL against this version of GnuTLS? Well, first one would install GnuTLS by hand in the system. Then, we build cURL. cURL will build against it just fine, but the linker will eventually complain bitterly. The reason is that cURL also links against a bunch of other system libraries (gssapi, ldap, ssh2, rtmp, krb5, sasl2, see discussion on obscure protocols above), which --- as they are part of the distribution --- were linked against an older version of GnuTLS. As a result, the same binary would be linked against two different versions of GnuTLS. That is typically a recipe for disaster. Thus, in order to avoid updating a dozen system libraries (and having two versions of those installed), it is necessary to disable all of those cURL features that GNUnet does not use, and there are many of those. For GNUnet, the more obscure protocols supported by cURL are close to dead code --- mostly harmless, but not useful. However, as some application may use one of those features, distributions are typically forced to enable all of those features, and thus including security issues that might arise from that code.
zh_hant: 對於 GNUnet，我們還需要一個特定現代版本的 GnuTLS 。因此，無論如何都需要為 GNUnet 再次編譯 cURL。但是，如果將 cURL 鏈接到此版本的 GnuTLS 會發生什麼事？首先，GnuTLS 需要被手動安裝在系統中。接著，我們需要構建 cURL。cURL 會順利地構建，但鏈接器最終會"抱怨"。鏈接器會"抱怨"是因為 cURL 還鏈接了許多其他系統庫 （gssapi, ldap, ssh2, rtmp, krb5, sasl2, 請參閱上方關於 obscure protocols 的討論）。由於這些系統庫是分發的一部分，他們與舊版的GnuTLS 有鏈接。因此，同一個二進製文件將鏈接到兩個不同版本的 GnuTLS。這通常是災難的"秘訣"。因此，為了避免更新十幾個系統庫（並安裝兩個版本），禁用 GNUnet 不使用的（為數眾多的）所有 cURL 功能是有必要的。對於 GNUnet 來說，cURL 支持的更隱晦的協議接近死代碼——大多是無害的，但也沒有用。然而，由於某些應用程序可能會使用其中一項功能，分發版通常會被迫啟用所有這些功能，從而包括可能由該代碼引起的安全問題。

source: So to use a modern version of GnuTLS, a sane approach is to disable all of the "optional" features of cURL that drag in system libraries that link against the older GnuTLS. That works, except that one should then NEVER install that version of libcurl in say /usr or /usr/local, as that may break other parts of the system that might depend on these features that we just disabled. Libtool versioning doesn't help here, as it is not intended to deal with libraries that have optional features. Naturally, installing cURL somewhere else is also problematic, as we now need to be really careful that the linker will link GNUnet against the right version. Note that none of this can really be trivially fixed by the cURL developers.
zh_hant: 因此，要使用現代版本的 GnuTLS，一個明智的方法是禁用 cURL 的所有"可選 (optional)"功能，這些功能將鏈接部份連接到舊的 GnuTLS 程式庫中。這是可以運行的，但是使用者"永遠"不應該在 /usr 或 /usr/local 中安裝那個版本的 libcurl，因為這可能會破壞系統的其他部分，而這些部分可能依賴於我們剛剛禁用的功能。Libtool版本控制在這裡沒有幫助，因為 Libtool 版本控制的原意並非處理具有可選功能的程式庫。理所當然地，在其他地方安裝 cURL 也會造成問題，因為我們現在必須非常小心，鏈接器會將 GNUnet 部份連接到正確的版本。請注意，cURL 開發人員無法輕鬆地解決這些問題。

source: Rename to fix
zh_hant: 重命名以修復

source: How does forking fix it? Easy. First, we can get rid of all of the compatibility issues --- if you use libgnurl, you state that you don&#39;t need anything but HTTP/HTTPS. Those applications that need more, should stick with the original cURL. Those that do not, can choose to move to something simpler. As the library gets a new name, we do not have to worry about tons of packages breaking as soon as one rebuilds it. So renaming itself and saying that "libgnurl = libcurl with only HTTP/HTTPS support and GnuTLS" fixes 99%% of the problems that darkened my mood. Note that this pretty much CANNOT be done without a fork, as renaming is an essential part of the fix. Now, there might be creative solutions to achieve the same thing within the standard cURL build system, but this was deemed to be too much work when gnurl was originally started. The changes libgnurl makes to curl are miniscule and can easily be applied again and again whenever libcurl makes a new release.
zh_hant: 分叉 (forking ) 是如何解決此問題的？答案很簡單。首先，我們可以擺脫所有的兼容性問題——如果你使用 libgnurl，您聲明除了 HTTP/HTTPS 以外，您不需要任何東西。那些需要更多東西的應用程式應該持續使用原始的cURL。那些不需要的，則可以轉而選擇更簡單的東西。由於程式庫有了一個新名稱，我們不必擔心一旦重建此程式庫就會損壞大量套件的問題。所以將其重命名並表示 "libgnurl = libcurl with only HTTP/HTTPS support and GnuTLS" 修復了 99%% 的問題使讓我情緒黯淡。請注意，如果沒有 fork，這幾乎"無法"完成，因為重命名為修復過程中很重要的一部分。現在，在標準的 cURL 構建系統中可能會有創意的解決方案來實現同樣的事情，但是這在 gnurl 最初被啟動時被認為是太多工作了。

source: Using libgnurl
zh_hant: 使用 libgnurl

source: Projects that use cURL only for HTTP/HTTPS and that would work with GnuTLS should be able to switch to libgnurl by changing "-lcurl" to "-lgnurl". That&#39;s it. No changes to the source code should be required, as libgnurl strives for bug-for-bug compatibility with the HTTP/HTTPS/GnuTLS subset of cURL. We might add new features relating to this core subset if they are proposed, but so far we have kept our changes minimal and no additions to the original curl source have been written.
zh_hant: 僅將 cURL 用於 HTTP/HTTPS 並且可以與 GnuTLS 一起使用的專案應該能夠通過將"-lcurl"更改為"-lgnurl"來切換到 libgnurl。就是這樣。不需要更改原始碼，因為 libgnurl 力求與 cURL 的 HTTP/HTTPS/GnuTLS 子集錯誤對錯誤相容 (bug-for-bug compatibility)。如果有人提議，我們可能會添加與此核心子集相關的新功能，但到目前為止，我們將更改保持在最低限度，並且沒有添加新功能到原始的 curl source 中。

source: Gotchas
zh_hant: 陷阱 (Gotchas)

source: libgnurl and gnurl are not intended to be used as a replacement for curl for users: <br> This does not mean there is no confidence in the work done with gnurl, it means that tools which expect curl or libcurl will not make use of a different named binary and library. If you know what you are doing, you should be able to use gnurl as part of your tooling in place of curl. We do not recommend to do so however, as the only usage it is tested for <em>so far</em> is as part of Taler&#39;s and GNunet&#39;s build-system. <br> Since no conflicts in filenames occur you are not expected to remove curl to make use of gnurl and viceversa.
zh_hant: libgnurl 和 gnurl 的原意並非作為用戶 curl 的替代品: <br> 這並不意味著我們對使用gnurl完成的工作沒有信心，而是意味著我們期望 curl 或 libcurl 的工具不會使用不同的命名二進製文件和程式庫。如果您知道自己在做什麼，您應該能夠使用gnurl作為您工具的一部分來代替curl。但是，我們不建議這樣做，因為<em>到目前為止</em>，已經測試過的唯一用法是將其作為 Taler 和 GNunet 構建系統的一部分。<br> 由於檔案名稱中沒有發生衝突，您不需要刪除 curl 來使用 gnurl，反之亦然。

source: You can get the gnurl git repository using:
zh_hant: 您可以使用以下命令獲取 gnurl git 儲存庫：

source: The versions are checked in as (signed) git tags.
zh_hant: 這些版本以（簽字的）git標籤登記。

source: Releases are published on <a href="https://ftpmirror.gnu.org/gnu/gnunet/">ftpmirror.gnu.org/gnu/gnunet</a>. gnurl is available from within a variety of distributions and package managers. Some Package Managers which include gnurl are: <a href="https://www.gnu.org/software/guix/">GNU Guix</a> (available as "gnurl"), <a href="https://gentoo.org">Gentoo</a> through the collaborative ebuild collection <a href="https://git.gnunet.org/youbroketheinternet-overlay.git/">youbroketheinternet</a>, <a href="https://nixos.org/nix/">Nix</a>, and as www/gnurl in <a href="https://pkgsrc.org">pkgsrc</a>.
zh_hant: 版本發佈於<a href="https://ftpmirror.gnu.org/gnu/gnunet/">ftpmirror.gnu.org/gnu/gnunet</a>。您則可以從各種發行版和軟體套件管理系統 (package managers) 中取得 gnurl 。一些包含 gnurl 的軟體套件管理系統包括：<a href="https://www.gnu.org/software/guix/">GNU Guix</a>(available as "gnurl")、 <a href="https://gentoo.org">Gentoo</a>通過 ebuild collection 協作的<a href="https://git.gnunet.org/youbroketheinternet-overlay.git/">youbroketheinternet</a>、 <a href="https://nixos.org/nix/">Nix</a>、以及 www/gnurl 中的 <a href="https://pkgsrc.org">pkgsrc</a>。

source: Building gnurl
zh_hant: 建立 gnurl

source: We suggest to closely follow release announcements, as they might indicate changes in how gnurl is to be build. <br> If your package manager provides a binary build or build instructions to build gnurl from source automated and integrated with your environment, we strongly suggest to use this binary build. <br> There are two ways to build gnurl. The first one builds from the most recent git tag, the second one uses the distributed tarball. Distributors generally are supposed to build from the tarball, but we describe both methods here. Both methods are written with a NetBSD 9 userland in mind, substitute tools as necessary. <br> You should <b>avoid</b> building gnurl from the tip of the default git branch, as only tags are considered to be stable and approved builds.
zh_hant: 我們建議您密切關注發佈公告，因為公告內容可能會指出 gnurl 的構建方式發生了變化。<br> 如果您的軟體套件管理系統提供二進制構建或構建指令來從原始碼自動構建 gnurl 並與您的環境相整合，我們強烈建議您使用此二進制構建。<br> 有兩種方法可以構建 gnurl。第一種方法為從最新的 git 標籤 (git tag) 構建，第二種方法則是使用分佈式 tarball (distributed tarball)。分配器 (Distributors ) 通常應該要從 tarball 構建，但我們在此會對兩種方法做描述。這兩種方法都是在考慮到 NetBSD 9 用戶空間的情況下編寫的，請根據需要替換適當的工具。<br>您應該<b>避免</b>從默認 git 分支(default git branch) 的尖端構建 gnurl，因為只有標籤 (tags) 被認為是穩定的、已批准的構建。

source: Building from the distributed tarball (prefered method)
zh_hant: 從分佈式 tarballr 建立（首選方法）

source: If you want to verify the signature, install an OpenPGP compatible tool such as security/gnupgp2 (and set it up). Assuming you use pkgin:
zh_hant: 如果您想要驗證簽名，請安裝與 OpenPGP 兼容的工具，例如 security/gnupgp2 （並進行設置）。假設您使用 pkgin：

source: Fetch the signature key from
zh_hant: 從中獲取簽名密鑰

source: or via commandline with gnupg2.
zh_hant: 或通過 gnupg2 命令行。

source: Fetch the release, the signature, the checksum file as well as its signature:
zh_hant: 獲取版本、簽名，校驗和文件及其簽名：

source: verify the signatures, and verify the checksums against the checksums in the .sum.txt file.
zh_hant: 驗證簽名，並針對 .sum.txt 文件中的校驗和進行校驗和認證。

source: unpack the tarball:
zh_hant: 打開壓縮包：

source: Change into the directory
zh_hant: 切換到目錄

source: Now you can either run
zh_hant: 現在您可以運行

source: directly (and read configure-gnurl before you do so) or invoke
zh_hant: 直接地（並在進行之前閱讀 configure-gnurl）或調用

source: and pass additional parameters such as a custom PREFIX location. Further reference can be the
zh_hant: 並傳遞其他參數，例如自定義的 PREFIX 位置。更多參考為

source: Now run
zh_hant: 現在運行

source: (this is optional)
zh_hant: （此為非強制的）

source: and you are done.
zh_hant: 您已完成。

source: Building from a tagged git commit
zh_hant: 從標記的 git commit 中建構

source: Follow the steps above, but instead of downloading the tarball, clone the git tag you want to build from.
zh_hant: 請按照上述步驟操作，複製您想要從此建構的 git 標籤，而非下載 tarball。

source: Reporting Bugs
zh_hant: 回報錯誤

source: You can report bugs on our bug tracker: <a href="https://bugs.gnunet.org/">bugs.gnunet.org</a>. Alternatively you can use our bug mailinglist, but we prefer to track bugs on the bugtracker.
zh_hant: 您可以透過我們的錯誤追踪器報告錯誤：<a href="https://bugs.gnunet.org/">bugs.gnunet.org</a>。或是您也可以使用我們的報錯寄件名單，但我們較偏好您使用錯誤追踪器來舉報錯誤。

source: Maintainer and Cryptographic signatures
zh_hant: 維護者和密碼簽名

source: gnurl/libgnurl is looking for a new maintainer. Releases after version 7.69.1 and up to version 7.72.0 were signed with the OpenPGP Key <b>0xD6B570842F7E7F8D</b> (<a href="https://keys.openpgp.org/search?q=6115012DEA3026F62A98A556D6B570842F7E7F8D">keys.openpgp.org</a>), with the key fingerprint <b>6115 012D EA30 26F6 2A98 A556 D6B5 7084 2F7E 7F8D</b>.
zh_hant: gnurl/libgnurl 正在尋找新的維護者。版本 7.69.1 至版本 7.72.0 為 OpenPGP Key 所簽署<b>0xD6B570842F7E7F8D</b>(<a href="https://keys.openpgp.org/search?q=6115012DEA3026F62A98A556D6B570842F7E7F8D">keys.openpgp.org</a>)，其所使用的密鑰指紋為 <b>6115 012D EA30 26F6 2A98 A556 D6B5 7084 2F7E 7F8D</b>。

source: GSoC 2018: GNUnet WebUI (GNUnet Web-based User Interface)
zh_hant: GSoC 2018: GNUnet WebUI （基於GNUnet Web的使用者介面）

source: Tue, 08/14/2018 - 07:55, Phil Buschmann
zh_hant: 週二，08/14/2018-07:55，Phil Buschmann

source: In the context of Google Summer of Code 2018, my mentor (Martin Schanzenbach) and I have worked on creating and extending the REST API of GNUnet. Currently, we mirrored the functionality of following commands:
zh_hant: 於 Google Summer of Code 2018，我的導師 (Martin Schanzenbach) 和我一直致力於創建和擴展 GNUnet 的 REST API。目前，我們鏡像了下列命令的功能：

source: Additionally, we developed a website with the Javascript framework Angular 6 and the design framework iotaCSS to use the new REST API. The REST API of GNUnet is now documented with Sphinx.
zh_hant: 此外，我們使用 Javascript 框架 Angular 6 和設計框架 iotaCSS 開發了一個網站，以使用新的 REST API。GNUnet 的 REST API 現在使用 Sphinx 來做記載。

source: ... when you can use the command line tools? We need to keep in mind, that everyone has the right to stay secure and private but not everyone feels comfortable using a terminal. The further developed REST access to GNUnet APIs in addition to the new web application allows new users to interact with GNUnet over a well known tool: their browsers. This addition to the C API and the command line tools may attract new users and developers.
zh_hant: ... 什麼時候可以使用命令行工具？我們需要記得，每個人都有權保持安全和私密，但並不是每個人都對使用終端機感到自在。除了新的 Web 應用程式之外，對 GNUnet API 的進一步開發的 REST 訪問允許新用戶通過一個眾所周知的工具與 GNUnet 互動：他們的瀏覽器。C API 和命令行工具的這一新增功能可能可以吸引新用戶和開發人員。

source: <li> The REST API developed in GNUnet<br> The REST API is already merged into the gnunet.git repository (<a href="https://gnunet.org/git/gnunet.git/">GNUnet Main Git</a>).<br /> To use the new features, clone the repository and follow the <a href="https://gnunet.org/en/install.html">Installation</a> on gnunet.org. Then, start the rest service with "gnunet-arm -i rest". </li> <li> The Web Application<br> The web application is available under the gnunet-webui.git repository (<a href="https://gnunet.org/git/gnunet-webui.git/">GNUnet WebUI Git</a>).<br /> You need to install the newest version of 'node' and 'yarn'. Dependent on your system, you may need to download newer versions and install them manually and not over your packet manager. After the installation succeeded, you need to clone the repository. Then, you need to run "yarn install" and "yarn start" for testing purposes. To deploy the website (keep in mind, that this website communicates with another localhost instance) use "yarn build" for building the web application and use the output in the 'dist' directory. </li> <li> The Documentation<br /> The documentation is available under the gnunet-rest-api.git repository (<a href="https://gnunet.org/git/gnunet-rest-api.git/">GNUnet REST API Docmentation Git</a>).<br /> Clone the repository and "make html". Then open the 'index.html' under 'build/html/'. </li>
zh_hant: <li> 在 GNUnet 中開發的 REST API<br> REST API 已合併到 gnunet.git 存儲庫中 (<a href="https://gnunet.org/git/gnunet.git/">GNUnet Main Git</a>)。<br /> 若要使用新功能，請複製存儲庫並按照 gnunet.org 上的<a href="https://gnunet.org/en/install.html">安裝</a> 進行操作。接下來，使用 "gnunet-arm -i rest" 啟動 rest service。</li> <li> 網路應用程式 (The Web Application)<br> 網路應用程序位於 gnunet-webui.git 儲存庫下 (<a href="https://gnunet.org/git/gnunet-webui.git/">GNUnet WebUI Git</a>)。<br /> 您需要安裝最新版本的 "節點 (node)" 和 "紗線 (yarn)"。根據您的系統，您可能需要下載更新版本並手動安裝它們，而不是通過您的 packet manager。安裝成功後，您需要複製儲存庫。接下來，您需要運行 "yarn install" 和 "yarn start" 以進行測試。使用 "yarn build" 來構建網路應用程式並使用 "dist" 目錄中的輸出以部署網站（請記住，該網站與另一個本地主機實例通信）。</li> <li> 文件<br /> 該文件位於 gnunet-rest-api.git 儲存庫下 (<a href="https://gnunet.org/git/gnunet-rest-api.git/">GNUnet REST API Docmentation Git</a>).<br /> 複製儲存庫 "make html". 接著開啟'build/html/' 之下的 'index.html'。</li>

source: Please, give it a try and contact me, if you find any bugs or unintentional features. ;)
zh_hant: 如果發現任何錯誤或意外功能，請您嘗試並與我聯繫。;)

source: Right now, the build process of the web application may be a little too complex for a casual user. We may be able to solve this by using docker.<br /> Additionally, the web application does not prevent wrong inputs but responds with error messages. Adding GNUnet Records is currently only usable for people, who know how a GNS Record looks like. This can be adapted to each record type.<br /> Last but not least, additional features, design changes, etc...
zh_hant: 網頁應用程式目前的構建過程對於普通用戶來說可能稍嫌複雜。我們或許可以通過使用 docker 來解決這個問題。<br />此外，網路應用程式不會阻止錯誤輸入，而是以錯誤訊息的方式進行回應。添加 GNUnet 記錄目前僅適用於了解 GNS 記錄外觀的人。而這可以適應各種記錄類型。<br />最後，附加功能、設計更改等...

source: Thanks for reading.
zh_hant: 謝謝閱讀。

source: GNUnet's Google Summer of Code projects
zh_hant: GNUnet 的 Google Summer of Code 項目

source: Ideas 2021
zh_hant: 2021年的想法

source: Past projects
zh_hant: 過去的項目

source: Finished projects
zh_hant: 已完成的項目

source: As a GNU project, GNUnet has participated in the Google Summer of Code (GSoC) for a number of years. This page lists all current, past, and finished projects. If you want to participate and apply for any of the ideas for 2020 below or any past project which is not yet finished (or even your own idea), please contact us on the mailing list.
zh_hant: 作為一個 GNU計畫，GNUnet 多年來持續參與 Google Summer of Code (GSoC)。此頁面列出了所有目前、過去和已完成的項目。如果您想參與並申請以下 2020年的任何計畫或任何尚未完成的過去項目（甚至您自己的計劃），請通過郵件列表與我們聯繫。

source: The GNUnet team is currently working on a transport layer rewrite in order to fix core issues with connectivity. This new component is currently developed under the name "TNG". What is currently known as "transport plugins" will in the TNG be represented as "communicators". Communicators are processes with a well defined API that allow to connect peers over a specific protocol. The primary protocol which are already implemented are UNIX sockets, UDP sockets, and TCP sockets. For a truly resilient network, other connectivity options such as WiFi mesh, Bluetooth, HTTP(S), QUIC or even more obscure alternatives such as radio are required. In this project, the goal is to select, implement and test new communicators. While TNG is not yet ready, communicators can, by design, be developed and tested against the current API. We expect that this project can be worked on by multiple students as there are a lot of protocols to choose from. The tasks would consist of: <ol> <li>Deciding which communicators to implement.</li> <li>Test the communicators.</li> <li>Documentation.</li> </ol> Advantageous skills/languages/frameworks: <ol> <li>C</li> <li>Knowledge of HTTPS, QUIC, Bluetooth or WiFi.</li> </ol> <br/> <strong>Difficulty:</strong> Average, but depends on selected protocols. <br/> <strong>Mentors:</strong> Martin Schanzenbach, t3sserakt
zh_hant: GNUnet 團隊目前正在重寫傳輸層，以解決連接性的核心問題。這個新組件目前以 "TNG" 的名稱開發。目前所謂的 "傳輸插件 (transport plugins)" 在 TNG 中將被表示為 "通信器 (communicators)"。通信器為具有明確定義的 API 的流程，允許透過特定協議連接對等點。已經實現的主要協議為 UNIX sockets、UDP sockets 和 TCP sockets。對於真正有彈性的網路，還需要其他連接選項，例如 WiFi 網狀網路 (WiFi mesh)、藍牙 (Bluetooth)、HTTP(S)、QUIC 或甚至更模糊的替代方案，例如無線電。在這個專案中，其目標是選擇、實施和測試新的通信器。雖然 TNG 尚未準備就緒，但根據設計，可以開發和測試針對當前 API 的通信器。由於有很多協議可供選擇，我們期望這個項目可以由多個學生進行。任務包括：<ol><li>決定實施哪些通信器。</li><li>測試通信器。</li><li>文件。</li></ol> 優勢技能/語言/框架：<ol><li>C</li><li>HTTPS、QUIC、藍牙或 WiFi的知識。</li></ol><br/><strong>難易程度：</strong> 中等， 但取決於選定的協議。 <br/><strong>導師：</strong> Martin Schanzenbach, t3sserakt

source: The REST API currently only supports a single user system. This is an issue as on multi-user systems, access control must be enfoced on a per-user basis. In this project, the REST service must be extended to support user authentication. This includes the correct handling of user context switches. <ol> <li>Implement user authentication.</li> <li>Test the access control.</li> <li>Document the changes to the REST API.</li> </ol> Advantageous skills/languages/frameworks: <ol> <li>C</li> <li>Knowledge of user authentication subsystems on Linux/Unix.</li> <li>REST/HTTP Authentication methods</li> </ol> <br/> <strong>Difficulty:</strong> Beginner <br/> <strong>Mentors:</strong> Martin Schanzenbach
zh_hant: REST API 目前僅支持單用戶系統 (single user system)。由於在多用戶系統上，必須對每個用戶實施訪問控制，這成為了一個問題。在這個計劃中，必須擴展REST服務以支持用戶身份驗證。這包含正確地處理用戶的上下文交換 (context switching)。<ol>。<li>實現用戶認證。</li>。<li>測試存取控制。</li>。<li>記錄對 REST API 的更改。</li>。</ol>優勢技能/語言/框架：<ol>。<li>C</li>。<li>了解 Linux/Unix 上的用戶身份驗證子系統。</li>。<li>REST/HTTP 身份驗證方法</li>。</ol>。<br/>。<strong>困難程度：</strong> 初學者<br/>。<strong>導師：</strong> Martin Schanzenbach

source: reclaimID is a decentralized identity system build on top of the GNU Name System. Currently, there is a Webextension which uses the GNUnet <a href="https://rest.gnunet.org">REST API</a>. In order to improve adoption and ease of use, this project aims to include a full GNUnet node within the Webextention as a fallback. GNUnet can be compiled to Web Assembly or JavaScript as demonstrated <a href="https://gnunet.io">here</a>. The idea is to improve upon this concept and support more of GNUnet's subsystems. The difficulty of this project largely depends on the students proficiency with build tools, emscripten and improvisation skills. There non-exhaustive task list would be: <ol> <li>Improve existing GNUnet emscripten build to include more subsystems.</li> <li>Integrate the result into a Webextention.</li> <li>Integrate the result into the re:claimID Webextension</li> </ol> Advantageous skills/languages/frameworks: <ol> <li>C</li> <li>emscripten</li> <li>Webextensions</li> </ol> <br/> <strong>Difficulty:</strong> Challenging <br/> <strong>Mentors:</strong> Martin Schanzenbach
zh_hant: reclaimID 是一個建立在 GNU 名稱系統之上的去中心化身份系統。目前，有一個使用 GNUnet <a href="https://rest.gnunet.org">REST API</a> 的 Webextension。為了提高採用率和易用性，該項目旨在在 Webextention 中包含一個完整的 GNUnet 節點作為後備。GNUnet 可以編譯為 Web Assembly 或 JavaScript，如<a href="https://gnunet.io">此處</a>所示。這個想法是為了改進這個概念並支持更多的 GNUnet 子系統。該項目的難易度在很大程度上取決於學生對構建工具、emscripten 和 improvisation skills 的熟練程度。詳盡的任務清單為：<ol><li>改進現有的 GNUnet emscripten 構建以包含更多子系統。</li><li>將結果整合到 Webextention 中。</li><li>將結果整合到 re:claimID Webextension中</li></ol> 優勢技能/語言/框架：<ol><li>C</li><li>emscripten</li><li>Webextensions</li></ol><br/><strong>難易程度：</strong> 困難<br/><strong>導師：</strong> Martin Schanzenbach

source: Currently, the keys in our statistics database are too verbose. For example: </p> <p> nse # flood messages received: 13<br/> nse # peers connected: 4<br/> nse # nodes in the network (estimate): 203<br/> nse # flood messages started: 5<br/> nse # estimated network diameter: 3<br/> nse # flood messages transmitted: 10<br/> </p> <p> With such verbose keys there's no easy way to form compact JSON document or entries for time-series database. And you can't query single stats without having to copypaste the line exactly and put in quotes. In short, the goals are to... <ol> <li>Think of a way how statistics entries can be made canonical.</li> <li>Implement the change and migrate existing uses.</li> <li>Document the format(s) and define an appropriate registration mechanism for identifiers</li> </ol> Relevant bugs: <a href="https://bugs.gnunet.org/view.php?id=5650">#5650</a><br/> Advantageous skills/languages/frameworks: <ol> <li>C</li> <li>HTML</li> </ol> <br/> <strong>Difficulty:</strong> Beginner <br/> <strong>Mentors:</strong> Martin Schanzenbach
zh_hant: 目前，我們統計資料庫中的keys過於冗長。舉例來說：</p> <p> nse # flood messages received: 13<br/> nse # peers connected: 4<br/> nse # nodes in the network (estimate): 203<br/> nse # flood messages started: 5<br/> nse # estimated network diameter: 3<br/> nse # flood messages transmitted: 10<br/> </p> <p> 若使用如此冗長的keys，將沒有簡單的方法可以為時間序列資料庫形成緊密的JSON 文檔或條目。並且您無法不透過"準確地複製貼上文句、並加上引號"來查詢單個統計資料。簡而言之，目標是...<ol> <li>思考如何使統計條目正準化(canonical)。</li> <li>實施變更並轉移現有用法。</li> <li>記錄格式並為識別符(identifiers)定義適當的註冊機制</li> </ol>相關的bugs: <a href="https://bugs.gnunet.org/view.php?id=5650">#5650</a><br/> 優勢技能/語言/框架：<ol> <li>C</li> <li>HTML</li> </ol> <br/> <strong> 困難程度：</strong>初學者<br/> <strong>導師：</strong> Martin Schanzenbach
