Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: Unlike BitCoin or cash payments, Taler ensures that governments can learn their citizen's total income and thus collect sales, value-added or income taxes. Taler is thus a currency for the mainstream economy, and not the black market.
fr: Contrairement à BitCoin ou les paiements en liquide, Taler permet aux gouvernements de tracer facilement les revenus de leurs citoyens et donc de collecter les ventes, les plus values ou les impots sur le revenu. Taler est donc une devise pour l'économie dominante officielle et non pour le marché noir.
it: A differenza di BitCoin o del pagamento in contanti, Taler assicura che i govrni possano facilmente tracciare il reddito dei loro cittadini e di conseguenza riscuotere vendite, IVA o tasse. Taler è quindi una valuta per un'economia tradizionale, e non per il mercato nero.

source: Anonymous
fr: Anonyme
it: Anonimo

source: When you pay with Taler, your identity does not have to be revealed to the merchant. The bank, government and exchange will also never learn how you spent your electronic money. However, you can prove that you paid in court if necessary.
fr: Quand vous payez avec Taler, votre identité ne doit pas être révélée au commerçant. La banque, le gouvernement et le bureau de change ne sauront pas non plus comment vous avez dépensé votre monnaie électronique. Cependant, vous pouvez prouver que vous avez payé par voie légale si nécessaire.
it: Quando paghi usando Taler, la tua identità non deve essere rivelata al venditore. Anche la banca, il governo e la ufficio cambi non sapranno come spendi i tuoi soldi elettronici. Comunque, se necessario, è possibile dimostrante durante un processo di aver pagato.

source: Taler is free software from <a href='http://www.gnu.org/'>GNU</a> implementing an open protocol. Anybody is welcome to inspect our code and integrate our reference implementation into their applications.
fr: Taler est un logiciel libre du <a href='http://www.gnu.org/'>GNU</a> exécutant un protocole ouvert. Vous pouvez tous inspecter notre code et intégrer notre mise en oeuvre de référence dans vos applications.

source: Electronic
fr: Électronique
it: Elettronico

source: Taler is designed to work on the Internet. Using a so-called RESTful protocol over HTTP or HTTPS, Taler is easy to integrate with existing Web applications.
fr: Taler est conçu pour fonctionner sur Internet. En utilisant le protocole RESTful sur HTTP ou HTTPS, Taler est facile à intégrer avec des application Web existantes..
it: Taler è progettato per funzionare su Internet. Usando un cosiddetto protocollo RESTful su HTTP o HTTPS, Taler è facile da integrare con applicazioni web già esistenti.

source: Reserves
fr: Réserve
it: Riserva

source: Taler uses an electronic exchange holding financial reserves in existing currencies. This means that Taler is not a new currency with the inherent currency fluctuation risks, but instead the cryptographic coins correspond to existing currencies, such as US Dollars, Euros or even BitCoins.
fr: Taler fonctionne comme une trésorerie. Cela signifie que Taler n'est pas une nouvelle devise avec les risques inhérents aux fluctuations monétaires, mais la monnaie digitale équivaut plutot aux monnaies existantes, comme le dollar Américain, l'Euro ou même le BitCoin.
it: E' importante notare che Taler non è una nuova valuta, allontanandosi dunque da tutti i rischi di fluttuazione che questo comporterebbe. La sua ufficio cambi funziona come una riserva, ossia un tramite che fa corrispondere gettoni criptati a vere valute come Euro, Dollaro Americano o anche Bitcoin.

source: More news »
fr: En savoir plus »
it: Scopri di più »

source: Taler technology: About taxability, change and privacy
fr: La technologie de Taler: Taxabilité, rendu de monnaie et vie privée
it: La tecnologia Taler: tassabilità, cambio e privacy

source: One of the key goals of Taler is to provide anonymity for citizens buying goods and services, while ensuring that the state can observe incoming transactions to ensure businesses engage only in legal activities and do not evade taxes (such as income tax, sales tax or value-added tax). However, we also want to stay out of the immediate personal domain, so sharing funds within a family or copying coins between devices should not be subject to monitoring by the state.
fr: Un des buts principaux de Taler est de fournir de l'anonymité pour les citoyens achetans des biens et des services, tout en s'assurant que l'état peut observer les transactions entrantes pour s'assurer que les activitées des entreprises soient légales et qu'elle payent leur taxes. Néanmoins, nous voulons aussi rester à l'écart du domaine personel. L'échange de fonds dans le domaine familial et la copie de pièces entre plusieurs dispositif ne devrais pas être assijeti à une surveillance étatique.
it: Uno dei principali obbiettivi di Taler è quello di fornire anonimato ai cittadini nel momento in cui questi effettuano acquisti di beni e servizi. Allo stesso tempo, si vuole dare allo Stato uno strumento che sia in grado di prevenire evasione fiscale (salvaguardando, ad esempio, IVA e imposta sul reddito) e attività illegali. Ad ogni modo, Taler non vuole intervenire nelle relazioni interpersonali, cosicché la condivisione di fondi tra membri di una famiglia o la copia di gettoni tra più dispositivi non sarà soggetta a monitoraggio statale.

source: As a result, Taler does not intrude into the personal economic domain, offers good privacy, taxability for transactions and the ability to give change.
fr: En conséquence, Taler n'envahit pas les finances personelles, protège la vie privée, offre une taxabilité des transactions et la possibilité de rendre la monnaie.
it: Ne deriva che Taler non entra nella gestione economica personale, offre privacy affidabile, tassabilità per le transazioni e la possibilità di dare il cambio

source: Taler uses efficient cryptographic primitives (such as RSA 2048 and EdDSA) and is thus expected to be able to handle large transaction volumes, only limited by the input/output capabilities of the database. Thus, running a Taler exchange should be profitable even with very low (less than 1 cent) transaction fees (at appropriate transaction volume).
fr: Taler utilise des cryptographes primaires efficaces (comme RSA 2048 et EdDSA) et doit être capable de gérer des volumes de transaction importants, seulement limités par les capacités entrée/sortie de la base de donnée.
it: Taler utilizza efficienti algoritmi crittografici di base (come RSA 2048 e EdDSA) e quindi dovrebbe essere in grado di gestire transazioni di grande volume, limitato solamente dalle capacità di input/output del database. Quindi, usare un conio di Taler dovrebbe essere redditizio anche con un prezzo di transazione molto basso (meno di 1 cent) in relazione al volume di transazione appropriato.

source: All transactions in Taler are secured using modern cryptography and trust in all parties is minimized. Financial damage is bounded (for customers, merchants and the exchange) even in the case that systems are compromised and private keys are stolen. Databases can be audited for consistency, resulting in either the detection of compromised systems or the demonstration that participants were honest.
fr: Toutes les transactions dans Taler sont sécurisées en utilisant la cryptographie moderne et la confiance dans tous les acteurs est minimisée. Les pertes financières sont limitées (pour les clients, les commerçants et la banque) même dans le cas ou le système est compromis ou si les clés privées sont volées. Les bases de données peuvent être auditées sur leur régularité, avec pour résultat soit la détection de systèmes compromis ou faisant la démonstration que les participants sont honnêtes.
it: Tutte le transazioni in Taler sono rese sicure usando la moderna crittografia e la fiducia in tutte le varie parti coinvolte è tenuta al minimo. Il danno finanziario è limitato (sia per il cliente, il mercante e la valuta) and in caso il sistema venisse compromesso e le chiavi private rubate. I database possono essere controllati per coerenza, facendo sì che vengano evidenziate sia la scoperta di sistemi compromessi, sia la dimostrazione che i partecipanti sono stati onesti.

source: The basic business model for Taler is the operation of an exchange. An exchange converts money from traditional payment systems (Mastercard, SEPA, Visa, BitCoin, ACH, SWIFT, etc.) to anonymous electronic coins in the same currency. The customer can then redeem the electronic coins at a merchant, who can exchange them for money represented using traditional payment systems at the exchange. The exchange can then charge fees (to the customer, merchant or both) to facilitate the transactions.
fr: The business model basique pour Taler est une opération bancaire. Un bureau de change convertie la monnaie d'un système de paiement traditionnel (Mastercard, SEPA, Visa, BitCoin, ACH, SWIFT, etc.) vers une monnaie électronique anonyme dans la même devise. The client peut alors transférer sa monnaie électronique vers un commerçant, qui peut l'échanger contre de la monnaie en utilisant les système de paiement traditionnels à la bureau de change. La bureau de change peut ajouter des frais (au client, commerçant ou au deux) pour faciliter la transaction.
it: Il modello business di base per Taler è l'operazione di un ufficio cambi. La ufficio cambi converte i soldi da un sistema di pagamento tradizionale (Mastercard, SEPA, Visa, BitCoin, ACH, SWIFT, ecc.) a monete elettroniche anonime nella stessa valuta. Il cliente può allora restituire le monete elettroniche ad un mercante, che può scambiarle alla ufficio cambi ccon monete rappresentate dal sistema di pagamento tradizionale. La ufficio cambi può quindi tassare (il cliente, il mercante o entrambi) per facilitare le transazioni.

source: Taler as seen by the exchange operator
fr: Taler du point de vu de l'exploitant
it: Come opera la ufficio cambi di Taler

source: The exchange operator primarily operates a Web service portal and keeps databases with transaction details and cryptographic proofs. Its operational expenses are thus related to its interactions with the banking system and the operation of the computing infrastructure, while its income is based on transaction fees it may charge for the various interactions. Key interactions of the exchange include:
fr: L'exploitant d'un bureau de change opère principalement un un portail de service web et garde une base de donnée des détails des transactions et des preuves cryptographiques. Ses coûts operationels sont donc liés à ses interactions avec le système banquaire et à l'infrastructure informatique, tandis que ses revenus sont basés sur les frais de transaction qu'il peut facurer pour les diverses opérations. Les opérations clées du bureau de change incluent:
it: Chi gestisce la ufficio cambi dovrà offrire un portale Web e mantenere vari database in cui custodire dettagli circa transazioni e certificati criptografici. I suoi costi dipenderanno dunque da quanto e come essa si interfaccerà col sistema bancario, e dalla sua infrastruttura informatica. Dall'altro lato, i suoi guadagni saranno basati sulle tariffe applicate alle varie operazioni offerte. Tali operazioni offerte comprendono:

source: Create a <b>reserve</b> based on an incoming wire transfer from a customer.
fr: Création d'une <b>réserve</b> basé sur un transfère banquaire d'un client.
it: Creazione di una <b>riserva</b> in seguito alla ricezione di un bonifico bancario da parte di un cliente

source: Allow customers to withdraw (and refresh) digital coins from their reserve.
fr: Permetre aux utilisateurs de <b>retirer</b> (et rafraichir) des pièces numériques de leur réserve.
it: Permettere ai clienti di ritirare e cambiare gettoni posseduti con gettoni nuovi (attraverso una operazione chiamata <b>refresh</b>) i gettoni digitali dalla loro riserva.

source: Accept and validate deposits from merchants.
fr: Accepter et valider les dépos de marchands.
it: Accettare e validare depositi di gettoni elettronici da parte dei venditori.

source: Execute wire transfers to merchants in response to validated deposits.
fr: Exection des transfères banquaires vers les marchands en réponse aux dépos validés.
it: Eseguire bonifici verso i conti dei venditori in seguito a depositi (di gettoni elettronici) andati a buon fine

source: Preserve and provide cryptographic proofs of correct operation for audits by financial regulators.
fr: Préserver et fournir les preuves cryptographiques des opérations requises pour les audits pes les authorités financières.
it: Preservare e fornire prove crittografiche delle varie operazioni al fine di permettere controlli da parte di organi finanziari

source: Advantages for merchants
fr: Avantages pour les marchandes
it: Vantaggi per i mercanti

source: Processing transactions with Taler is fast, allowing you to confirm the transaction with your customer virtually immediately. Your customers will appreciate that they do not have to type in credit card information and play the &quot;verified by&quot; game. By making payments significantly more convenient for your customers, you may be able to use Taler for small transactions that would not work with credit card payments due to the mental overhead for customers.
fr: Effectuer des transactions avec Taler est rapide, vous permettant de confirmer la transaction avec votre client virtuellement immédiatement. Vos clients apprécieront de ne pas avoir à donner leurs coordonnées bancaires et d'effectuer le jeu des &quot;vérifié par&quot;. En rendant les paiements significativement plus aisés pour vos clients, vous aurez la possibilité d'utiliser Taler pour de petites transactions qui ne sont pas possibles par carte de crédit pour des raisons culturelles ou sociologiques pour vos clients.
it: L'elaborazione delle transazioni con Taler è veloce, e ti permette di confermare virtualmente la transazione con il tuo cliente immediatamente. Il cliente apprezzerà di non dover inserire informazioni sulla carta di credito e giocare il gioco del &quot;verificato da&quot;. Rendendo i pagamenti significativamente più convenienti per i tuoi clienti, potrai usare Taler per piccole transazioni che non funzionerebbero con pagamenti a carta di credito, a causa del sovraccarico mentale per i clienti.

source: You never learn sensitive customer information. You need to ensure that your website provides the correct account information for your business, and that you correctly validate the payment confirmations from the Taler exchange. As a result, you will have cryptographic proof of payment for the specific contracts you entered with your customers, and cryptographically signed confirmations from the Taler exchange about the deposits. Taler does not require you to undergo any particular security audits, processes or procedures, as you never handle sensitive customer information. Your systems will have cryptographically signed contracts which you can use in court in case of disputes.
fr: Vous n'aurez pas accès aux données sensibles du client. Vous devez vous assurer que votre site internet fournit les informations bancaires correctes pour votre business, et que vous validez correctement les confirmations de paiement à partire de la monnaie Taler. Vous aurez comme résultat une preuve de paiement cryptographiée pour les contrats spécifiques que vous aurez passé avec votre client, et les confirmations signées cryptographiquement par la monnaie Taler concernant les dépots. Taler ne vous oblige pas à suivre des audits, des process ou des vérifications de sécurité particuliers, puisque nous ne détenez aucune donnée sensible du client. Votre système aura signé cryptographiquement des contrats que vous pourrez utiliser en cas de litige auprès d'un tribunal.
it: Non verrai mai a conoscenza di informazioni sensibili sui tuoi clienti. Dovrai assicurare che il tuo sito offra le corrette informazioni account per il tuo business, e che le conferme di pagamento dalla ufficio cambi di Taler vengano correttamente validate. Come risultato, avrai la prova crittografica del pagamento per lo specifico contratto che hai stipulato con i suoi clienti, e conferma crittograticamente firmate dalla ufficio cambi di Taler riguardo ai versamenti. Taler non ti richiede di sottoporti a particolari controlli o prodecure di sicurezza, poiché non dovrai mai gestire informazioni sensibili sui clienti. I tuoi sistemi avranno contratti crittograficamente firmati che potrai usare in tribunale in caso di controversie.

source: Free Software
fr: Logiciel Libre

source: Taler is free software, and you can use the liberally-licensed reference code as a starting point to integrate Taler into your services. To use Taler, you do not need to pay license fees, and the free software development model will ensure that you can select from many competent developers to help you with your integration.
fr: Taler est un logiciel libre, et vous pouvez utiliser un code de réféence licence libre comme point de départ pour intégrer Taler dans vos services. Pour utiliser Taler, vous n'avez pas besoin de payer de licence et le modèle de développement de licence libre vous garanti de pouvoir sélectionner des développeurs compétents pour vous aider dans l'intégration.
it: Taler si basa su un free software, e potrai utilizzare il codice di riferimento sotto licenza libera come punto di partenza per integrare Taler nei tuoi sistemi. Per usare Taler, non servirà pagare i diritti di licenza, e il modello di sviluppo del free software assicurerà che tu possa selezionare molti sviluppatori compententi per aiutarti con l'implementazione.

source: Low Fees
fr: Faible Coût
it: Prezzi bassi

source: Taler is designed to minimize the work the exchange needs to perform. Combined with Taler's strong security which prevents fraud, exchanges can operate with very low overhead and thus low transaction fees. Given Taler's free software exchange reference implementation, competition among exchanges will ensure fair, low transaction fees for merchants.
fr: Taler est construit pour minimiser le temps d'éxécution de la monnaie. Couplé avec le haut système de sécurité de Taler qui permet d'éviter les fraudes, les monnaies génèrent des coûts de gestion et de frais très bas. L'installation via un logiciel libre de la monnaie Taler, la compétition entre monnaies permettra des coûts de transactions honnêtes et faibles pour les commerçants.
it: Taler è progettato per minimizzare il lavoro che la &quot;banca&quot; (exchange) ha necessità di eseguire. Combinate con la forte sicurezza di Taler che previene la frode, le &quot;banche&quot; (exchanges) possono operare con spese molto basse e quindi bassi costi di transazione. Considerata l'implementazione free-software di riferimento della &quot;banca&quot; (exchange) la competizione tra &quot;banche&quot; (exchanges) garantirà costi di transazione giusti e bassi per i mercanti.

source: Taler can be used for different currencies (such as Euros or US Dollars) and different payment models limited only by what the exchange supports in its interactions.
fr: Taler est construit pour minimiser le temps d'éxécution de la monnaie. Couplé avec le haut système de sécurité de Taler qui permet d'éviter les fraudes, les monnaies génèrent des coûts de gestion et de frais très bas. L'installation via un logiciel libre de la monnaie Taler, la compétition entre monnaies permettra des coûts de transactions honnêtes et faibles pour les commerçants.
it: Taler può essere usato per diverse valute (come Euro o dollari americani) e diversi modelli di pagamento limitati solamente da quello che la &quot;banca&quot; (exchange) supporta nelle sue interazioni.

source: Taler does not support tax evasion or money laundering, and is also not a pyramid scheme or speculative investment. Taler's protocols are efficient and do not waste energy. Taler encourages competition by providing an open standard and free software reference implementations.
fr: Taler ne permet pas l'évasion fiscale ou le blanchiment d'argent, et n'est pas non plus un schéma d'investissement pyramidal ou spéculatif. Les protocoles Taler son efficaces et ne gaspillent pas d'énergie. Taler encourage la concurrence en fournissant un standard ouvert et des références d'installations de logiciels libres.
it: Taler non supporta l'evasione fiscale o il riciclaggio di denaro, e non è nemmeno a schema piramidale o un investimento speculativo. I protocolli di Taler sono efficienti e non sprecano energia. Taler incoraggia la competizione fornendo standard aperti e implementazioni di riferimento in free-software.

source: Taler as seen by merchants
fr: Taler du poit de vu des marchants
it: Come i negozianti vedono Taler

source: The customer sends a signed response which states that certain digital coins now belong to the merchant to both signal acceptance of the deal as well as to pay the respective amount (bottom).
fr: Le client envoid une réponse signée qui stipule que certaines pièces numériques apartienent désormais au marchand. Cette signature sert à la fois de payement et de validation du contrat.
it: Il cliente invia una risposta firmata che attesta che un certo numero di gettoni ora appartiene al negoziante, così da segnalare sia l'accettazione dello scambio che il suo impegno a pagare il prezzo dovuto (in basso).

source: The merchant then forwards the signed messages received from the customer to the exchange, together with its wire details and the salt (without hashing). The exchange verifies the details and sends a signed confirmation (or an error message) to the merchant. The merchant checks that the exchange's signature is valid, sends a confirmation to the customer and executes the contract-specific business logic.
fr: Le marchand transfère ensuite le message signé reçu du client au exchange, avec ses détails banquaires et le sel (sans hashage). Le exchange vérifie les détails et envoie une confirmation (ou un message d'erreur). au marchand. Le marchand verifie que la signature du exchange est valide, envoi la confirmation au client et execute le contrat.
it: Il negoziante inoltra tale messaggio firmato appena ricevuto del cliente alla zecca, insieme alle sue coordinata bancarie e al numero casuale usato in precedenza per produrre l'&quot;hash&quot; dei due. La zecca verifica le coordinate e manda una conferma (o un messaggio d'errore) firmata al negoziante. A questo punto, il negoziante controlla che la firma della zecca sia valida, manda una conferma al cliente, e procede ad assolvere quanto indicato nel contratto.

source: The exchange performs wire transfers corresponding to the claims deposited by the merchant. Note that the exchange may charge fees for the deposit operation, hence merchants may impose limits restricting the set of exchange operators they are willing to deal with, for example by imposing a bound on deposit fees.
fr: Le exchange effectue le virement banquaire correspondant au dépos effectué par le marchant. Nottez que le exchange peut charger des frais pour l'opération de dépos, les marchands peuvent donc imposer des restrictions sur les exchanges avec lesquels il acceptent de travailler, par exemple en imposant des limites sur les frais qu'ils acceptent.
it: Per ogni deposito (od opzionalmente per ogni raggruppamento di depositi) ricevuto da un certo negoziante, la zecca procederà con il versamento verso il conto in banca di quest'ultimo. La zecca potrebbe anche prevedere delle tariffe per l'operazione di deposito, da cui è plausibile che alcuni mercanti impongano delle restrizioni su quali siano le zecche con cui essi vogliano trattare.

source: <a href='/'>Home</a>
fr: <a href='/'>Accueil</a>

source: <a href='https://demo.taler.net/' target='_blank'>Demo</a>
fr: <a href='https://demo.taler.net/' target='_blank'>Démo</a>
