Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: We have <a href="https://buildbot.net/">Buildbot</a> automation tests to detect regressions and check for portability at <a href="https://buildbot.taler.net/">buildbot.taler.net</a>.
es: Tenemos <a href="https://buildbot.net/">Buildbot</a> pruebas de automatización para detectar regresiones y comprobar su portabilidad en <a href="https://buildbot.taler.net/"> buildbot .taler.net </a>.

source: We use <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a> to analyze the code coverage of our tests, the results are available at <a href="https://lcov.taler.net/">lcov.taler.net</a>.
es: Usamos <a href="http://ltp.sourceforge.net/coverage/lcov.php">LCOV</a> para el análisis de cobertura de código de nuestros tests, los resultados están disponibles en <a href="https://lcov.taler.net/">lcov.taler.net</a>.

source: We use <a href="https://gnunet.org/gauger">Gauger</a> for performance regression analysis of the exchange backend at <a href="https://gauger.taler.net/">gauger.taler.net</a>.
es: Usamos <a href="https://gnunet.org/gauger">Gauger</a> para el análisis regresivo de rendimiento de backend del proveedor de intercambios en <a href="https://gauger.taler.net/">gauger.taler.net</a>.

source: Taler system overview
de: Das Taler-System im Überblick
es: Diagrama general del sistema Taler
fr: Vue d'ensemble de Taler
it: Schema generale del sistema Taler

source: The Taler system consists of protocols executed among a number of actors as illustrated in the illustration on the right. Typical transactions involve the following steps:
es: El sistema de Taler consiste en protocolos ejecutados entre un número de actores, tal como se ilustra en las imágenes de la derecha. Las transacciones típicas involucran los siguientes pasos:

source: A customer instructs his <b>bank</b> to transfer funds from his account to the Taler exchange (top left). In the subject of the transaction, he includes an authentication token from his electronic <b>wallet</b>. In Taler terminology, the customer creates a reserve at the exchange.
es: Un cliente le instruye a su <b>banco</b> que transfiera fondos desde su cuenta al proveedor de intercambios (arriba a la izquierda). En el asunto de la transacción, el cliente incluye un token de autenticación para su <b>billetera</b> electrónica. En la termonología de Taler, el cliente crea una reserva en el proveedor de intercambios.

source: Once the exchange has received the wire transfer, it allows the customer's electronic wallet to <b>withdraw</b> electronic coins. The electronic coins are digital representations of the original currency from the transfer. It is important to note that the exchange does not learn the &quot;serial numbers&quot; of the coins created in this process, so it cannot tell later which customer purchased what at which merchant. The use of Taler does not change the currency or the total value of the funds (except for fees which the exchange may charge for the service).
es: Una vez que el proveedor de intercambios ha recibido la transferencia bancaria, permite que la billetera electrónica del cliente <b>retire</b> monedas electrónicas. Las monedas electrónicas son representaciones digitales de la moneda original de la transferencia. Es importante observar que el intercambio no memoriza los &quot;números de serie&quot; de las monedas creadas en este proceso, por lo que no podrá decir más adelante qué cliente compró que cosa a cuál comerciante. El uso de Taler no modifica el valor total de la moneda o de los fondos (excepto por los cargos que el intercambio pueda cobrar por el servicio).

source: Once the customer has the digital coins in his wallet, the wallet can be used to <b>spend</b> the coins with merchant portals that support the Taler payment system and accept the respective exchange as a business partner (bottom arrow). This creates a digital contract signed by the customer's coins and the merchant. If necessary, the customer can later use this digitally signed contract in a court of law to prove the exact terms of the contract and that he paid the respective amount. The customer does not learn the banking details of the merchant, and Taler does not require the merchant to learn the identity of the customer. Naturally, the customer can spend any fraction of his digital coins (the system takes care of customers getting change).
es: Una vez que el cliente tiene las monedas electrónicas en su billetera, la billetera se puede utilizar para <b>gastar</b> las monedas con portales comerciales que soportan el sistema de pago de Taler y aceptan el intercambio correspondiente como un socio comercial (flecha inferior). Esto crea un contrato digital firmado por las monedas del cliente y por el comerciante. Si es necesario, el cliente puede utilizar posteriormente este contrato firmado digitalmente en un tribunal para probar las condiciones exactas del contrato y que pagó la cantidad respectiva. El cliente no se entera de los detalles bancarios del comerciante, y Taler no necesita que el comerciante conozca la identidad del cliente. Naturalmente, el cliente puede gastar cualquier fracción de sus monedas electrónicas (el sistema se encarga de que los clientes obtengan su cambio).

source: Merchants receiving digital coins <b>deposit</b> the respective claims that resulted from the contract signing with the customer at the exchange to redeem the coins. The deposit step does not reveal the details of the contract between the customer and the merchant or the identity of the customer to the exchange in any way. However, the exchange does learn the identity of the merchant via the provided bank routing information. The merchant can, for example when compelled by the state for taxation, provide information linking the individual deposit to the respective contract signed by the customer. Thus, the exchange's database allows the state to enforce that merchants pay applicable taxes (and do not engage in illegal contracts).
es: Los comerciantes que reciben monedas electrónicas <b>depositan</b> en el proveedor de intercambios las respectivas concesiones que resultasen de la firma del contrato con el cliente para poder recuperar las monedas. Este depósito no revela al proveedor de intercambios los detalles del contrato entre el cliente y el comerciante o la identidad del cliente de ninguna manera. Sin embargo, el proveedor de intercambios sí conoce la identidad del comerciante a través de la información proporcionada por el enrutamiento bancario. El comerciante puede proveer información que vincule el depósito específico con el respectivo contrato firmado por el cliente, por ejemplo cuando el Estado le impone normas tributarias. Así, la base de datos del proveedor de intercambios permite que el Estado imponga a los comerciantes el pago de los impuestos aplicables (y que éstos no se incurran en contrataciones ilegales).

source: Finally, the exchange transfers funds corresponding to the digital coins redeemed by the merchants to the merchant's <b>bank</b> account. The exchange may combine multiple small transactions into one larger bank transfer. The merchant can query the exchange about the relationship between the bank transfers and the individual claims that were deposited.
es: Finalmente, el proveedor de intercambios transfiere los fondos correspondientes a las monedas electrónicas amortizadas por los comerciantes a la cuenta <b>bancaria</b> del comerciante. El proveedor de intercambios puede combinar múltiples transacciones pequeñas en una transferencia bancaria más grande. El comerciante puede consultar al proveedor de intercambios sobre la relación entre las transferencias bancarias y las concesiones individuales que fueron depositadas.

source: Most importantly, the exchange keeps cryptographic proofs that allow it to demonstrate that it is operating correctly to third parties. The system requires an external <b>auditor</b>, such as a government-appointed financial regulatory body, to frequently verify the exchange's databases and check that its bank balance matches the total value of the remaining coins in circulation.
es: Más importante aún, el proveedor de intercambios mantiene pruebas criptográficas que le permiten demostrar a terceros que está funcionando correctamente. El sistema requiere de un <b>auditor</b> externo, como un organismo regulador financiero nombrado por el gobierno, para verificar continuamente las bases de datos del proveedor de intercambios y verificar que su saldo bancario coincida con el valor total de las monedas que permanecen en circulación.

source: Without the auditor, the exchange operators could embezzle funds they are holding in reserve. Customers and merchants cannot cheat each other or the exchange. If any party's computers are compromised, the financial damage is limited to the respective party and proportional to the funds they have in circulation during the period of the compromise.
es: Sin el auditor, los operadores del proveedor de intercambios podrían desviar fondos que se mantuviesen en reserva. Los clientes y los comerciantes no pueden engañarse mutuamente, o al proveedor de intercambios. Si las computadoras de una de las partes estuviese comprometida, el daño financiero se limitaría a la parte respectiva y sería proporcional a los fondos que tuviese en circulación durante el período en que la computadora estuviese comprometida.

source: How is Taler related to Bitcoin or Blockchains?
de: In welchem Zusammenhang steht Taler mit Bitcoin oder Blockchains?
es: ¿Cómo se relaciona Taler con Bitcoin o Blockchains?

source: <p>Taler does not use any Blockchain technology or Bitcoin directly. Taler is not based on proof-of-work or any other distributed consensus mechanism. Instead Taler is based on blind signatures.</p>
es: <p>Taler no utiliza ninguna tecnología Blockchain o Bitcoin directamente. Taler no se basa en pruebas de autorización ni en ningún otro mecanismo de consenso distribuido. A diferencia de ellos,Taler se basa en firmas ciegas.</p>

source: <p>It would be possible, however, to withdraw coins denominated in Bitcoin into a Taler wallet (with an appropriate exchange), which would give some benefits over plain Bitcoin, such as instant confirmation times.</p>
es: <p>Sin embargo, sería posible retirar las monedas denominadas en Bitcoin en una cartera Taler (con un intercambio apropiado), lo que daría algunas ventajas sobre Bitcoin simple, como por ejemplo, tiempos de confirmación instantánea.</p>

source: Where is the balance in my wallet stored?
de: Wo ist der Münzbestand in meiner Taler-Geldbörse gespeichert?
es: ¿Dónde está almacenado el saldo de mi billetera electrónica?

source: <p>Your wallet stores digital coins and thus ultimately your computer holds your balance. The exchange keeps funds matching all unspent coins in an escrow bank account.</p>
es: <p>Su billetera almacena monedas electrónicas y, por lo tanto, su computadora tiene su saldo. El proveedor de intercambios conserva fondos equivalentes a las monedas no gastadas en una cuenta bancaria de garantía.</p>

source: What if my wallet is lost?
de: Was passiert bei Verlust der Taler-Geldbörse?
es: ¿Qué pasa si mi billetera se pierde?

source: <p>Since the digital coins of value in your wallet are anonymized, the exchange can not assist you in recovering a lost or stolen wallet. Just like with a physical wallet for cash, you are responsible for keeping it safe.</p>
es: <p>Puesto que las monedas electrónicas de valor en su billetera se encuentran anonimizadas, el sistema no puede ayudarle a recuperar una billetera perdida o robada. Al igual que con una billetera física con dinero en efectivo, usted es responsable de velar por su seguridad.</p>

source: <p>The risk of losing a wallet can be mitigated by making backups or keeping the balance reasonably low.</p>
es: <p>El riesgo de perder una billetera puede mitigarse haciendo copias de seguridad o manteniendo el saldo razonablemente bajo.</p>

source: What if my computer is hacked?
de: Was ist, wenn mein Computer gehackt wurde?
es: ¿Qué pasa si mi computadora es hackeada?

source: <p>In case of a compromise of one of your devices, an attacker can spend coins from your wallet. Checking your balance might reveal to you that your device has been compromised.</p>
es: <p>Si uno de sus dispositivos es hackeado, un atacante puede eventualmente gastar monedas de su billetera. La verificación de su saldo puede indicarle que uno de sus dispositivos ha sido comprometido.</p>

source: Can I send money to my friend with Taler?
de: Kann ich mit Taler anderen Personen oder Freunden meine digitalen Münzen senden?
es: ¿Puedo enviar dinero a un amigo con Taler?

source: <p>If your friend provides goods or services for you in exchange for a payment, they can easily set up a Taler merchant and receive the payment in their bank account.</p>
es: <p>Si su amigo le proporciona bienes o servicios a cambio de un pago, puede configurar a su amigo fácilmente como un comerciante Taler y enviarle el pago a su cuenta bancaria.</p>

source: <p>Future versions of the Taler wallet may allow exchanging coins among friends directly as well.</p>
es: <p>Versiones futuras de la billetera Taler pueden permitir también el intercambio de monedas entre amigos directamente.</p>

source: How does Taler handle payments in different currencies?
de: Wie geht Taler um mit digitalen Münzen anderer Währungen?
es: ¿Cómo maneja Taler los pagos en diferentes monedas?

source: <p>Taler wallets can store digital coins corresponding to multiple different currencies such as the Euro, US Dollars or Bitcoins.</p>
es: <p>Las carpetas de Taler pueden almacenar monedas electrónicas correspondientes a monedas diferentes, como Euros, Dólares o Bitcoins.</p>

source: <p>Taler currently does not offer conversion between currencies.</p>
es: <p>Actualmente Taler no ofrece conversiones entre monedas.</p>

source: How does Taler protect my privacy?
de: Wie schützt Taler meine privaten Daten?
es: ¿De qué manera Taler protege mi privacidad?

source: <p>Your wallet stores digital coins that are <a href="https://en.wikipedia.org/wiki/Blind_signature">blindly signed</a> by an exchange. The use of a blind signature protects your privacy as it prevents the exchange from knowing which coin it signed for which customer.</p>
es: <p>Su billetera almacena monedas electrónicas que son <a href="https://en.wikipedia.org/wiki/Blind_signature">firmadas ciegamente</a> mediante un intercambio. El uso de una firma ciega protege su privacidad ya que impide que se conozcan las monedas utilizadas o los clientes involucrados.</p>

source: trusted third party that verifies that the `exchange` is operating correctly
es: tercero de confianza que verifica que el `intercambio` está funcionando correctamente

source: bank
es: banco

source: traditional financial service provider who offers wire `transfers` between accounts
es: proveedor tradicional de servicios financieros que ofrece `transferencias` bancarias entre cuentas

source: coin
es: moneda

source: coins are individual token representing a certain amount of value, also known as the `denomination` of the coin
es: las monedas son fichas individuales que representan una cierta cantidad de valor, también conocida como la `denominación` de la moneda

source: contract
es: contrato

source: the proposal signed by the wallet.
es: la propuesta firmada por la billetera

source: denomination
es: denominación

source: unit of currency, specifies both the currency and the face value of a `coin`
es: unidad de moneda, especifica tanto la divisa como el valor nominal de una `moneda`

source: denomination key
es: Clave de denominación o 'denomination key'

source: RSA key used by the exchange to certify that a given `coin` is valid and of a particular `denomination`
es: Clave RSA utilizada por el proveedor de intercambios de Taler para certificar que una determinada `moneda` es válida y de una determinada `denominación`

source: deposit
es: depósito

source: operation by which a merchant passes coins to an exchange, expecting the exchange to credit his `bank` account in the future using a wire `transfer`
es: Operación por la cual un comerciante pasa las monedas a un proveedor de intercambios, esperando que éste acredite su cuenta del `banco` en el futuro mediante una transferencia bancaria.

source: dirty
es: sucia

source: a `coin` is dirty if its public key may be known to an entity other than the customer, thereby creating the danger of some entity being able to link multiple transactions of coin's owner if the coin is not refreshed first
es: Una `moneda` está sucia si su clave pública pudiese ser conocida por otra entidad aparte del cliente, creando así el peligro de que alguna entidad fuese capaz de vincular múltiples transacciones con el propietario de esa moneda, en caso de que la moneda no hubiera sido previamente actualizada.

source: exchange
es: intercambio

source: Taler's payment service provider. Issues eletronic `coins` during `withdrawal` and redeems them when they are `deposited` by merchants.
es: Proveedor de servicios de pago de Taler. Emite `monedas` electrónicas durante el `retiro` y las recupera cuando son `depositadas` por los comerciantes.

source: extension
es: extensión

source: implementation of a `wallet` for browsers
es: Implementación de una `billetera` para navegadores web

source: fresh coin
es: moneda fresca

source: a `coin` is fresh if its public key is only known to the customer
es: una `moneda` es fresca si su clave pública sólo es conocida por el cliente

source: master key
es: clave maestra o 'master key'

source: offline key used by the exchange to certify denomination keys and message signing keys
es: La clave offline utilizada por el proveedor de intercambios para certificar claves de denominación y claves de firma de mensajes

source: message signing key
es: Clave de firma de mensajes

source: key used by the exchange to sign online messages, other than coins
es: Clave utilizada por el proveedor de intercambios para firmar mensajes en línea, que no sean monedas

source: offer
es: oferta

source: specification of the details of a transaction, specifies the payment obligations for the customer (i.e. the amount), the deliverables of the merchant and other related information, such as deadlines or locations; However, it lacks some information that the backend is supposed to provide. In other words, after the backend adds the missing information to the offer and signs it, it becomes a proposal.
es: la especificación de los detalles de una transacción muestra las obligaciones de pago para el cliente (es decir, el importe), el producto del comerciante y otra información relativa, como plazos o ubicaciones. Sin embargo, carece de información que el backend debería proveer. En otras palabras, una vez que el backend agrega la información que falta a la oferta y la firma, la convierte en una propuesta.

source: owner
es: propiedad

source: a `coin` is owned by the entity that knows the private key of the coin
es: una `moneda` es propiedad de la entidad que conoce la clave privada de la moneda.

source: proof
es: prueba

source: message that cryptographically demonstrates that a particular claim is correct
es: mensaje que demuestra criptográficamente que una concesión es correcta

source: proposal
es: propuesta

source: a sketch that has been completed and signed by the merchant backend.
es: un boceto que ha sido completado y firmado por el backend del comerciante.

source: reserve
es: reserva

source: funds set aside for future use; either the balance of a customer at the exchange ready for `withdrawal`, or the funds kept in the exchange's bank account to cover obligations from coins in circulation
es: Fondos reservados para uso futuro; ya sea el saldo de un cliente en el proveedor de intercambios listo para un «retiro», o los fondos previstos en la cuenta bancaria para cubrir las obligaciones de las monedas en circulación

source: refreshing
es: refrescar o `refreshing`

source: operation by which a `dirty` `coin` is converted into one or more `fresh` coins
es: Operación mediante la cual se convierte una `moneda` `sucia` en una o más monedas `frescas`

source: refund
es: reembolso

source: operation by which a merchant steps back from the right to funds that he obtained from a `deposit` operation, giving the right to the funds back to the customer
es: operación por la cual un comerciante rechaza el derecho a los fondos que obtuvo de una operación de `depósito ', dando nuevamente al cliente el derecho a estos fondos

source: sharing
es: compartir

source: users can share ownership of a `coin` by sharing access to the coin's private key, thereby allowing all co-owners to spend the coin at any time.
es: los usuarios pueden compartir la propiedad de una `moneda` compartiendo el acceso a la clave privada de la moneda, lo que permite a todos los copropietarios a gastar la moneda en cualquier momento.

source: signing key
es: clave de firmado

source: see message signing key.
es: ver clave de firma de mensajes

source: spending
es: gasto

source: operation by which a customer gives a merchant the right to `deposit` coins in return for merchandise
es: operación mediante la cual un cliente concede a un comerciante el derecho de `depositar` monedas a cambio de mercancía

source: transfer
es: transferencia

source: method of sending funds between `bank` accounts
es: método de envío de fondos entre cuentas `bancarias`

source: transaction
es: transacción

source: method by which ownership is exclusively transferred from one entity to another
es: método mediante el cual la propiedad se transfiere exclusivamente de una entidad a otra

source: transaction id
es: identificador de la transacción o `transaction id`

source: unique number by which a merchant identifies a `transaction`
es: número único por el cual un comerciante identifica una `transacción`

source: wallet
es: billetera

source: software running on a customer's computer; withdraws, stores and spends coins
es: software que opera en la computadora de un cliente; que retira, almacena y gasta monedas

source: wire transfer
es: transferencia electrónica

source: see `transfer`
es: ver 'transferencia'

source: wire transfer identifier
es: identificador de transferencias electrónicas

source: subject of a wire `transfer`; usually a random string to uniquely identify the `transfer`
es: asunto de una `transferencia` electrónica; generalmente una serie aleatoria para identificar de forma única la `transferencia`

source: withdrawal
es: retiro

source: operation by which a `wallet` can convert funds from a reserve to fresh coins
es: operación mediante la cual una `billetera` puede convertir fondos de una reserva en monedas nuevas

source: Advantages for Governments
de: Vorteile für Staatsregierungen
es: Ventajas para los gobiernos

source: Taler provides accountability to ensure business operate legally, while also respecting civil liberties of citizens. Taler is a payment system based on open standards and free software. Taler needs governments as they set a financial framework and act as trusted regulators. Taler contributes to digital sovereignty in the critical financial infrastructure.
es: Taler asegura que los negocios participantes operen legalmente, respetando las libertades civiles de los ciudadanos. Taler es un sistema de pago basado en estándares abiertos y de software libre. Taler necesita trabajar junto con los gobiernos en la medida que establecen un marco financiero y actúan como reguladores de confianza. Taler contribuye a la soberanía digital en la infraestructura financiera crítica.

source: Taxable
de: Besteuerbar
es: Imponible
it: Tassabile
