Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: We use <a href='http://ltp.sourceforge.net/coverage/lcov.php'>LCOV</a> to analyze the code coverage of our tests, the results are available at <a href='https://lcov.taler.net/'>lcov.taler.net</a>.
fr: <a href='http://ltp.sourceforge.net/coverage/lcov.php'>LCOV</a> est utilisé pour analyser la couverture du code par nos tests. Les résultats sont disponibles à <a href='https://lcov.taler.net/'>lcov.taler.net</a>.
it: I test effettuati sul software Taler subiscono la misurazione della loro 'copertura' da <a href='http://ltp.sourceforge.net/coverage/lcov.php'>LCOV</a>; inoltre, tali risultati sono disponibili alla pagina <a href='https://lcov.taler.net/'>lcov.taler.net</a>.

source: We use <a href='https://gnunet.org/gauger'>Gauger</a> for performance regression analysis of the exchange backend at <a href='https://gauger.taler.net/'>gauger.taler.net</a>.
fr: Nous utilisons <a href='https://gnunet.org/gauger'>Gauger</a> pour une analyse des régression de performances du bureau de change, la parie serveur de Taler. les résultats sont disponibles à <a href='https://gauger.taler.net/'>gauger.taler.net</a>.
it: Le prestazioni della ufficio cambi sono misurate attraverso <a href='https://gnunet.org/gauger'>Gauger</a>, e i risultati disponibili alla pagina <a href='https://gauger.taler.net/'>gauger.taler.net</a>.

source: The Taler system consists of protocols executed among a number of actors with the help of <a href='https://www.fsf.org/'>Free Software</a> as illustrated in the illustration on the right. Typical transactions involve the following steps:
fr: Le system de Taler consiste de protocols exécutés entre plusieurs acteurs à l'aide de <a href='https://www.fsf.org/'>Logiciel Libre</a>. Une transaction typique comporte les étapes suivantes :
it: Taler usa <a href='https://www.fsf.org/'>software libero</a> per realizzare i protocolli finalizzati alla comunicazione tra i vari partecipanti come illustrato nella figura a destra. La tipica transazione nel modello Taler si compone dei seguenti passaggi:

source: A customer instructs his <b>bank</b> to transfer funds from his account to the Taler exchange (top left). In the subject of the transaction, he includes an authentication token from his electronic <b>wallet</b>. In Taler terminology, the customer creates a reserve at the exchange.
fr: Un client demande à sa <b>banque</b> de transfèrer des fonds de son compte en banque vers le bureau de change de Taler (en haut à gauche). Dans le sujet de la transaction, est inclus un jeton d'authentification du <b>porte-monnaie</b> électronique du client. Dans la terminologie de Taler, le client crée une réserve dans le bureau de change.
it: Un cliente chiede alla sua <b>banca</b> di trasferire fondi dal suo conto a quello della ufficio cambi Taler (in alto a destra). La causale di questo trasferimento includerà l'informazione necessaria, generata dal portafoglio elettronico (<b>wallet</b>) compatibile col sistema Taler, ad autenticare il cliente alla ufficio cambi (nota anche come &quot;exchange&quot;). Nella terminologia adeguata, si dirà che il cliente ha creato una riserva.

source: Once the exchange has received the transfer, it allows the customer's electronic wallet to <b>withdraw</b> electronic coins. The electronic coins are digital representations of the original currency from the transfer. It is important to note that the exchange does not learn the &quot;serial numbers&quot; of the coins created in this process, so it cannot tell later which customer purchased what at which merchant. The use of Taler does not change the currency or the total value of the funds (except for fees which the exchange may charge for the service).
fr: Une fois que le bureau de change a reçu le transfère, il permets au porte-monnaie électronique du client de <b>retirer</b> des pièces électroniques. Les pièces électroniques sont des représentations numériques des devises transfèrées initialement. Il est important de noter que le bureau de change ne connait pas le &quot;numéro de serie&quot; des pièces ainsi crées, il luis sera donc impossible de savoir quel client a payer un marchant. L'utilisation de Taler ne change pas la devise ni la valeur totale des fonds (à l'exeption des frais que le bureau de change peut prendre comme son service).
it: In seguito alla ricezione del trasferimento da parte della ufficio cambi, il cliente potrà <b>ritirare</b> i suoi gettoni elettronici. Tali gettoni sono rappresentazioni digitali dell'ammonto che il cliente ha trasferitto alla ufficio cambi. E' fondamentale notare che in questo processo la ufficio cambi non apprende nessun &quot;numero seriale&quot; dei gettoni coinvolti, in modo tale da non poter a posteriori associare un certo cliente ad un certo acquisto. Taler non interferisce dunque né con la valuta né con l'ammonto presente nella riserva. L'unica modifca apportata da Taler alla riserva è la sottrazione da questa della tariffa del servizio.

source: Once the customer has the digital coins in his wallet, the wallet can be used to <b>spend</b> the coins with merchant portals that support the Taler payment system and accept the respective exchange as a business partner (bottom arrow). This creates a digital contract signed by the customer's coins and the merchant. If necessary, the customer can later use this digitally signed contract in a court of law to prove the exact terms of the contract and that he paid the respective amount. The customer does not learn the banking details of the merchant, and Taler does not require the merchant to learn the identity of the customer. Naturally, the customer can spend any fraction of his digital coins (the system takes care of customers getting change).
fr: Une fois que le client a les pièces dans sont porte-monnaie, celui-ci peut être utilisé pour <b>dépenser</b> les pièces avec un portail marchand qui supporte Taler comme systeme de payement et accepte le bureau de change comme partenaire commercial (flèche du bas). Celà crée un contract signé numériquement par le marchant et les pièces du client. Si celà s'avère nécéssaire, le client peut ensuite utiliser ce contract signé numériquement face au tribunaux pour prouver les termes exacts du contract et qu'il à payé le montant convenu. Le client n'a pas connaissance des coordonées banquaires du marchant, et Taler ne requière pas que le marchant ai connaissance de l'identité du client. Naturellement, le client peut dépenser seulement une partie de chaque pièce (le système se chargant de rendre la monnaie).
it: Con i gettoni elettronici nel portafogli, il cliente può <b>spendere</b> presso tutti i venditori che accettano Taler tra i loro sistemi di pagamento, e che sono disponibili a finalizzare l'operazione con la stessa ufficio cambi che ha dato i gettoni al cliente (freccia in basso). Tecnicamente, ciò comporta la creazione di un certificato firmato d'ambo le parti: dal venditore e dalla chiave corrispondente al gettone speso (vale la pena notare che un gettone, altro non è, che una coppia di chiavi pubblica e privata). Assumendo che i tribunali accettino firme elettroniche, un cliente può utilizzare tale certificato per mostrare i suoi termini esatti e che egli ha pagato la somma dovuta. Ancora, il cliente non viene mai a conoscenza degli estremi bancari del negoziante e, allo stesso modo, Taler non richiede che il negoziante debba conoscere l'identità del cliente. Naturalmente, il cliente può anche spendere una frazione di uno dei suoi gettoni, grazie alla facoltà che Taler ha di restituire il cambio.

source: Merchants receiving digital coins <b>deposit</b> the respective receipts that resulted from the contract signing with the customer at the exchange to redeem the coins. The deposit step does not reveal the details of the contract between the customer and the merchant or the identity of the customer to the exchange in any way. However, the exchange does learn the identity of the merchant via the provided bank routing information. The merchant can, for example when compelled by the state for taxation, provide information linking the individual deposit to the respective contract signed by the customer. Thus, the exchange's database allows the state to enforce that merchants pay applicable taxes (and do not engage in illegal contracts).
fr: Les marchands recevant des pièces numériques les <b>déposent</b>, avec les reçus résultants des signatures du contract avec le client, auprès du bureau de change pour récupérer les pièces. L'étape de dépos ne révèle pas les détails du contract entre le client et le marchant ou l'identité du client au bureau de change de quelque façon que ce soit. Néanmoins, le bureau de change prends connaissance de l'identité du marchant grace au coordonées banquaires fournies pour le virement. Le marchant peut ensuite, par exemple lorsque l'état lui demande pour établire les taxes, fournir des informations reliant chaque dépos à son contrat spécifique, signé par le client. Ainsi La base de donnée du bureau de change permet à l'état de s'assurer que les marchants payent les taxes appliables (et ne s'engagent pas dans des activités illégales).
it: Contemporaneamente alla firma dei contratti viene creata una ricevuta che il negoziante può <b>depositare</b> alla ufficio cambi al fine di riavere indietro il corrispettivo in denaro del gettone che ha ricevuto dal cliente. Il deposito non mette la ufficio cambi nelle condizioni di apprendere i dettagli del contratto tra il negoziante e il cliente, né l'identità stessa del cliente. Ad ogni modo, la ufficio cambi potrà (e dovrà) conoscere l'identità del negoziante, dal momento che essa necessità dei suoi estremi bancari necessari a finalizzare il processo.

source: Finally, the exchange transfers funds corresponding to the digital coins redeemed by the merchants to the merchant's <b>bank</b> account. The exchange may combine multiple small transactions into one larger bank transfer. The merchant can query the exchange about the relationship between the bank transfers and the individual claims that were deposited.
fr: Finalement, le bureau de change transfère les fonds correspondants aux pièces déposées par le marchant sur le compte en <b>banque</b> du marchant. Le bureau de change peut combiner plusieurs petites transactions en un transfère plus conséquant. Le marchant peut demander auprès du bureau de change le lien entre chaque transfère banquaire et les dépos individuels effectués.
it: Infine, la ufficio cambi trascferirà fondi della stessa cifra dei gettoni riscattati dal negoziate verso il conto in <b>banca</b> di quest' ultimo. Nulla impedisce alla zezza di combinare molteplici piccole transazioni in un unico bonifico verso il conto del negoziante. Il negoziante può in ogni momento interrogare la ufficio cambi sullo stato dei bonifici che egli ha diritto a ricevere.

source: Most importantly, the exchange keeps cryptographic proofs that allow it to demonstrate that it is operating correctly to third parties. The system requires an external <b>auditor</b>, such as a government-appointed financial regulatory body, to frequently verify the exchange's databases and check that its bank balance matches the total value of the remaining coins in circulation.
fr: Plus important, le bureau de change conserve les preuves cryptographiques qui lui permettent de démontrer aux autres parties qu'il opère correctement. Le systeme requiere un <b>auditeur</b> externe, tel q'une authorité de régulation financière gouvernementale, qui vérifie régulièrement la base de donnée du bureau de change et vérifie que son solde banquaire correspond à la valeur totale de toutes les pièces en circulation.
it: E' importante notare che la ufficio cambi mantiene prove crittografiche che le permettono di dimostrare la sua buona fede verso terze parti. Nell'architettura di Taler è prevista la presenza di un <b>ispettore</b> esterno, come ad esempio un apparato statale del fisco, che controlla costantemente i database della ufficio cambi per verificare che il suo bilancio corrisponda sempre alla quantità di gettoni ancora in circolazione.

source: Without the auditor, the exchange operators could embezzle funds they are holding in reserve. Customers and merchants cannot cheat each other or the exchange. If any party's computers are compromised, the financial damage is limited to the respective party and proportional to the funds they have in circulation during the period of the compromise.
fr: Sans auditeur, l'entité opérant le bureau de change pourrait voler les fonds que le bureau de change garde en réserve. Clients et marchants ne peuvent se voler l'un l'autre via le bureau de change. Si les ordinateurs d'une partie sont compromis, les dégas financiers sont limités a cette partie seulement et proportionels aux fonds qu'ils ont en circulation au moment de l compromission.
it: L'assenza di taler ispettore metterebbe i gestori della ufficio cambi nelle condizioni di appropriarsi del denaro presente nelle sue riserve. Clienti e negozianti non hanno la possibilità di frodarsi a vicenda, né di frodare la ufficio cambi. Se il computer di qualcuna delle parti viene compromesso, la perdita finananziaria non tocca le altre parti ed è proporzionale ai fondi che tale computer ha in circolazione durante il periodo della compromissione.

source: Advantages for governments
fr: Avantage pour les gouvernements
it: Vantaggi per i governi

source: Taler is an electronic payment system that was built with the goal of supporting taxation. With Taler, the receiver of any form of payment is known, and the payment information comes attached with some details about what the payment was made for (but not the identity of the customer). Thus, governments can use this data to tax buisnesses and individuals based on their income, making tax evasion and black markets less viable.
fr: Taler est un système de paiement électronique qui a été créé dans le but d'aide à la taxation. Avec Taler, le créditeur de toute forme de paiement est connu, et les informations du paiement arrivent avec les détails concernant le motif du paiement. Donc, les gouvernements peuvent utiliser cette donnée pour taxer les entreprises et les particuliers en se basant sur leurs revenus, permettant ainsi de diminuer l'évasion fiscale et le marché noir.
it: Taler è un sistema di pagamento elettronico ideato con lo scopo di supportare la tassazione. Con Taler, il ricevitore di qualsiasi forma di pagamento è conosciuto, e le informazioni del pagamento arrivano con l'aggiunta di dettagli riguardo al perché sia stato effettuato. Quindi i governi possono usare questi dati per tazzare aziende e individui in base al loro reddito, così da rendere evasione fiscale e mercato nero meno usufruibili.

source: Taler's payments are cryptographically secured. Thus, customers, merchants and the exchange can mathematically demonstrate their lawful behavior in court in case of disputes. Financial damages are strictly limited, improving economic security for individuals, merchants, the exchange and the state. Most importantly, an independent auditor can ensure that there is no &quot;bad exchange&quot; within the Taler system who might threaten the economy due to fraud.
fr: Les paiements Taler sont sécurisés cryptographiquement. Ainsi, les clients, les commerçants et les fabricants de monnaies peuvent mathématiquement prouver la légalité de leurs activités en cas de litiges. Les dommages financiers sont strictement limités, améliorant la sécurité économique pour les particuliers, les commerçants, la monnaie et l'état. Plus important, un auditeur indépendant peut s'assurer qu'il n'y a pas de &quot;fausse monnaie&quot; à l'intérieur du système Taler qui pourrait menacer l'économie en raison de fraude.
it: I pagamenti fatti con Taler sono crittograficamente sicuri. In questo modo, clienti, venditori e il conio possono matematicamente dimostrare il loro comportamento legittimo in un processo, in caso di controversie. I danni finanziari sono molto limitati attraverso l'incremento di sicurezza economica per l'individuo, il venditore, il conio e lo stato. Ancora più importante è il fatto che un qualsiasi revisore di conti indipendente possa assicurare che non ci sia un &quot;conio cattivo&quot; all'interno del sistema di Taler che potrebbe minacciare l'economia attraverso frodi fiscali.

source: Taler is free software implementing an open protocol standard. Thus, Taler will enable competition and avoid the monopolization of payment systems that threatens global political and financial stability today.
fr: Taler est un logiciel libre exécutant un protocol standard ouvert. Ainsi, Taler permettra la concurrence et interdira le monopole de système de paiement qui menace la stabilité politique et financière globale actuellement.
it: Taler è un free software che implementa standard di protocollo aperto. Quindi Taler abiliterà la competizione ed eviterà la monopolizzazione dei sistemi di pagamento che oggigiorno minacciano la politica globale e la stabilità finanziaria.

source: Taler is designed to be efficient. Unlike timeline-based payment systems like BitCoin, Taler will not threaten the availability of national electric grids or (significantly) contribute to environmental pollution.
fr: Taler est conçu pour être efficace. Contrairement à des systèmes de paiement chronologiques comme BitCoin, Taler ne menacera pas la disponibilité des réseaux électriques nationaux ou (de manière siginifcative) ne participera pas à la pollution environnementale.
it: Taler è progettato per essere efficiente. A differenza dei sistemi di pagamento come BitCoin, Taler non minaccerà la disponibilità della rete elettrica nazionale o contribuirà ad incrementare (in modo significativo) l'inquinamento.

source: Taler as seen by governments
fr: Taler, du point de vu des gouvernements
it: Taler dal punto di vista dai governi

source: Governments can observe traditional wire transfers entering and leaving the Taler system, and require merchants and exchange operators to provide certain information during financial audits. Exchange operators are expected to be permanently checked by auditors, while merchants may be required to reveal information during regular tax audits. Information available to the government includes:
fr: Les gouvernements peuvent observer les transfères traditionels entrant et sortant du system Taler, et requierent des marchantes et des opérateurs du bureau de change qu'ils fournissent certaines informations lors d'audits financiers. Les opérateur du bureau de change doivent être constamment surveillé par les auditeurs, tandis que l'on peut demander aux marchants de révéler des informations suplémentaires lors des vérification fiscales. Les informations disponibles aux gouvernements incluent :
it: Organi quali gli Stati potranno osservare i trasferimenti bancari in ingresso e in uscita dal sistema Taler, e richiedere ai venditori e alla zecca le informazioni necessarie nelle ispezioni finanziarie. Gli operatori della zecca dovranno aspettarsi ripetitivi controlli da parte degli ispettori, mentre ai negozianti sarà richiesto di rivelare le informazioni necessarie soltanto durante la riscossione delle tasse. Le informazini disponibili ai governi includono:

source: From the banking system: The total amount of digital currency obtained by a customer. The government could impose limits on how many digital coins a customer may withdraw within a given timeframe.
fr: Depuis le systeme banquaire : Le montant total de monaie virtuelle acquise par un client. Le gouvernement pourrait imposer une limite sur la valeure maximale de pièces numériques qu'un client peut retirer dans un certain délais.
it: Dal sistema bancario: l'ammonto totale dei gettoni digitali in possesso di un certo cliente. Lo Stato potrebbe imporre un limite alla quantità di moneta digitale che un cliente può ritirare in un certo lasso di tempo.

source: From the banking system: The total amount of income received by any merchant via the Taler system.
fr: Depuis le système banquaire: Le montant total reçu par chaque marchant via le système Taler
it: Dal sistema bancario: La somma totale delle entrate di un negoziante attraverso Taler.

source: From auditing the exchange: The amounts of digital coins legitimately withdrawn by customers from the exchange, the value of non-redeemed digital coins in customer's wallets, the value and corresponding wire details of deposit operations performed by merchants with the exchange, and the income of the exchange from transaction fees.
fr: Depuis les audits du bureau de change : Le montant total des pièces électroniques retirées légalement par les clients auprès du bureau de change, la valeur des pièces dans les porte-monnaie des clients, la valeur et les tranfères correspondants.
it: Dalle ispezioni alla ufficio cambi: La somma di gettoni digitali ritirati dai clienti alla ufficio cambi, il valore dei gettoni ancora custoditi nei portafogli virtuali dei clienti (chiamati anche &quot;gettoni non riscattati&quot;), il valore e i dettagli dei bonifici che i mercanti hanno ricevuti in seguito alla operazione di &quot;deposito&quot; (ossia quando le monete virtuali vengono riscattate dai mercanti) effettuata presso la ufficio cambi, e le entrate della ufficio cambi dovute alle tariffe applicate ai suoi servizi

source: From auditing merchants: For each deposit operation, the exact details of the underlying contract that was signed between customer and merchant. However, this information would typically not include the identity of the customer. Note that while the customer can decide to prove that it was his transaction (i.e. in court when suing the merchant if the merchant failed to deliver on the contract), merchant, exchange and government cannot find out the customer's identity from the information that Taler collects.
fr: Grace à l'audit des marchands : Pour chaque opération de dépos, les détails exacts du contrat qui à été signé entre le marchant et le client. Néanmoins, cette information n'inclurais pas, en général, l'identité du client. Il est bon de notter que le client peut décider de prouver qu'il s'agit bien d'une transaction qu'il à effectué (par exemple dans un tribunal si le marchant n'a pas remplis sa part du contrat). Le marchant, le bureau de change et le gouvernement ne peuvent pas retrouver l'identité du client via les données collectées par Taler.
it: Dalle ispezioni ai negozianti: Per ogni operazione di deposito, i dettagli del contratto, firmato da cliente e negoziante, da cui questa è stata originata. Tipicamente, questa informazione non include l'identità del cliente. Si noti che l'identità del cliente può essere resa nota solo se questi decide volontariamente di rivelare i suoi estremi (ad esempio, nel caso ritenga di dover procedere per vie legali per risolvere un disputa con un negoziante), in quanto ufficio cambi, negozianti e ispettore fiscale non possono risalire a tale informazione sulla sola base dei dati raccoli da Taler.

source: Electronic payments for a liberal society!
fr: Paiements électroniques pour une société libre!
it: Pagamenti elettronici per una società libera!

source: Taler is a new electronic payment system under development at <a href='http://www.inria.fr/'>Inria</a>. Today, this website only presents the advantages our system is expected to provide. We expect to make the payment system operational in 2017.
fr: Taler est nouveau système de paiement électronique en développement à <a href='http://www.inria.fr/'>Inria</a>. Ce site web présente aujourd'hui seulement les avantages que notre système doit fournir. Nous estimons pouvoir rendre le système de paiement operationel en 2017.
