Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: The scalable business model for Taler is the operation of the payment service provider, which converts money from traditional payment systems (MasterCard, SEPA, UPI, Visa, Bitcoin, ACH, SWIFT, etc.) to anonymous electronic coins in the same currency. The customer can then redeem the electronic coins at a merchant, who can exchange them for money represented using traditional payment systems at the exchange. The exchange charges fees to facilitate the transactions.
de: Das Geschäftsmodell von Taler liegt im Betrieb des Bezahlsystems, das Geld aus herkömmlichen Bezahlsystemen (wie z.B. MasterCard, SEPA, UPI, Visa, Bitcoin, ACH, SWIFT usw.) in anonymisierte digitale Münzen des selben nominalen Werts in der gegebenen Währung umtauscht. Die Käufer können diese digitalen Münzen bei einem Verkäufer ausgeben, der sie wiederum bei einer Taler-Wechselstube in Geld eintauscht, das er auf sein Girokonto gutgeschrieben bekommt. Die Wechselstube erhebt für die Überweisungen geringe Gebühren.

source: The payment service operator runs the <em>Taler exchange</em>. The exchange charges <b>transaction fees</b> to customers or merchants. Its operational expenses are from wire transfers with the banking system and the operation of the computing infrastructure.
de: Der Serviceanbieter betreibt ein Bezahlsystem mit einer Taler-Wechselstube. Die Wechselstube erhebt Gebühren für die Überweisungen von Käufern oder Verkäufern. Die Gebühren enthalten die notwendigen Kosten für die Banküberweisungen von und zu Geschäftsbanken und für den Betrieb der IT-Infrastruktur.

source: Taler is a cost-effective electronic payment system which provides you with cryptographic proof that the payment worked correctly within milliseconds. Your Web customers pay with previously unknown levels of convenience without risk of fraud.
de: Taler ist ein kostengünstiges elektronisches Bezahlsystem, das eine fehlerfrei abgewickelte Bezahlung innerhalb von Millisekunden kryptographisch bestätigt. Die Kunden Ihrer Webshops zahlen mit einem bisher noch nie dagewesenen Komfort und werden keine Betrugsgefahren mehr fürchten müssen.

source: Processing transactions with Taler is fast, allowing you to confirm the transaction with your customer virtually immediately. Your customers will appreciate that they do not have to type in credit card information and play the &quot;verified by&quot; game. By making payments significantly more convenient for your customers, you may be able to use Taler for small transactions that would not work with credit card payments due to the mental overhead for customers.
de: Die Verarbeitung von Transaktionen im Taler-Bezahlsystem erfolgt blitzschnell und bestätigt Käufern und Verkäufern im gleichen Augenblick die erfolgte Bezahlung. Ihre Kunden müssen keine Kreditkarteninformationen preisgeben. Mit Taler werden vor allem kleinere Zahlbeträge wesentlich effizienter und bequemer verbucht als in anderen, teureren und komplizierteren Verfahren.

source: You will have cryptographic proof of payment from the Taler payment service provider. With Taler you never handle sensitive customer account information and thus do not have to undergo any particular security audits (such as PCI DSS). Your systems will have customer contracts with qualified signatures for all transactions which you can use in court in case of disputes.
de: Verkäufer erhalten eine kryptographisch verschlüsselte Zahlungsbestätigung vom Betreiber des Taler-Bezahlsystems. Taler verarbeitet nie sensible Bankdaten der Kunden, daher müssen sich die Verkäufer auch keinen Sicherheitsaudits (wie PCI DSS) unterziehen. Die Verkäufer bekommen stattdessen digital signierte Kaufverträge, die sie mit den Käufern abgeschlossen haben, mit denen sie sogar bei Gerichtsprozessen Transaktionsnachweise erbringen können.

source: Taler is free software, and you can use the liberally-licensed reference code as a starting point to integrate Taler into your services. To use Taler, you do not need to pay license fees, and the free software development model will ensure that you can select from many competing integrators for support.
de: Taler ist freie Software. Der Referenzcode darf aufgrund seiner öffentlichen Lizenz in die bestehenden Bezahlsysteme und Handelsplattformen integriert werden und für seine Verwendung fallen auch keine Lizenzgebühren an. Das Entwicklungsprinzip freier Software stellt zudem sicher, dass man immer aus einer Vielzahl von Anbietern für Integration und Support wählen kann.

source: Taler is uses efficient cryptographic constructions with low bandwidth and storage requirements. Combined with Taler's strong security which makes fraud impossible, Taler payment service providers can operate with very low overhead and thus offer low transaction fees.
de: Taler verwendet effiziente kryptographische Algorithmen mit nur geringem Bedarf an Bandbreite und Speicherplatz. Betreiber von Taler-Bezahlsystemen müssen von ihren Kunden nur minimale Gebühren verlangen, weil sie einen hohen Sicherheitsstand bieten, der Verluste durch Betrug von vornherein ausschließt, und ihre Anlagen gleichzeitig sehr geringe Fixkosten erfordern.

source: Flexible
de: Flexibel
it: Flessibile

source: Taler can be used for different currencies (such as Euros, US Dollars or Bitcoins) and any amount, limited only by applicable regulatation and what denominations the payment service provider supports.
de: Taler kann man einsetzen für verschiedene Währungen (wie Euro, US-Dollar oder Bitcoin) und für jeden Betrag bis zu den Grenzen, die allein gesetzliche Regulierungen bzw. die Betreiber von Bezahlsystemen festlegen.

source: Taler prevents tax evasion and money laundering. Taler's protocols are efficient and do not use wasteful proof-of-work calculations. Taler encourages transparency by providing an open standard and free software reference implementations.
de: Taler verhindert Steuerhinterziehung und Geldwäsche. Die Protokolle von Taler sind effizient und benötigen kein stromfressendes Mining. Taler unterstützt die Transparenz mit einem offenen Standard und freier Software.

source: The backend <b>signs</b> and <b>stores</b> the complete terms of offers made by the merchant to customers. For this, the merchant's frontend needs to give the customer's order in a JSON format to the backend.
de: Das Backend signiert und speichert sämtliche Bedingungen der Verträge, die Käufer und Verkäufer vorher vereinbart hatten. Das Händlerfrontend liefert dafür die vom Käufer bestellten Artikelnummern im JSON-Format an das Backend.

source: The backend <b>validates</b> payments received from the wallet and <b>executes</b> them with the Taler payment service provider (the exchange). For this, the merchant's frontend must pass the payment request through to the Taler backend and check the HTTP status code that is returned.
de: Das Backend validiert die Signaturen aus den Taler-Geldbörsen und sendet sie der Taler-Wechselstube zur Ausführung. Das Händlerfrontend muss dann die Zahlungsaufforderung an das Taler-Backend senden und den zurückgemeldeten HTTP-Statuscode gegenprüfen.

source: The backend can <b>list</b> completed transactions and <b>map</b> wire transfers to sets of business transactions, including the exact terms of each contract.
de: Das Backend kann die erfolgreich abgewickelten Transaktionen auflisten und die Überweisungen an Girokonten der Geschäftsbanken mit den genauen Bedingungen jedes Kaufvertrags und nach Geschäftsvorfällen geordnet anzeigen.

source: GNU Taler
de: Das Taler-Bezahlsystem

source: en
fr: fr
it: it

source: About us
fr: À&nbsp;propos
it: Chi siamo

source: Advantages for citizens
fr: Avantages pour les citoyens
it: Vantaggi per i cittadini

source: Taler is the electronic equivalent of cash, except harder to fake. If your digital wallet is lost -- say because your computer is irreparably damaged or compromised -- only the amount of coin stored in your wallet will be lost. Unlike a physical wallet, you can make backups of your digital wallet which can provide security against data loss. So your digital wallet works mostly just like a physical wallet, except online and without the need to manually count coins.
fr: Taler est l’équivalent électronique de la monnaie, sauf qu’il est plus difficile de le falsifier. Si vous perdez votre portefeuille électronique -- parce que votre ordinateur est totalement HS ou en panne -- seul le montant de la monnaie stockée dans votre portefeuille sera perdu. Contrairement à un portefeuille classique, vous pouvez faire des mises à jour de votre portefeuille numérique qui sécurise contre la perte de données. Donc votre portefeuille numérique fonctionne comme un portefeuille classique, mais en ligne et sans avoir à compter manuellement votre monnaie.
it: Taler è l'equivalente elettronico dei contanti, tranne per il fatto che è più difficile da falsificare. Se il tuo portafoglio digitale va perso (ad esempio, perché il tuo computer è stato danneggiato irreparabilmente o compromesso), solo l'ammontare di denaro contenuto in esso andrà perduto a sua volta. A differenza di un portafoglio reale, è possibile fare un backup di quello digitale, così da garantire sicurezza contro la perdita dei dati. Quindi il tuo portafoglio digitale funziona per lo più come quello reale, eccetto il fatto che sia online ed eviti di contare manualmente le monete.

source: Privacy
fr: Confidentialité

source: Your transactions are private, neither the exchange nor merchant needs to learn your identity. There is no need to give our credit card numbers or other sensitive information, and the merchant will only be able to do exactly the transaction you confirmed using your digital wallet.
fr: Vos transactions sont privées, ni la bureau de change, ni les commerçants n'ont besoin de connaitre votre identité. Vous n'avez pas besoin de communiquer votre numéro de carte de crédit ou tout autre information sensible, et le commerçant ne pourra qu'effectuer la transaction que vous aurez confirmée en utilisant votre portefeuille numérique.
it: Le tue transazioni sono private, né la ufficio cambi, né il venditore hanno bisogno di conoscere la tua identità. Non c'è necessità di rivelare il numero di carta di credito o altre informazioni riservate, e il venditore sarà solo in grado di fare l'esatta transazione che tu hai confermato usando il tuo portafoglio digitale.

source: Convenience
fr: Avantage
it: Convenienza

source: You will be able to withdraw digital coins to replenish your wallet using your credit card or SEPA transactions, similar to how you pay or withdraw cash today.
fr: Vous pourrez retirer de la monnaie numérique pour recharger votre portefeuille en utilisant votre carte de crédit ou des transactions SEPA, de la même manière que vous payez ou retirer du liquide aujourd'hui.
it: Potrai prelevare le tue monete digitali per riempire il portafoglio usando la carta di credito o transazioni SEPA, simili al modo in cui paghi o prelevi contanti normalmente al giorno d'oggi.

source: Stability
fr: Stabilité
it: Stabilità

source: Coins in your digital wallet will be of the same denomination as the cash in your physical wallet. So you will not have to worry about currency fluctuations or conversion rates. Like a physical wallet, you can carry digital coins of different currencies in your digital wallet at the same time.
fr: La dénomination de votre monnaie dans votre portefeuille numérique sera la même que celle de votre portefeuille classique. Vous n'aurez donc pas à vous inquiéter des fluctuations des cours des monnaies ou des taux de conversion. Comme un portefeuille classique, vous pouvez avoir en même temps des monnaies de différentes devises dans votre portefeuille numérique.
it: Il denaro nel tuo portafoglio digitale sarà sotto la stessa denominazione di quello nel portafoglio reale, così da non doverti preoccupare per la svalutazione della valuta o per le tariffe di conversione. Come in un portafoglio normale, puoi avere allo stesso tempo monete digitali di diverse valute nel tuo portafoglio digitale.

source: Taler as seen by customers
fr: Taler du point de vu des clients
it: Come i clienti vedono Taler

source: Customers interact with the Taler system mostly using a free wallet implementation, which may be an extension or plugin to their browser or a custom application on their computer(s). Typical steps performed by customers are:
fr: Les clients intéragessent avec Taler pricipalement à l'aide d'une implémentation libre du porte-monnaie, qui peut être un plugin ou extension pour navigateur ou une application dédiée sur leur ordinateur.
it: I cliente interagiscono con Taler principalmente utilizzando un portafoglio elettronico gratuito, che può presentarsi sia come una estensione per il loro browser, sia come una applicazione dedicata. Le tipiche operazioni fatte da un cliente sono:

source: The customer selects an exchange (i.e. by visiting the respective website or selecting from a list of exchanges in the application) and asks the wallet to create bank transfer instructions to withdraw a certain amount of electronic cash. The bank transfer instructions will contain an access code that must be included in the subject of the transaction, as well as the wire details for the exchange (i.e. a SEPA account number).
fr: Le client choisit un bureau de change (en visitant le son site ou en le choisissant parmis une liste fournie par le porte-monnaie) et demande au porte-monnaie de préparer un virement banquaire pour retirer une certaine quantité d'argent électronique. Les instructions de transfer de la banque contiennent un code d'acces qui doit être inclus dans le sujet du transfere, de même que dans les détails du virement du bureau de change.
it: Il cliente seleziona una ufficio cambi (visitandone il sito o selezionandola da una lista nel caso egli usi l'applicazione dedicata) e chiede al suo portafoglio di creare le istruzioni per un bonifico che avrà come effetto finale quello di ottenere gettoni elettronci. Tali istruzioni conterranno un codice d'accesso che dovrà essere incluso nella causale del bonifico, nonché le coordinate bancarie della ufficio cambi (che sarà un conto compatibile con SEPA).

source: The customer then instructs his <b>bank</b> to transfer funds from his account to the Taler exchange using these instructions provided by the wallet (top left).
fr: Le client demande ensuite à sa <b>banque</b> de transfèrer les fonds de son compte vers le bureau de change en utilisant les informations fournies par le porte-monnaie (en haur à gauche).
it: Il cliente si rivolge alla sua <b>banca</b> per trasferire fondi dal suo conto a quello della ufficio cambi, utilizzando le istruzioni create dal suo portafoglio (in alto a sinistra).

source: Once the funds have arrived, the wallet will automatically withdraw the electronic coins. The customer can use the wallet to review his remaining balance at any time. He can also make backups to secure his digital coins against hardware failures.
fr: Une fois que les fonds sont arrivés, le porte-monnaie retirera automatiquement les pièces électroniques. Le client peut utiliser le porte-monnaie à tout moment pour connaitre son contenu.
it: Una volta che i fondi sono arrivati alla zecca, il portafoglio ritirerà automaticamente il corrispettivo in gettoni elettronici. Il cliente può sempre usare il portafogli per controllare il suo bilancio. Può anche effettuare copie di sicurezza come prevenzione verso malfunzionamenti o danni alla sua macchina.

source: When visiting a merchant that supports Taler, an additional payment option for Taler is enabled in the checkout system. If the customer selects payments via Taler, the wallet displays the secured contract from the merchant and asks for confirmation. Taler does not require the customer to provide any identity information to the merchant. Transaction histories and digitally signed contracts can be preserved in the wallet for future review by the customer, or even use in court.
fr: Lorsqu'un un marchand qui supporte Taler comme système de payement est visité une option de payement supplémentaire est visible. Si le client choisit cette option, le porte-monnaie affiche le contract du marchant et demande une confirmation. Taler ne requiert pas du client qu'il fournisse des informations sur son identité au marchant. Les historiques de transactions et les contracts signés numériquement sont stockés dans le porte-monnaie pour pouvoir être revu par le client plus tard, ou même dans un tribunal.
it: Se un certo venditore supporta Taler, il suo sito mostrerà una nuova opzione di pagamento. Se il cliente sceglie Taler, il portafoglio mostrerà, previo controllo di sicurezza, il contratto del venditore e chiederà una conferma. Taler non richiede che il cliente riveli alcun dato personale al venditore. Gli storici delle transazioni e i contratti possono essere mantenuti nel portafoglio per future revisioni da parte del cliente o persino per essere mostrati durante una causa.

source: Taler is free software implementing an open protocol. Anybody is welcome to inspect our code and integrate our reference implementation into their applications. Different components of Taler are being made available under different licenses. The Affero GPLv3+ is used for the exchange, the LGPLv3+ is used for reference code demonstrating integration with merchant platforms, and licenses like Apache/Mozilla/GPLv3+ are used for wallets and related customer-facing software. We are open for constructive suggestions for maximizing the adoption of this libre payment platform.
fr: Taler est un logiciel libre exécutant un protocol ouvert. Vous êtes les bienvenus pour inspecter notre code et intégrer nos applications référence dans vos applications. Différents composants de Taler sont disponibles sous plusieurs licences. L'Affero GPLv3+ est utilisé pour la monnaie, le LGPLv3+ est utilisé pour le code référence montrant l'intégration sur des plateformes machandes, et des licences comme Apache/Mozilla/GPLv3+ sont utilisées pour les portefeuilles et le lien client-logiciel orienté. Nous sommes ouverts à toute suggestion constructive pour exploiter au maximum cette plateforme de paiement libre.
it: Taler è un free software che utilizza un protocollo aperto. Chiunque è benvenuto per esaminare il nostro codice e integrare le nostre implementazioni di riferimento nelle loro applicazioni. Diversi componenti di Taler sono stati resi disponibili sotto diverse licenze. Affero GPLv3+ è usata per la exchange, LGPLv3+ per il codice di riferimento che mostra l'integrazione con la piattaforma del venditore, e licenze come Apache/Mozilla/GPLv3+ sono usate per i portafogli e i relativi software di interfaccia dei clienti. Siamo aperti a suggerimenti costruttivi per massimizzare l'adozione di questa piattaforma di pagamento free.

source: Taler is designed to work on the Internet. To ensure that Taler payments can work with restrictive network setups, Taler uses a RESTful protocol over HTTP or HTTPS. Taler's security does not depend upon the use of HTTPS, but obviously merchants may choose to offer HTTPS for consistency and because it generally is better for privacy compared to HTTP. Taler uses JSON to encode structure data, making it easy to integrate Taler with existing Web applications. Taler's protocol is documented in detail <a href='https://api.taler.net/'>here</a>.
fr: Taler est conçu pour fonctionner sur Internet. Afin de s'asurer que les paiement Taler fonctionnent sur des installations réseaux restrictives, Taler utilise le protocole RESTful sur HTTP ou HTTPS. La sécurité Taler ne dépend pas de l'utilisation de HTTPS, mais naturellement les commerçants voudront choisir HTTPS pour l'uniformité et car c'est généralement meilleur pour la confidentialité comparé à HTTP. Taler utilise JSON pour coder les données structure, rendant Taler facile à intégrer avec des application Web existantes. Le protocole Taler est documenté en détail <a href='https://api.taler.net/'>ici</a>.
it: Taler è progettato per funzionare su Internet. Per assicurare che i pagamenti in Taler possano funzionare con configurazioni di rete ristrette, Taler usa un protocollo RESTful su HTTP o HTTPS. La sicurezza di Taler non dipende dall'uso di HTTPS, ma ovviamente i venditori possono scegliere di offrire HTTPS per maggior compattenza e perché è generalmente migliore per la privacy se paragonato a HTTP. Taler usa JSON per codificare i dati di struttura, rendendo facile integrare Taler con le già esistenti applicazioni web. Il protocollo usato da Taler è documentato nel dettaglio <a href='https://api.taler.net/'>qui</a>.

source: Taler is currently primarily developed by a research team at Inria and TU Munich. However, contributions from anyone are welcome. Our Git repositories can be cloned using the Git and HTTP access methods against <tt>git.taler.net</tt> with the name of the respective repository. A list of public repositories can be found in our <a href='https://git.taler.net/'>GitWeb</a>.
fr: Taler est actuellement principalement développé par une équipe de recherche à Inria et TU Munich. Néanmoins, les contributions de tous sont les bienvenues. Notre Stockage Git peut être cloné en utilisant les méthodes d'accès Git et HTTP sur <tt>git.taler.net</tt> avec le nom du stockage respectif. Une liste des lieux de stockage publics se trouve sur notre <a href='https://git.taler.net/'>GitWeb</a>.
it: Attualmente Taler è principalmente sviluppato da un team di ricercatori di Inria e TU Munich. Comunque, sono ben accetti contributi da parte di chiunque. Le nostre repository di Git possono essere clonate applicando il metodo d'accesso di Git e HTTP su questo link <tt>git.taler.net</tt>, con il nome della corrispettiva repository. Una lista delle repository pubbiche può essere trovata al nostro <a href='https://git.taler.net/'>GitWeb</a>.

source: In addition to this website, the <a href='https://git.taler.net/'>documented code</a> and the <a href='https://api.taler.net/'>API documentation</a>, we are in the process of preparing a comprehensive design document which will be published here soon.
fr: En supplément de ce site web, le <a href='https://git.taler.net/'>documented code</a> et l'<a href='https://api.taler.net/'>API documentation</a>, nous préparons un document exhaustif qui sera publié ici prochainement.
it: Oltre a questo sito, il <a href='https://git.taler.net/'>codice documentato</a>, e la <a href='https://api.taler.net/'>documentazione API</a>, siamo preparando un documento integrale di progettazione che sarà presto pubblicato qui.

source: We have a mailinglist for developer discussions. You can subscribe to it or read the list archive at <a href='http://lists.gnu.org/mailman/listinfo/taler'>http://lists.gnu.org/mailman/listinfo/taler</a>.
fr: Nous avons une liste pour le discours public des developers. On peut s'inscrire ou lire les archives à <a href='http://lists.gnu.org/mailman/listinfo/taler'>http://lists.gnu.org/mailman/listinfo/taler</a>.

source: We have <a href='https://buildbot.net/'>Buildbot</a> automation tests to detect regressions and check for portability at <a href='https://buildbot.taler.net/'>buildbot.taler.net</a>.
fr: Des tests de régression automatiques ont été mis en place grace à <a href='https://buildbot.net/'>Buildbot</a> et sont disponibles à <a href='https://buildbot.taler.net/'>buildbot.taler.net</a>.
it: E' disponibile un <a href='https://buildbot.net/'>Buildbot</a> dedicato a test automatici per individuare regressioni e controllare la portabilità, alla pagina <a href='https://buildbot.taler.net/'>buildbot.taler.net</a>.
