Repository: marado/gnunet-www
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: de, es, fr, it, zh_hant

source: <a href='/citizens'>Citizens</a>
fr: <a href='/citizens'>Citoyens</a>

source: <a href='/merchants'>Merchants</a>
fr: <a href='/merchants'>Commerçants</a>

source: <a href='/governments'>Governments</a>
fr: <a href='/governments'>Gouvernements</a>

source: <a href='/developers'>Developers</a>
fr: <a href='/developers'>Développeurs</a>

source: <a href='/about'>About&nbsp;us</a>
fr: <a href='/about'>À&nbsp;propos</a>

source: Developers
it: Sviluppatori

source: Business model
it: Modello business

source: Merchants
it: Venditori

source: Merchants supporting the Taler system need to integrate some relatively simple logic into their transaction processing system. Typical steps performed by the merchant system are:
it: Al fine di supportare Taler, i negozianti dovranno integrare alcune semplici procedure nei loro sistemi di ricezione dei pagamenti

source: The new logic detects when a customer's system supports Taler and then needs to send a cryptographically signed version of the proposed contract in a simple JSON format to the customer. The message also includes salted, hashed wire details for the merchant, as well as restrictions as to which exchange operators the merchant is willing to deal with.
it: La nuova procedura rileva il caso in cui un cliente supporta Taler, e procede ad inviarvi un contratto digitale firmato in un semplice formato JSON. Il messaggio include anche le coordinate bancarie del negoziante fissate in un &quot;hashcode&quot; assieme ad un numero casuale, nonché la lista delle zecche con cui il negoziante è disposto a trattare.
